{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-27-2025-08-27-6a3edb",
  "num": "2025-08-27-6a3edb",
  "date_str": "2025-08-27",
  "description": "Mahamaya Balika Maha Vidyalaya, Kadawatha, Holds Inaugural Sitting…",
  "url_metadata": "https://pmd.gov.lk/news/mahamaya-balika-maha-vidyalaya-kadawatha-holds-inaugural-sitting-of-student-parliament-at-presidential-secretariat/",
  "lang": "en",
  "article_title": "Mahamaya Balika Maha Vidyalaya, Kadawatha, Holds Inaugural Sitting of Student Parliament at Presidential Secretariat",
  "article_body_paragraphs": [
    "The ceremonial sitting of the Student Parliament of Mahamaya Balika Maha Vidyalaya, Kadawatha, was held yesterday (26) in the Old Parliament Chamber of the Presidential Secretariat.",
    "This opportunity was extended to Mahamaya Balika Maha Vidyalaya, Kadawatha, in line with the series of programmes conducted jointly by the Presidential Secretariat, the Ministry of Education and the Parliament Department of Communication, for the benefit of schoolchildren.",
    "On this occasion, members of the school’s Student Parliament were provided with the opportunity to gain an understanding of the history of parliamentary traditions, the functions and responsibilities of Parliament, as well as the conceptual value and practical importance of the “Clean Sri Lanka” project.",
    "A notable feature of the event was the appointment of a minister in the school’s Student Parliament to oversee the “Clean Sri Lanka” project. Certificates were also awarded to the ministers and members of the Student Parliament on this occasion.",
    "The event was attended by Deputy Chairperson of Committees of the Parliament of Sri Lanka, Hemali Weerasekara, Senior Additional Secretary to the President, Prasanna Chandith, Director General of Public Relations of the Presidential Secretariat, Dharmasiri Gamage, Director of Legislative Services and Communication of the Parliament of Sri Lanka, Jayalath Perera, together with the Principal of Mahamaya Balika Maha Vidyalaya, Kadawatha and a group of academic staff."
  ]
}