{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-03-en-eaf36c",
  "num": "en-eaf36c",
  "date_str": "2025-06-03",
  "description": "Meeting Between President and Australian Deputy Prime Minister",
  "url_metadata": "https://pmd.gov.lk/news/meeting-between-president-and-australian-deputy-prime-minister/",
  "lang": "en",
  "article_title": "Meeting Between President and Australian Deputy Prime Minister",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake held discussions with the Deputy Prime Minister and Minister for Defence of Australia Richard Marles at the Presidential Secretariat this morning (03).",
    "The meeting focused on further strengthening the historic ties between Sri Lanka and Australia, with a particular emphasis on enhancing bilateral cooperation.",
    "President Disanayake highlighted Sri Lanka’s progress towards economic stability and briefed Deputy Prime Minister Marles on the government’s ongoing efforts to combat corruption and fraud. He also expressed appreciation for the Australian Government’s support in recent maritime security operations and its assistance in addressing illegal trade, human trafficking, terrorism and arms smuggling. The President further reaffirmed that Sri Lanka remains a secure destination for tourism and investment.",
    "Deputy Prime Minister Marles, reflecting on the 70-year economic and political relationship between the two countries, conveyed Australia’s commitment to working closely with Sri Lanka’s new administration.",
    "He praised the government’s anti-corruption initiatives and emphasized that enhancing trade, economic, political, tourism and investment relations was a central objective of his visit.",
    "The Australian delegation included Mr Paul Stephens, Australian High Commissioner to Sri Lanka; Mr Gregory Laurence Moriarty, Secretary of the Department of Defence; Mr Simon Eric O’Connor, Senior Adviser to the Deputy Prime Minister; and Ms Lalita Kapur, Australian Deputy High Commissioner to Sri Lanka. Representing Sri Lanka were Dr Nandika Sanath Kumanayake, Secretary to the President and Mr Roshan Gamage, Additional Secretary to the President."
  ]
}