{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-03-12-en-94ca06",
  "num": "en-94ca06",
  "date_str": "2025-03-12",
  "description": "Urgent Measures Needed to Control Flooding in the…",
  "url_metadata": "https://pmd.gov.lk/news/urgent-measures-needed-to-control-flooding-in-the-matara-district-secretary-to-the-president-2/",
  "lang": "en",
  "article_title": "Urgent Measures Needed to Control Flooding in the Matara District – Secretary to the President",
  "article_body_paragraphs": [
    "The Secretary to the President, Dr. Nandika Sanath Kumanayake, has instructed officials from the Ministries of Agriculture, Livestock, Land and Irrigation, and Urban Development, Construction, and Housing to take all necessary measures to minimize potential flooding in the Matara district due to heavy rainfall.",
    "These directions were given by the Secretary to the President during a meeting today (12) at the Presidential Secretariat with officials from all relevant ministries and institutions.",
    "The progress of a previous discussion on the project of Salinity Barrier across Nilwala River, led by the Secretary to the President, was reviewed during the meeting. Various short-term and long-term measures to control the flooding in the Matara region caused by the barrier were proposed, and all parties agreed to take necessary steps. The meeting also assessed the progress of these proposed actions.",
    "Accordingly, officials informed that the University of Peradeniya and its affiliated Engineering Design Center have been assigned to study and report on long-term solutions. It was also stated that the proposed solutions would take into account the issues that have arisen following the Construction of Salinity Barrier.",
    "As short-term solutions, officials reported that steps have already been taken to remove fallen trees and other obstructions in the river to ensure faster water drainage during emergencies. Additionally, canal banks are being cleaned, and the temporary salinity barrier, previously constructed with sandbags by the National Water Supply and Drainage Board, has been removed.",
    "Furthermore, by April, measures will be taken to deepen the Nilwala estuary and canal routes to temporarily retain excess water during flood situations. The Irrigation Department also proposed increasing the capacity of the water pumps currently used to accelerate water drainage.",
    "The Secretary to the President Dr. Kumanayake also instructed that all measures taken on this matter be reported to the Matara District Development Committee.",
    "Local residents and farmers have expressed concerns that the Nilwala Salinity Barrier has exacerbated flooding and led to saltwater intrusion into paddy fields, resulting in crop damage.",
    "The meeting was attended by Senior Additional Secretary to the President, Kapila Janaka Bandara, along with senior officials from the relevant ministries."
  ]
}