{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-01-12-en-32f2ec",
  "num": "en-32f2ec",
  "date_str": "2025-01-12",
  "description": "Sri Lanka Customs Officers Commit to Round-the-Clock Operations…",
  "url_metadata": "https://pmd.gov.lk/news/sri-lanka-customs-officers-commit-to-round-the-clock-operations-to-expedite-clearance-process/",
  "lang": "en",
  "article_title": "Sri Lanka Customs Officers Commit to Round-the-Clock Operations to Expedite Clearance Process",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake, during a meeting held today (12) at the Presidential Secretariat with representatives from Sri Lanka Customs and port-related service providers, reached several important agreements aimed at resolving the ongoing delays in the clearance of imported containers. The President instructed officials to take immediate action to eliminate the delays within the next four days. He also engaged in detailed discussions about the issues faced by state institutions, including Sri Lanka Customs, as well as the challenges encountered by port service providers. While emphasizing the necessity of implementing short-term, medium-term, and long-term plans for port sector development, the President underscored the urgent need for a joint effort by all parties to address the current crisis. As a result, both public and private sector stakeholders agreed to work together towards an immediate resolution.",
    "To expedite the clearance process, Sri Lanka Customs officers agreed to operate continuously, 24 hours a day, seven days a week. Additionally, a 5-acre plot of land in the Bloemendhal Disanayake area was allocated for storing containers pending investigation, with plans to release 2 acres by January 31 and the remaining portion by February 28. Addressing the issue of congestion caused by idle container vehicles at port terminals, the government agreed to provide land in the Peliyagoda area for parking these vehicles, thereby easing the traffic at the terminals.",
    "Further, delays caused by regulatory agencies such as the Sri Lanka Standards Institution (SLSI), the Department of Food Commissioner, and the Plant Quarantine Division were highlighted during the discussion. It was revealed that staff shortages in these institutions were a significant factor contributing to the delays. In response, the President directed the relevant authorities to fill these vacancies promptly and to enhance welfare allowances for the officers of these institutions to ensure a more efficient clearance process.",
    "Minister of Transport, Highways, Ports, and Civil Aviation, Bimal Ratnayake, stated that if there are any financial requirements related to this process, they can be provided by the Ministry of Ports. Additionally, private associations requested the President to take disciplinary action against clerical staff who fail to report for duty on time during the container clearance process. The Minister further emphasized that it is the responsibility of the respective private companies to ensure that their employees report to work promptly.",
    "Importers agreed that food-related products must be accompanied by mandatory certificates issued by foreign laboratories following proper testing, and in the event of any violations, appropriate legal action will be taken in accordance with government regulations. A decision was made to reduce the period during which containers can be stored within the port premises without charge to two days. Furthermore, it is anticipated that this period will be further reduced to one day starting from June.\nMinister Ratnayake also noted that this expedited clearance process would continue until June 30 and stressed the need for all stakeholders, including the port, customs, and private service providers, to work together as one unified team.",
    "The meeting was attended by the Minister of Labour and Deputy Minister of Economic Development, Professor Anil Jayanta Fernando; Secretary to the President, Dr. Nandika Sanath Kumanayake; Senior Additional Secretaries to the President, Russell Aponsu and Kapila Perera; officials from Sri Lanka Customs, Sri Lanka Ports Authority, and Sri Lanka Standards Institution; officers from the Department of Food Commissioner; representatives from the Association of Sri Lankan Shipping Agents, the Association of Container Operators, and the Association of Container Transporters; as well as officers involved in import and export clearance operations."
  ]
}