{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-02-25-en-8b0d55",
  "num": "en-8b0d55",
  "date_str": "2025-02-25",
  "description": "Empowering Public Enterprises: Knowledge Exchange Workshop Held",
  "url_metadata": "https://pmd.gov.lk/news/empowering-public-enterprises-knowledge-exchange-workshop-held/",
  "lang": "en",
  "article_title": "Empowering Public Enterprises: Knowledge Exchange Workshop Held",
  "article_body_paragraphs": [
    "As part of the government’s long-term commitment to promoting economic stability and improving public service delivery, a workshop on knowledge exchange for public enterprises was held today (25) at the Miloda Academy of financial Studies in Colombo.",
    "This workshop was organized by the Presidential Secretariat in collaboration with the MBA Alumni Association of the University of Colombo. It focused on enhancing the efficiency, accountability, and contribution of public enterprises to national economic development through institutional governance, financial management, and the strengthening of anti-corruption measures.",
    "The Senior Additional Secretary to the President for Finance and Economic Affairs, Mr. G. M. R. D. Aponsu, expressed views on improving the management of public enterprises.",
    "President of the MBA Alumni Association of the University of Colombo, Mr. Suraj Radampola discussed the goals of the workshop and emphasized the importance of knowledge exchange for improving the performance of public enterprises.",
    "The workshop featured three main sessions: “Institutional Governance for Public Enterprises,” presented by President’s Counsel and Senior Board Member Dr. Harsha Cabral, “Financial Discipline and Accountability for Public Enterprises,” delivered by Past President of the Institute of Chartered Accountants of Sri Lanka Mr. Manil Jayesinghe and “Relevance of Anti-Corruption Laws for Public Enterprises,” led by Commissioner of the Commission for investigating allegations of bribery or corruption (CIABOC) Mr.Chethiya Goonasekera.",
    "In the past, the government had considered closing down or privatizing certain state enterprises. However, the current administration has adopted a more reform-oriented approach, focusing on improving the performance of state enterprises while retaining public ownership. This involves reviewing underperforming enterprises, exploring consolidation, and restructuring management frameworks to improve efficiency. This workshop thus provided a key platform to impart the necessary understanding for decision-makers to implement reforms and innovations in line with the government’s new approach.",
    "Furthermore, the government hopes that improving the performance of public enterprises through this workshop will contribute to building a culture of responsibility and sustainability, aligning with the goals of the “Clean Sri Lanka” program.",
    "Around 100 senior officials, including chairpersons, general managers, treasury representatives, ministry officers, and board members from 20 key public enterprises, including Ceylon Fisheries Corporation (CFC), Ceylon Petroleum Corporation (CEYPETCO), Cey-Nor Foundation Limited, Elkaduwa Plantations Limited, Kahatagaha Graphite Lanka Limited, Lanka Mineral Sands Limited, Lanka Phosphate Limited, Lanka Sathosa Limited, Lanka Sugar Company (Pvt) Ltd (LSCPL), and Milco (Pvt) Ltd, attended the workshop."
  ]
}