{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-10-10-en-f5ac1d",
  "num": "en-f5ac1d",
  "date_str": "2024-10-10",
  "description": "Pakistan High Commissioner Meets President Anura Kumara Dissanayake",
  "url_metadata": "https://pmd.gov.lk/news/pakistan-high-commissioner-meets-president-anura-kumara-dissanayake/",
  "lang": "en",
  "article_title": "Pakistan High Commissioner Meets President Anura Kumara Dissanayake",
  "article_body_paragraphs": [
    "Pakistan’s High Commissioner to Sri Lanka, Maj. Gen. Faheem Ul Aziz, met with President Anura Kumara Dissanayake today (10) at the Presidential Secretariat.",
    "High Commissioner Aziz extended his congratulations to President Dissanayake on his recent election victory and conveyed Pakistan’s commitment to strengthening its partnership with Sri Lanka.",
    "As part of the meeting, High Commissioner Aziz delivered a letter of congratulations from Pakistan’s President, Asif Ali Zardari, who emphasized the deep ties between the two nations. “Pakistan deeply values its close relations with Sri Lanka. Our bilateral cooperation is rooted in shared values of democracy, pluralism, rule of law, mutual understanding, and respect. I look forward to working closely with you for further strengthening the bilateral relations for the mutual benefit of our two peoples,” President Zardari stated.",
    "The discussions between President Dissanayake and High Commissioner Aziz focused on enhancing the longstanding political and security ties between the two countries. The High Commissioner also reaffirmed Pakistan’s support in the defence sector.",
    "Educational cooperation was another key point of discussion, with both parties exploring the expansion of Pakistan’s scholarship offerings to Sri Lankan students, currently focused on the medical field, to include agriculture and IT. They also addressed opportunities for collaboration in the development of Sri Lanka’s livestock sector as a means to tackle rural poverty.",
    "The meeting underscored the robust relationship between Sri Lanka and Pakistan, with both sides committed to further deepening cooperation across multiple sectors."
  ]
}