{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-03-en-0fe2f4",
  "num": "en-0fe2f4",
  "date_str": "2025-04-03",
  "description": "Committee Appointed to Provide Recommendations on the New…",
  "url_metadata": "https://pmd.gov.lk/news/committee-appointed-to-provide-recommendations-on-the-new-us-tariff-system-meets-president/",
  "lang": "en",
  "article_title": "Committee Appointed to Provide Recommendations on the New US Tariff System Meets President",
  "article_body_paragraphs": [
    "The Committee appointed to explore necessary measures and submit recommendations to the Government regarding the new US tariff system met with President Anura Kumara Disanayake this afternoon (April 3) at the Presidential Secretariat.",
    "During the discussion, an in-depth review was conducted on the background and basis of these tariffs, as well as the economic challenges that small economies like Sri Lanka may face due to the imposition of high-value tariffs.",
    "A comprehensive discussion was also held on the course of action Sri Lanka should take in response to the emerging situation and the necessary steps to be implemented moving forward.",
    "Representing the Committee, Senior Economic Advisor to the President Mr. Duminda Hulugamuwa, Secretary to the Ministry of Finance Mr. Mahinda Siriwardana, Governor of the Central Bank Dr. Nandalal Weerasinghe, Secretary to the Ministry of Trade Mr. A. Wimalaneththiraja, Chairman of the Export Development Board Mr. Mangala Wijesinghe, Senior Director General (Bilateral) at the Ministry of Foreign Affairs Mr. Dharshana Perera, Chief Economic Policy Advisor to the Ceylon Chamber of Commerce Mr. Shiran Fernando, Group Chief Executive Officer of Brandix Mr. Ashroff Omar, Co-Founder of MAS Holdings Mr. Sharad Amalean, Managing Director of Lanka Garments Mr. Saif Jafferjee and Ms. Nilanthi Weliwe representing Michelin Lanka Pvt Ltd were present at the meeting.",
    "Additionally, Minister of Labour and Deputy Minister of Economic Development Dr.Anil Jayanta Fernando and Deputy Minister of Finance and Planning Dr. Harshana Suriyapperuma also participated in the discussion."
  ]
}