{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-03-06-en-0ce27b",
  "num": "en-0ce27b",
  "date_str": "2025-03-06",
  "description": "Expedite Compensation Payments for Crop Damages – President…",
  "url_metadata": "https://pmd.gov.lk/news/expedite-compensation-payments-for-crop-damages-president-instructs-officials/",
  "lang": "en",
  "article_title": "Expedite Compensation Payments for Crop Damages – President Instructs Officials",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake has instructed relevant officials to expedite the process of providing compensation for crop damages caused by recent heavy rains and natural disasters.",
    "The President gave these instructions during a meeting held today (06) at the Presidential Secretariat with officials from the Ministry of Agriculture, Livestock Land and Irrigation.\nThe meeting was convened to review the budgetary allocations for 2025, specifically the funds designated to the Ministry of Agriculture, Livestock, Land and Irrigation, and to ensure their effective utilization for relevant projects.",
    "The President drew the attention of officials to the errors in decision-making caused by inaccuracies in agricultural data.",
    "The necessity of ensuring fair market prices for agricultural produce was also emphasized, with the objective of protecting farmers while maintaining reasonable prices for consumers.\nThe discussion addressed measures for the advancement of the livestock sector, the promotion of export-oriented agricultural crops, and the progress of Milco operations.",
    "The meeting was attended by Minister of Agriculture, Livestock, Land and Irrigation K.D. Lal Kantha, Deputy Minister of Land and Irrigation Dr. Susil Ranasinghe, Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Agriculture, Livestock, Land and Irrigation D.P. Wickramasinghe, Senior Additional Secretary to the President Kapila Janaka Bandara, Commissioner General of the Department of Agrarian Development U.B. Rohana Rajapaksha, Director General of the Department of Export Agriculture M.K.S.R.D. Samarasinghe, Chairman of the Paddy Marketing Board A.M.U. Pinnalanda, Director of the Hector Kobbekaduwa Agrarian Research and Training Institute Professor A.L. Sandika, along with senior officials from the ministry and provincial agricultural directors."
  ]
}