{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-01-22-en-cb13cf",
  "num": "en-cb13cf",
  "date_str": "2025-01-22",
  "description": "A country cannot progress through laws and regulations…",
  "url_metadata": "https://pmd.gov.lk/news/a-country-cannot-progress-through-laws-and-regulations-alone/",
  "lang": "en",
  "article_title": "A country cannot progress through laws and regulations alone",
  "article_body_paragraphs": [
    "– President",
    "President Anura Kumara Disanayake emphasized that a country cannot progress solely through laws and regulations and highlighted that tradition is a vital component of a nation.",
    "President Disanayake emphasized that Sri Lanka has accomplished a remarkable mission through the traditions built on Buddhism and that it is the responsibility of everyone to safeguard these Buddhist traditions and pass them down securely to future generations.\nThe President expressed these views during a discussion held today (22) at the Presidential Secretariat on the 74th Upasampada Vinaya Karma’ ceremony of the Sri Lanka Rāmañña Maha Nikāya.",
    "The President, recalling the historical significance of the Upasampada Vinaya Karma, a major ceremony in Buddhism, stated that the cessation of ordained monks (Upasampada Bhikkhus) would mean the dissolution of the Buddhist institution itself. He emphasized the importance of preserving these ancient traditions and carrying them forward with honour.",
    "The national Upasampada Vinaya Karma ceremony, organized biennially by the Sri Lanka Rāmañña Maha Nikāya, is scheduled to take place from June 30 to July 5, 2025, at the Punyawardhanarama Viharaya in Vijithapura, Palugaswewa, within the Udakukkhepa Sima Malakaya.\nThis grand ceremony, which will ordain over 250 novice monks (Samanera), will be conducted under state sponsorship.",
    "As the government considers the national Upasampada Vinaya Karma ceremony, which is held every two years, a dignified task, the President instructed officials to ensure that all necessary facilities are provided without any shortcomings.",
    "The discussion was attended by prominent figures, including the Most Venerable Makulewe Wimala Mahanayake Thero, the highest prelate of the Sri Lanka Rāmañña Maha Nikāya of the Sangha ancestry of Mahavihara; Most Venerable Professor Aththangane Rathanapala Nayaka Thero, Supreme Judicial Leader of Sri Lanka Rāmañña Maha Nikāya; the Anu Nayaka Theros, Most Venerable Waleboda Gunasiri Thero and Most Venerable Ankumbure Premavansa Thero; along with the Maha Sangha, Minister of Foreign Affairs, Foreign Employment, and Tourism Vijitha Herath; Minister of Buddha Sasana, Religious, and Cultural Affairs Dr. Hiniduma Sunil Senevi; Secretary to the President Dr. Nandika Sanath Kumanayake; Senior Additional Secretary to the President Roshan Gamage; former High Court Justice and Governor of the North Central Province Wasantha Kumara Wimalasiri; Chairman of the Rāmañña Nikayarakshaka Sabha and former Speaker Karu Jayasuriya; Secretary of the Rāmañña Nikayarakshaka Sabha and former Member of Parliament Lasantha Alagiyawanna, among others."
  ]
}