{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-10-09-8f9360",
  "num": "8f9360",
  "date_str": "2024-10-09",
  "description": "Korean Ambassador Meets President Dissanayake, Pledges to Strengthen…",
  "url_metadata": "https://pmd.gov.lk/news/korean-ambassador-meets-president-dissanayake-pledges-to-strengthen-bilateral-ties/",
  "lang": "en",
  "article_title": "Korean Ambassador Meets President Dissanayake, Pledges to Strengthen Bilateral Ties",
  "article_body_paragraphs": [
    "Her Excellency Miyon LEE, Ambassador of the Republic of Korea to Sri Lanka, paid a courtesy call on President Anura Kumara Dissanayake at the Presidential Secretariat this morning (09). During the meeting, Ambassador Lee congratulated President Dissanayake on his recent election victory and conveyed the best wishes of the Government of the Republic of Korea.",
    "Ambassador Lee reaffirmed South Korea’s commitment to strengthening bilateral relations with Sri Lanka, highlighting the long-standing ties between the two nations. Noting that South Korea ranks sixth in foreign remittances to Sri Lanka, the Ambassador pledged to increase remittances by creating more employment opportunities for Sri Lankans in South Korea.",
    "Additionally, efforts would be made to promote Sri Lanka as an attractive tourism destination among Korean travelers.",
    "The Ambassador also assured economic assistance to Sri Lanka, sharing that South Korea had faced similar economic challenges in the past and that Sri Lanka could benefit from Korea’s experience in overcoming them. Discussions centered around addressing rural poverty in Sri Lanka, with investments from the Korean Exim Bank being considered as a key driver of development.",
    "Further support was pledged in the areas of healthcare, anti-corruption measures, and climate change mitigation. Ambassador Lee also emphasized South Korea’s willingness to expand Korean language education in Sri Lanka to better equip Sri Lankans seeking employment in Korea."
  ]
}