{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-09-27-en-39586d",
  "num": "en-39586d",
  "date_str": "2024-09-27",
  "description": "Japan Expresses Full Commitment to Supporting the New…",
  "url_metadata": "https://pmd.gov.lk/news/japan-expresses-full-commitment-to-supporting-the-new-governments-anti-corruption-program/",
  "lang": "en",
  "article_title": "Japan Expresses Full Commitment to Supporting the New Government’s Anti-Corruption Program",
  "article_body_paragraphs": [
    "– Japanese Ambassador to Sri Lanka",
    "The Japanese Ambassador to Sri Lanka, MIZUKOSHI Hideaki, affirmed that the Japanese government is committed to fully supporting efforts to combat corruption and irregularities, a key priority of Hon. President Anura Kumara Dissanayake’s administration. He expressed readiness to continue close collaboration with Sri Lanka.",
    "Ambassador Mizukoshi made these remarks during a meeting with the Secretary to the President, Dr. Nandika Sanath Kumanayake, at the Presidential Secretariat yesterday (26).",
    "He further announced that work on 11 stalled projects funded by the Japanese government will resume promptly.",
    "Accordingly, these projects include the Kandy City Water Management Project, Phase II of the Bandaranaike International Airport (BIA) Development Project, the Terrestrial Television Broadcast Digitization Project, the National Transmission and Distribution Network Development Project, Phase II of the Anuradhapura North Water Supply Project, the Rural Infrastructure Development Project, the Kalu Ganga Water Supply Project, and improvements to health and medical services.",
    "The Japanese Ambassador, Mr. Mizukoshi, stated that the agreement encompasses the swift completion of the first phase of the Habarana-Veyangoda transmission line project and the Anuradhapura North water supply project, both of which are nearing completion with Japanese assistance. He also highlighted the payments related to the recently finished Kelani Ganga new bridge construction project.",
    "The meeting was attended by Deputy Head of the Embassy of Japan in Sri Lanka Nayoki Kamoshida, First Secretary of the Embassy of Japan Ohashi Kenji and Senior Additional Secretary to the President Roshan Gamage."
  ]
}