{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-24-482eae",
  "num": "482eae",
  "date_str": "2025-08-24",
  "description": "Subject Officers of the Sabaragamuwa Province were briefed…",
  "url_metadata": "https://pmd.gov.lk/news/subject-officers-of-the-sabaragamuwa-province-were-briefed-on-the-activities-of-the-presidents-fund/",
  "lang": "en",
  "article_title": "Subject Officers of the Sabaragamuwa Province were briefed on the activities of the President’s Fund",
  "article_body_paragraphs": [
    "A special one-day training workshop was held yesterday (23) at the Ratnapura District Secretariat for all subject officers from the divisional secretariats of Sabaragamuwa Province, aimed at strengthening the implementation of the President’s Fund initiatives at the regional level. The workshop was conducted under the patronage of Secretary to the President Dr. Nandika Sanath Kumanayake.",
    "With the expansion of the President’s Fund activities to all divisional secretariats, the number of applications received has significantly increased. Consequently, it has become essential to familiarize and train the relevant staff at the divisional secretariats on the newly introduced computer-based online system.",
    "Accordingly, yesterday’s session was conducted to brief and train the subject officers handling the President’s Fund in the Ratnapura and Kegalle districts of the Sabaragamuwa Province. This program aims to enhance the number of beneficiaries in the province, provide them with higher-quality services, introduce the newly updated online system and equip the staff with the knowledge and training necessary to deliver faster and more efficient services.",
    "The responsibilities and functions of the President’s Fund were explained to the attendees by the Senior Additional Secretary to the President and Secretary of the President’s Fund, Mr. Roshan Gamage, during the session.",
    "The senior officials of the President’s Fund provided detailed explanations on the security and usage of the computer system, as well as the complete process for medical allowance applications from submission and approval to the subsequent disbursement of payments.",
    "In addition, the challenges faced by the officers and potential solutions were discussed and certificates of participation were awarded to the subject officers in recognition of their involvement.",
    "The respective District Secretaries, Provincial Secretaries, subject officers from the Provincial Secretariat offices and the staff of the President’s Fund participated at this event."
  ]
}