{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-08-25-en-140d07",
  "num": "en-140d07",
  "date_str": "2025-08-25",
  "description": "Pre-Budget Discussions 2026 for Ministry of Urban Development,…",
  "url_metadata": "https://pmd.gov.lk/news/pre-budget-discussions-2026-for-ministry-of-urban-development-construction-and-housing-under-presidents-patronage/",
  "lang": "en",
  "article_title": "Pre-Budget Discussions 2026 for Ministry of Urban Development, Construction and Housing under President’s Patronage",
  "article_body_paragraphs": [
    "– President",
    "A review of the projects implemented under the 2025 budget allocations for the Ministry of Urban Development, Construction and Housing, along with a pre-budget discussions for 2026, was held today (25) at the Presidential Secretariat under the patronage of President Anura Kumara Dissanayake.",
    "The discussions focused on a wide range of sectors including urban and rural housing projects, urban development initiatives, city planning, solid waste management and environmental protection projects, as well as water supply and sanitation projects. The current progress of projects being implemented across all provinces of the country in these areas was also reviewed in detail.",
    "Special attention was drawn to the challenges faced in resuming projects that were halted due to the recent economic crisis as well as in sustaining on-going projects. President Dissanayake emphasized the importance of ensuring that projects initiated this year are steered towards achieving their specific targets within the same year. He further pointed out that while the government allocates sufficient provisions to the relevant Ministries, failure to utilize those funds effectively within the stipulated timeframe becomes a serious concern.",
    "The President also highlighted the need to give priority to the views and aspirations of local communities when undertaking housing and building construction as well as urban planning projects. He noted that due to ad-hoc construction projects carried out by previous administrations based solely on their preferences, many government buildings across the country remain underutilized or entirely unused today.",
    "It was revealed that 18 bridge projects launched in the Hambantota District under the Ministry of Urban Development and Housing have been abandoned mid-construction. As a result, temporary access roads created for these projects have now deteriorated into muddy and hazardous paths, causing severe inconvenience to local residents. In response, the President instructed officials to explore the feasibility of completing the unfinished work.",
    "Special attention was also given to the current status of housing projects implemented under Chinese and Indian loan assistance, with officials expressing optimism that the housing schemes related to resettlement in the Northern and Eastern Provinces could be completed within this year.",
    "Furthermore, the progress of several major development initiatives was reviewed, including the road development projects connected to the “Homagama Tech City” project, the construction of the Polonnaruwa Administrative Complex and the current status of the “City Branding Project”.",
    "The discussion also focused on issues arising in the handover of high-rise housing complexes already allocated to urban communities. President Dissanayake emphasized the importance of renovating and upgrading these housing units before transferring them to beneficiaries, as well as the need to establish a structured mechanism for their long-term maintenance once handed over.",
    "In addition, the President highlighted the importance of conducting surveys to assess both the demand and interest of residents in semi-urban areas before initiating new high-rise housing projects.",
    "Officials further briefed the President on the legal challenges associated with land acquisition payments and he directed them to prepare practical proposals to address and resolve these issues.",
    "The discussion also addressed the establishment of a government-mediated mechanism for citizens who are eligible but have not yet benefited from state housing projects. The President instructed officials to explore the possibility of developing a framework in coordination with banks, with government support, to facilitate the allocation of benefits to these citizens.",
    "Additionally, waste management and environmental protection projects were reviewed, including the current status of initiatives aimed at flood and disaster prevention across the country, such as the Veras River Project and the Rainwater Project Kolonnawa.",
    "Officials noted that these projects will continue to be implemented with the support of the “Clean Sri Lanka” programme. Discussions also covered pre-disaster preparedness planning, and the status of water supply and sanitation projects currently underway in areas including Jaffna, Greater Colombo, Kandy, Anuradhapura and Kalutara.",
    "Discussions were also held on the streamlining of water supply in rural regions through the utilization of water pipelines that were brought in under previous administrations to increase water supply capacity and have been abandoned in various areas. Additionally, the need to modernize institutions under the Ministry of Urban Development, Construction and Housing was emphasized, particularly the importance of establishing advisory services for government-assisted construction projects.",
    "The meeting was attended by Minister of Urban Development, Construction and Housing Anura Karunathilaka, Deputy Minister T.B. Sarath, Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Finance Dr. Harshana Suriyapperuma, Secretary to the Ministry of Urban Development, Construction and Housing Ranjith Ariyaratne, Senior Economic Advisors to President Duminda Hulangamuwa, Senior Additional Secretary to the President Russell Aponso, as well as officials from institutions under the Ministry of Urban Development, Construction and Housing and senior officers from the Ministry of Finance."
  ]
}