{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-23-2025-08-23-c9956f",
  "num": "2025-08-23-c9956f",
  "date_str": "2025-08-23",
  "description": "Outstanding A/L Students in Sabaragamuwa Province Recognized by…",
  "url_metadata": "https://pmd.gov.lk/news/outstanding-a-l-students-in-sabaragamuwa-province-recognized-by-the-presidents-fund/",
  "lang": "en",
  "article_title": "Outstanding A/L Students in Sabaragamuwa Province Recognized by the President’s Fund",
  "article_body_paragraphs": [
    "The Sabaragamuwa Provincial Program, implemented by the President’s Fund to recognize students who achieved outstanding results at the district level in the 2023/2024 GCE Advanced Level Examination, was held this morning (23) at the Ratnapura District Secretariat Auditorium under the patronage of Speaker Jagath Wickramaratne.",
    "A total of 360 students, 10 from each of the six subject streams from the Ratnapura and Kegalle districts, who achieved top results in six subject streams at the 2023 and 2024 G.C.E. Advanced Level Examinations, were each awarded a cash prize of Rs. 100,000 and a certificate of recognition. The President’s Fund allocated Rs. 36 million for this program.",
    "Addressing the students, Speaker Jagath Wickramaratne emphasized that the utilization of state resources for the future development of the people is a fundamental responsibility of the government and noted that the President’s Fund is currently fulfilling this responsibility effectively.",
    "He further highlighted that the country needs a future generation equipped with knowledge, skills and strong values and expressed that the current government’s new education policies aim to cultivate such a generation.",
    "Minister of Buddhasasana, Religious and Cultural Affairs, Dr. Hiniduma Sunil Senevi, also addressed the students, highlighting that the current government, after navigating a challenging journey of broad societal transformation, has introduced an ambitious program of educational reforms. He emphasized that the effective implementation of these reforms will provide the nation’s children with a bright and promising future.",
    "Sabaragamuwa Province Governor, Mrs. Champa Janaki Rajaratne and Secretary to the President Dr. Nandika Sanath Kumanayake, also addressed the ceremony.",
    "The event was attended by Senior Additional Secretary to the President and the Secretary of the President’s Fund Mr. Roshan Gamage, other senior officials of the President’s Fund, district secretaries, government officers, parents and the students."
  ]
}