{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-07-77cbf0",
  "num": "77cbf0",
  "date_str": "2025-04-07",
  "description": "Students of Rahula College, Matara Visit the President’s…",
  "url_metadata": "https://pmd.gov.lk/news/students-of-rahula-college-matara-visit-the-presidents-house/",
  "lang": "en",
  "article_title": "Students of Rahula College, Matara Visit the President’s House",
  "article_body_paragraphs": [
    "A group of students from Rahula College, Matara visited the Presidential Secretariat and the President’s House today (07).",
    "This programme is a collaborative initiative by the Presidential Secretariat, the Ministry of Education and the Parliamentary Department of Communication. Under this programme, schoolchildren are granted the opportunity to explore key state institutions such as the Presidential Secretariat, the President’s House, the Colombo Port City and Parliament, in alignment with their educational interests and areas of study.",
    "In line with President Anura Kumara Disanayake’s vision for the “Clean Sri Lanka” initiative, an awareness session was conducted for the students and teachers of Rahula College. The session covered the Clean Sri Lanka programme, the history of Parliament, the role of the Executive and the importance of the rule of law.",
    "Further complementing the “Clean Sri Lanka” initiative, a valuable tree sapling donation was made to Rahula College to mark their “Tree Planting Week”. This was carried out under the patronage of Prime Minister Dr. Harini Amarasuriya and Secretary to the President Dr. Nandika Sanath Kumanayake.",
    "The visiting students also had the opportunity to attend insightful lectures delivered by the Prime Minister and the Secretary to the President.",
    "During the interactive session, students posed several thoughtful questions to the Prime Minister, who responded with informative and encouraging answers.",
    "Among those present were Senior Additional Secretary to the President K.M.N. Kumarasinghe, Presidential Legal Advisor Attorney J.M. Wijebandara, Director (Tri-Forces Coordination) Air Commodore Asiri Gallage, Assistant Director Nadika Dangolla, Principal of Rahula College Ms. Samitha Kurukulasuriya, and teachers of the school."
  ]
}