{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-04-en-dabd8b",
  "num": "en-dabd8b",
  "date_str": "2025-05-04",
  "description": "President Pays Homage at Bai Dinh Pagoda",
  "url_metadata": "https://pmd.gov.lk/news/president-pays-homage-at-bai-dinh-pagoda/",
  "lang": "en",
  "article_title": "President Pays Homage at Bai Dinh Pagoda",
  "article_body_paragraphs": [
    "President Receives Warm Welcome from the People of Vietnam",
    "As part of the on-going state visit to Vietnam, President Anura Kumara Disanayake visited the Bai Dinh Pagoda, one of the largest Buddhist temple complexes in Southeast Asia this afternoon (04), where he paid homage and received blessings.",
    "The President received a warm and heartfelt welcome from the Vietnamese people, who had gathered near the entrance of the temple, waving the national flags of both Sri Lanka and Vietnam.",
    "A large crowd lined the pathway within the temple grounds to catch a glimpse of the Sri Lankan President, expressing their respect and goodwill by waving the two nations’ flags.",
    "Upon reaching the main Buddha shrine, President Disnayake paid his respects. The resident monks then chanted Seth Pirith and invoked blessings on the President.",
    "Subsequently, the President paid homage at the Sri Maha Bodhi sapling on the temple grounds, a sacred branch from the Sri Maha Bodhi in Anuradhapura, Sri Lanka, which was gifted to the Bai Dinh Pagoda and planted there in 2023.",
    "The outer wall constructed around the sacred Bodhi under the technical guidance of Sri Lanka’s Central Cultural Fund was also officially declared open by President Anura Kumara Dissanayake on this occasion.",
    "Later the President planted a sapling of the sacred Sal tree within the temple premises, and observed the commemorative plaque marking the occasion.",
    "As a gesture of reverence, President Disanayake presented a memento to the Chief Incumbent of the temple.",
    "Minister of Foreign Affairs, Foreign Employment, and Tourism, Vijitha Herath, along with other members of the Sri Lankan delegation, were also present for the occasion."
  ]
}