{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-03-22-en-09ac04",
  "num": "en-09ac04",
  "date_str": "2025-03-22",
  "description": "President Expresses Confidence on the Country’s Prosperous Future",
  "url_metadata": "https://pmd.gov.lk/news/president-expresses-confidence-on-the-countrys-prosperous-future/",
  "lang": "en",
  "article_title": "President Expresses Confidence on the Country’s Prosperous Future",
  "article_body_paragraphs": [
    "– President tells Parliament",
    "President Anura Kumara Disanayake stated that the National People’s Power (NPP) government has stabilized the economy over the past four months that has instilled confidence in the country’s ability to move toward a prosperous future.",
    "He further noted that the government has achieved numerous economic victories, increased state revenue, and resumed several stalled development projects initiated with foreign assistance, thereby signaling economic stability to the nation.",
    "President Disanayake made these remarks yesterday (21) during the parliamentary debate on the third reading of the budget.",
    "He asserted that those who attempt to disrupt this national progress for political gain will ultimately be rendered irrelevant in politics. He emphasized that the only path available to all politicians in the country today is to align with and support the government’s development agenda.",
    "Additionally, the President stated that the era of media-driven politics has come to an end, arguing that if such an approach were still effective, the current government would not have come to power. He described the present administration as a political movement that remains engaged in continuous dialogue with the people.",
    "Reflecting on past opportunities to rebuild the nation that was squandered, President Disanayake stressed that neither he nor his government would let the current opportunity slip away. He reiterated that their mission will only conclude once the country has been fully rescued from its current challenges.",
    "President Anura Kumara Disanayake stated that neither he nor any minister in the government harbours personal ambitions; instead, their only aspiration is the well-being of the country and its people. He firmly assured that this vision will be realized and invited all members of the opposition to be active participants in the nation’s journey toward success, rather than being remembered in history as obstacles to progress.",
    "Further elaborating on his views, the President remarked:",
    "“This is one of the longest budget debates held in Parliament in recent times. Previously, adequate time was not allocated for such discussions, but we ensured a full-length debate. During this discussion, various points were raised; some out of pain, others out of anger. Some of these concerns were valid. We are not surprised by expressions of pain or anger. When lands in Hanthana are lost, pain is inevitable. It is saddening. The documents related to this matter are available at the Presidential Secretariat. We understand the frustration and outrage. However, we must also be prepared to embrace what is beneficial and reject what is not.",
    "We are a political movement that firmly believes the country’s economic system must undergo a decisive transformation and we are actively working toward that goal. Moreover, we clearly understand how to implement this transformation. If the economy were in a strong and crisis-free state, this shift could happen swiftly. However, given the dire economic situation, the transformation must be carefully planned and executed over time.",
    "Therefore, we fully understand the concerns being raised. For a long time, this country has followed economic policies that have failed to serve its people. Now, we are taking decisive steps to establish an economy that benefits both the country and its citizens. To achieve this transformation, our first priority is to stabilize the economy. An economy burdened by multiple crises cannot withstand sudden, large-scale changes. A vehicle with broken wheels cannot make sharp turns; first, the wheels must be fixed. That is why we are systematically working to steer the economy forward with careful planning.",
    "We inherited a state that was officially declared bankrupt, not just officially, but in reality as well. There was a massive gap between the country’s revenue and expenditure. While the expected total revenue was LKR 4,999 billion, debt interest payments alone required LKR 2,950 billion. Additionally, LKR 1,352 billion was needed for public sector salaries and LKR 442 billion for pension payments. This meant that from the total revenue of LKR 4,990 billion, LKR 4,744 billion was immediately spent on interest, salaries and pensions, leaving only LKR 246 billion. An economy in such a dire state cannot be turned around overnight.",
    "Furthermore, the country is burdened with a significant amount of debt and a collection of state institutions that incur massive annual losses. Last year, the Sri Lanka Rupavahini Corporation recorded a loss of LKR 256 million, with outstanding debt amounting to LKR 1,834 million. The Sri Lanka Broadcasting Corporation reported a loss of LKR 152 million, while its debt stood at LKR 1,603 million. The Independent Television Network (ITN) had a debt of LKR 1,476 million. Lanka Sugar Company carried a debt of LKR 11,165 million, the State Plantation Corporation owed LKR 3,216 million, Milco (Pvt) Ltd had a debt of LKR 15,090 million and SriLankan Airlines was burdened with nearly LKR 340 billion in debt.",
    "With such conditions, the revenue generated by the state was barely sufficient to cover the fundamental expenditures I previously outlined. The country we inherited was one with highly concentrated and insufficient revenue. Additionally, the segment of society contributing to the national economy was extremely small. For instance, 90% of Sri Lanka’s export income is generated by just 10% of exporters. Similarly, approximately 69% of the revenue collected by the Department of Inland Revenue comes from around 600 tax files.",
    "Moreover, we had become a bankrupt state in the eyes of the world; a country unable to secure loans and one where trust in the banking system had collapsed. Therefore, our first and foremost responsibility was to stabilize the economy. Without economic stability, we were not prepared to undertake any major transformations. History has shown that every economic shift attempted without first achieving stability has resulted in negative consequences.",
    "When we took over the government, Sri Lanka was already engaged in a four-year Extended Fund Facility (EFF) program with the International Monetary Fund (IMF). We were faced with two choices: either to continue with this program or to abandon it. While many expected us to walk away from the IMF agreement, we did not fall into that trap. We knew that given the fragile state of the economy, even a small misstep on our part could lead to severe economic repercussions. As a government, our primary responsibility in restoring a collapsed economy was to ensure that we did not make even minor mistakes.",
    "Accordingly, our first priority was to establish economic stability in the country. Today, no one can claim that Sri Lanka lacks economic stability. I must emphasize that we worked tirelessly to achieve this stability. As a key milestone in this effort, on December 21 of last year, our country was officially declared free from bankruptcy. Until that point, we were a state that had defaulted on its debt. However, we have now transitioned to a country that, while not currently repaying its debt, has reached an agreement on its repayment. We have secured an extension until 2028 to begin settling our outstanding debts.",
    "As a bankrupt nation, our country suffered immense damage. Consequently, many development projects that were dependent on foreign aid came to a halt. However, after Sri Lanka was freed from bankruptcy, the respective countries have decided to resume these projects. This is a clear indication of the country’s growing stability.",
    "Additionally, with the visit of Indian Prime Minister Narendra Modi to Sri Lanka on April 5, work on the Sampur power plant is set to commence. Similarly, within the next two months, a new solar power plant in Siyambalanduwa and a 50-megawatt wind power plant in Mannar will begin operations.",
    "We have successfully steered the country from economic instability to stability. We have restored confidence among businesses, investors and international financial institutions regarding Sri Lanka’s financial standing. Today, the exchange rate has remained stable at approximately LKR 300 per USD for the past three years; an achievement that had not been seen in recent history.",
    "Furthermore, Sri Lanka has transitioned from being a high-risk debtor nation to one with reduced debt risk. Trust in the banking system has been reinstated and interest rates have been brought down to single digits. By mid-year, we anticipate achieving positive inflation growth. In the past two months, the highest recorded remittance inflow from migrant workers in recent history was received, signifying growing confidence in the country’s economic stability.",
    "Additionally, Sri Lanka has seen a significant influx of tourists. As of March 17, over 610,000 tourists had arrived in the country. We can confidently predict that this year will see the highest number of tourist arrivals in Sri Lanka’s history.",
    "In Parliament, we have often observed discrepancies between estimated and actual revenue figures. However, in 2024, the Department of Customs met the estimated revenue target. We initially projected an income of LKR 356 billion from the Inland Revenue Department, but by March 17, the actual revenue had reached LKR 438 billion. Similarly, in January, the Customs Department’s revenue surpassed its estimated target.",
    "Furthermore, we are striving to generate revenue that exceeds our projected income for this year. Achieving economic stability is crucial for the country, as substantial transformations in the economy cannot be realized without first securing such stability. In the past, private entrepreneurs lacked confidence in the nation’s economic landscape. Progress cannot be made without fostering trust among key economic stakeholders. The economy cannot be managed based on mere intuition; rather, we rely on data, analytical assessments, and conclusions drawn from those analyses to steer the country’s economic direction.",
    "The decision to permit motor vehicle imports is a highly sensitive one, and we are continuously reviewing it to ensure we achieve our intended objectives.",
    "You are free to engage in political discourse as much as you wish, but we earnestly request that false information, which could destabilize the economy, not be disseminated. Individuals identified as economic experts must ensure their statements are responsible, as reckless claims can create significant instability in the financial markets. Stabilizing the economy is not solely the government’s responsibility; it is a collective duty that we must all fulfill as citizens and public representatives.",
    "We may engage in political debates, but I must once again appeal that false and damaging economic information not be spread. In a well-functioning economy, such statements may not have severe consequences. However, at a time when we are carefully navigating an economic recovery, it is critical not to create unnecessary doubt. If you have concerns, let us discuss them. Do not irresponsibly propagate unverified claims. This is a moment when we must all act responsibly to stabilize the economy.",
    "At the same time, we cannot allow the lives of our citizens to stagnate until economic stability is fully achieved. We are systematically implementing measures to boost local production while also providing necessary relief to safeguard the livelihoods of the general public. Accordingly, we have increased the fertilizer subsidy from Rs. 15,000 to Rs. 25,000 and, in a recent Cabinet decision, allocated an additional Rs. 15,000 for excess crops cultivated in paddy fields. Furthermore, we have enhanced compensation for harvest losses. We will never abandon our duty to support the people.",
    "We have allocated a Rs. 6,000 allowance for 1.6 million schoolchildren to purchase books and supplies. These programs are being implemented despite the economic challenges we face. Additionally, we have increased the allowance for kidney patients from Rs. 7,500 to Rs. 10,000 and raised the elderly allowance from Rs. 3,000 to Rs. 5,000. Moreover, we have increased the pensions of retirees by Rs. 3,000. We remain committed to the welfare of our citizens.",
    "We have taken steps to increase the Mahapola scholarship from Rs. 5,000 to Rs. 7,500 and the student allowance from Rs. 4,000 to Rs. 6,500. Additionally, we have decided to provide an allowance of Rs. 5,000 for orphaned children and deposit Rs. 3,000 into their fixed savings accounts. Furthermore, when an orphan, particularly a young girl, residing in a state institution reaches the age of marriage, we have allocated Rs. 1 million for the construction of a house. We take full responsibility for the welfare of these children. We have also increased the daily meal allowance for preschool children from Rs. 60 to Rs. 100.",
    "Regarding salary increases for public sector employees, we focused on two key issues. There was a prevailing trend of skilled government officials leaving the country, and simultaneously, we struggled to attract individuals with specialized expertise and competence to the public sector. Despite financial challenges, we recognized the necessity of implementing a meaningful salary increase for public sector employees.",
    "This was an unanticipated increase in basic salaries. We implemented this increase based on a scientific approach, alongside enhancements to other allowances. We also made adjustments to previously unaddressed salary scales to ensure tangible improvements. However, if future adjustments to this framework are deemed necessary while safeguarding core principles and integrity, we are prepared to take action. Our ultimate goal is to establish an efficient and well-functioning public sector.",
    "What, then, is the opposition doing today? Even if I were to assume the presidency today, I would still be entitled to a parliamentary pension—a fact I was previously unaware of. However, upon learning of it, I immediately submitted a request to Parliament to forgo this pension. A Member of Parliament who becomes President receives both the parliamentary pension and the presidential salary. In the past, such benefits were distributed at will. Similarly, when an MP is appointed as a Minister, they receive both a ministerial salary and a parliamentary salary. However, we have decided that our ministers and deputy ministers will only receive the MP salary.",
    "If we are to transform this country, the political system must change. Accordingly, we are expediting the introduction of a bill to abolish parliamentary pensions. We are also swiftly amending the Presidents Entitlements Act and presenting it to Parliament. In the near future, we will introduce several key bills that all members of Parliament should unite to support. Furthermore, MPs will no longer receive duty-free vehicle permits, and we uphold the policy that a Member of Parliament should receive an official vehicle only during their tenure.",
    "We have also reduced the number of Cabinet Ministers to 21, with Deputy Ministers appointed accordingly. Ministers are no longer provided with official residences. Establishing political stability in the country is essential, and when ministers and politicians lead by example through sacrifices, public servants must also be prepared to follow suit. Instead of engaging in superficial debates over dignity and pride, we must focus on substantive progress.",
    "We have paid special attention to the issue of unemployed graduates and are ensuring that job placements follow a proper policy framework. We have identified 15,300 vacancies in the public sector, and the relevant committee has approved the filling of these positions. As a result, we plan to recruit 30,000 individuals into government positions, ensuring that the process is carried out transparently and systematically. However, we must avoid unnecessary over-recruitment, and I urge all members of Parliament to exercise restraint in this regard. We recognize the importance of public service, but the financial burden of maintaining the public sector is extremely high. Therefore, we are proceeding with a carefully planned approach.",
    "If our government were merely to continue the existing system, governance would be far easier. However, the people elected us to bring about meaningful reforms for the nation’s progress.",
    "In this endeavor, the business community plays a critical role. Everyone must pay taxes fairly, and we are committed to enforcing the law against tax evasion. At the same time, we assure that every rupee collected in taxes will be safeguarded and utilized responsibly. We also plan to introduce special incentives for taxpayers.",
    "We must rebuild public trust in the nation’s tax system. We are fostering a new political culture to achieve this. When people are confident that their tax contributions are managed transparently and efficiently, they will willingly comply. In the past, taxpayers hesitated because they saw their contributions being misused. We are committed to changing this perception and restoring trust in the system.",
    "Moreover, professionals must contribute to national development. The government must ensure that essential services are provided without imposing additional costs on the people. Corruption weakens the public sector and hinders economic growth. Corruption is an economic crime, and we will take strict measures to address it. The state must be reformed. We must eliminate the deeply rooted culture of corruption within the government apparatus.",
    "We are also committed to creating a more investment-friendly environment within the country, introducing an Investment Protection Act. Additionally, we are in the process of amending the Strategic Development Projects Act to ensure that tax concessions are granted based on national requirements rather than personal affiliations. This legislation will be presented to Parliament promptly.",
    "Furthermore, we anticipate significant reforms in the education sector and have initiated a project to streamline the school system. By expanding vocational training and educational pathways, we aim to transform the education system in a way that secures a brighter future for the country’s children.",
    "We are implementing necessary relief measures to support small and medium-scale entrepreneurs while also planning a substantial transformation in the agricultural sector. A major initiative is underway to develop a port-centric maritime economy, and with the assistance of the Asian Development Bank, we are expediting the construction of the Kerawalapitiya Container Terminal.",
    "Through these measures, we strive to stabilize the national economy and guide the country towards its future goals. It is essential that we all come together and strengthen this journey as we move forward."
  ]
}