{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-11-22-en-323c2e",
  "num": "en-323c2e",
  "date_str": "2024-11-22",
  "description": "Let Us Work Together with One Goal to…",
  "url_metadata": "https://pmd.gov.lk/news/let-us-work-together-with-one-goal-to-build-a-better-nation/",
  "lang": "en",
  "article_title": "Let Us Work Together with One Goal to Build a Better Nation",
  "article_body_paragraphs": [
    "• We cannot move forward without restoring the public’s trust in public service.",
    "• The nearly 80% mandate in the recent elections reflects the public’s desire for change.",
    "• Regardless of the laws and regulations, the power of the people is equally impactful.",
    "• The government’s sole purpose is to deliver political leadership that aligns with the people’s expectations.",
    "– The President states this while assuming duties as the Minister of Defence",
    "President Anura Kumara Dissanayake called upon all public officials to unite with a common purpose and work together to transform the motherland into a better nation.",
    "He made this statement today (22) during his visit to the Ministry of Defence at the Defence Headquarters premises in Akuregoda, where he assumed duties as the new Defence Minister.",
    "Upon his arrival, the President was warmly welcomed by the staff of the Ministry of Defence.",
    "Following the reception, the President held a meeting with the commanders of the tri-forces and senior officials of the Ministry of Defence, where they discussed ongoing and future initiatives of the Ministry.",
    "President Dissanayake stated that the new government is dedicated to promoting good governance and seeks the support of everyone for the nation’s development program.",
    "The President highlighted that the power of the people remains just as strong, irrespective of the Constitution and laws. He pointed out that the composition and outcome of the mandate given in the most recent presidential and general elections reflect the people’s expectations. The President also noted that the government received nearly 80% of the public’s support in the election, marking a significant shift that aligns with the people’s desires.",
    "President Anura Kumara Dissanayake affirmed that his government, as a political authority, has no other objective than to provide the political leadership necessary to meet the expectations of the people. He also emphasized that the support of public officials is crucial to making these goals a reality.",
    "The President stressed that in this new transformation that the public is anticipating, progress cannot be made without strengthening public trust in the public service. He noted that it is the public service that has been the driving force behind the economic and social growth of every developed nation.",
    "Deputy Minister of Defence Major General (Retd) Aruna Jayasekara, Secretary to the Ministry of Defence Air Vice Marshal (Retd) Sampath Thuyacontha, Chief of Defence Staff General Shavendra Silva, Commander of the Army Lieutenant General H L V M Liyanage, Commander of the Air Force Air Marshal Udeni Rajapaksa, Commander of the Navy Vice Admiral Priyantha Perera, members of the security forces, and staff from the Ministry of Defence also attended the event."
  ]
}