{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-02-25-1d7378",
  "num": "1d7378",
  "date_str": "2025-02-25",
  "description": "Maximize Efficiency: Use Allocated Provisions Effectively Within Limited…",
  "url_metadata": "https://pmd.gov.lk/news/maximize-efficiency-use-allocated-provisions-effectively-within-limited-financial-framework/",
  "lang": "en",
  "article_title": "Maximize Efficiency: Use Allocated Provisions Effectively Within Limited Financial Framework",
  "article_body_paragraphs": [
    "– President Instructs the Ministry Secretaries",
    "• Key Steps to Relocate All Government Offices to State-Owned Buildings",
    "Despite the constraints of a limited financial framework, President Anura Kumara Disanayake emphasized that it is the duty of government officials to allocate and utilize the funds efficiently and equitably, in accordance with the development priorities and the needs of the people as outlined in the recent budget.",
    "This matter was underscored during a meeting held today (25) at the Presidential Secretariat, where the President engaged in discussions with the Secretaries of Ministries.",
    "The President further highlighted the importance of government officials maintaining a high level of accountability in the management of expenses.",
    "Additionally, the President acknowledged the prevailing negative public perception of the Public Service, attributing it to inefficiencies within the public sector. He noted that dissatisfaction among government employees regarding their employment conditions has contributed to these inefficiencies. He stressed the urgency of addressing these concerns to enhance the overall efficiency of the public service.",
    "The President stated that, as a result of the reduction in expenses by the President and the Cabinet, it is also the responsibility of the public service to reduce administrative costs in state institutions and minimize wastage.",
    "In order to reduce costs within the public service, extensive discussions were held regarding a series of measures. These include the relocation of all government offices to state-owned buildings, the planned auction of high-maintenance ministerial vehicles by March, the removal of unused office equipment, the identification of institutions for closure, merger, or transition to public-private partnerships, and the prompt implementation of these strategies.",
    "The meeting was attended by the Secretary to the President, Dr. Nandika Sanath Kumanayake, the Secretary to the Prime Minister, G.P. Saputhanthri, and the Secretaries of the Ministries.",
    ""
  ]
}