{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-11-27-2bed67",
  "num": "2bed67",
  "date_str": "2024-11-27",
  "description": "Provide immediate relief to affected people in disaster-stricken…",
  "url_metadata": "https://pmd.gov.lk/news/provide-immediate-relief-to-affected-people-in-disaster-stricken-areas-without-relying-solely-on-technological-data/",
  "lang": "en",
  "article_title": "Provide immediate relief to affected people in disaster-stricken areas without relying solely on technological data",
  "article_body_paragraphs": [
    "– Instructions from the President to all officials involved in disaster management",
    "President Anura Kumara Dissanayake directed officials to provide immediate relief services to affected people in disaster-stricken areas by gathering information on-site rather than relying solely on technological data. The President emphasized the need to establish a strong grassroots-level mechanism to facilitate this process.\nThese remarks were made during a discussion held today (27) at the Presidential Secretariat with state officials, aimed at expediting relief services for disaster-affected populations.",
    "The President instructed officials to ensure that affected individuals are sheltered in secure locations and provided with essential food, water, and sanitary facilities. He also directed authorities to allocate sufficient funds for relief efforts.\nDuring the meeting, particular attention was given to the high-risk Northern and Eastern Provinces, which are severely impacted by adverse weather conditions.\nPresident Dissanayake further advised education officials to take appropriate measures to address the mental well-being and difficulties faced by students sitting for the Advanced Level examination.",
    "Attention was drawn to identifying fishermen currently at sea and providing the necessary facilities to ensure their safe return to shore.\nPresident Anura Kumara Dissanayake further instructed officials to deliver high-quality services to affected individuals while also conducting follow-up investigations to gather information regarding the affected populations.",
    "The discussion was attended by Prime Minister Dr. Harini Amarasuriya, Minister of Public Security and Parliamentary Affairs Mr. Ananda Wijepala, Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Defence Air Vice Marshal Sampath Thuyacontha, Secretary to the Ministry of Public Security Mr. Ravi Seneviratne, Chief of Defence Staff General Shavendra Silva, Air Force Commander Air Marshal Udeni Rajapaksa, and Director General of the Meteorology Department Mr. A. K. Karunanayake, among other officials."
  ]
}