{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-18-en-ecaf9b",
  "num": "en-ecaf9b",
  "date_str": "2025-06-18",
  "description": "Numerous New Projects Planned Under “Clean Sri Lanka”…",
  "url_metadata": "https://pmd.gov.lk/news/numerous-new-projects-planned-under-clean-sri-lanka-initiative/",
  "lang": "en",
  "article_title": "Numerous New Projects Planned Under “Clean Sri Lanka” Initiative",
  "article_body_paragraphs": [
    "A range of new projects for the 2025 financial year have been launched under the “Clean Sri Lanka” programme, a flagship government initiative aimed at fostering “A Thriving Nation , A Beautiful Life”",
    "A progress review meeting for these projects, which are being implemented by various ministries and their respective departments, corporations, boards and institutions, was held yesterday (17) at the Presidential Secretariat, chaired by Dr. Nandika Sanath Kumanayake, Secretary to the President.",
    "One notable project discussed is a plan to operate 10 purpose-built buses for people with special needs from Panadura, Kadawatha and Avissawella to the National Hospital in Colombo. This initiative, a collaboration with the Sri Lanka Transport Board, marks the first time such a service will be implemented in the country.",
    "Additionally, there are plans to create a virtual city centred around Kandy, expected to be completed within a year. This pilot project will also encompass the Temple of the Sacred Tooth Relic premises and is estimated to cost Rs. 50 million.",
    "To attract both local and international tourists, a three-day cultural festival showcasing the cultural values of all ethnic groups in Sri Lanka is being planned for Colombo. This event is scheduled to take place at 16 locations, including Galle Face Green.",
    "Furthermore, there are plans to construct 500 standardised and modern public toilets in tourist areas, with an allocated budget of Rs. 525 million.",
    "A sustainable programme is also underway to secure international Blue Flag certification for two of the country’s main coastal zones within two years. Unawatuna and Hirikatuwa beaches have been proposed for this and over 450 beach custodians are to be appointed under this project, with 250 already receiving their letters of appointment.",
    "A nationwide wastewater disposal project is being implemented at a cost of Rs. 300 million, aiming to maintain the cleanliness and upkeep of urban canals and waterways. Separately, a Rs. 100 million programme has commenced for the sustainable maintenance of the general canal system in Colombo.",
    "A pilot project to minimise water pollution in the Mahaweli River is also being conducted in its upper reaches.",
    "Moreover, a project to provide compost dump bins to local government authorities, costing Rs. 500 million, is also underway. In the first phase, Rs. 150 million worth of bins will be distributed, also within this year.",
    "A road safety programme, costing Rs. 120 million, is already in motion, with the objective of reducing the daily number of road accidents. Attention is also being given to establishing several model villages across the island to prevent anti-social behaviour, including drug abuse.",
    "The meeting also included extensive discussions on the successful completion of these projects to ensure the “Clean Sri Lanka” programme’s objectives are achieved at both ministerial and institutional levels.",
    "Mr. G.M.R.D. Aponsu, Senior Additional Secretary to the President at the Clean Sri Lanka Secretariat and Mr. S.P.C. Sugeeshwara, Senior Additional Secretary to the President, along with secretaries and other senior officials representing various ministries, were present at the event."
  ]
}