{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-04-en-adeb54",
  "num": "en-adeb54",
  "date_str": "2025-05-04",
  "description": "President Receives Warm Ceremonial Welcome at Noi Bai…",
  "url_metadata": "https://pmd.gov.lk/news/president-receives-warm-ceremonial-welcome-at-noi-bai-international-airport-in-vietnam/",
  "lang": "en",
  "article_title": "President Receives Warm Ceremonial Welcome at Noi Bai International Airport in Vietnam",
  "article_body_paragraphs": [
    "At the invitation of His Excellency Luong Cuong, President of the Socialist Republic of Vietnam, President Anura Kumara Disanayake departed Sri Lanka yesterday (03) on a state visit to Vietnam. He arrived at Noi Bai International Airport in Hanoi this morning (04).",
    "Upon his arrival, President Disanayake and his delegation were accorded a warm and respectful welcome by senior Vietnamese officials, including Member of the Central Committee of the Communist Party of Vietnam and Deputy Minister of Foreign Affairs Mr. Nguyen Manh Cuong. The welcome ceremony was also attended by Vietnamese Ambassador to Sri Lanka, Trinh Thi Tam, Sri Lankan Ambassador to Vietnam Poshitha Perera and several officials from the Embassy of Sri Lanka in Hanoi.",
    "Later today, President Disanayake is scheduled to meet with General Secretary of the Communist Party of Vietnam (CPV), H.E. Tô Lâm, at the Party’s Central Committee Headquarters in Hanoi. During the visit, the President is also expected to hold official talks with both the President and Prime Minister of Vietnam.",
    "On May 6, President Disanayake will attend the opening ceremony of the United Nations Day of Vesak in Ho Chi Minh City, where he will deliver the keynote address as the event’s Chief Guest.",
    "The visit is also expected to include the signing of several bilateral agreements and engagements with the Vietnamese business community to enhance economic cooperation between the two countries.",
    "Minister of Foreign Affairs, Foreign Employment and Tourism Vijitha Herath, along with a high-level delegation of senior government officials, is accompanying the President on this state visit."
  ]
}