{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-05-en-a29123",
  "num": "en-a29123",
  "date_str": "2025-04-05",
  "description": "Statement by the President to the Media during…",
  "url_metadata": "https://pmd.gov.lk/news/statement-by-the-president-to-the-media-during-the-joint-press-conference-on-the-occasion-of-the-state-visit-of-the-indian-prime-minister-to-sri-lanka-05-april-2025/",
  "lang": "en",
  "article_title": "Statement by the President to the Media during the Joint Press Conference on the Occasion of the State Visit of the Indian Prime Minister to Sri Lanka,  05 April 2025",
  "article_body_paragraphs": [
    "His Excellency Prime Minister Shri Narendra Modi,\nHer Excellency Prime Minister Dr. Harini Amarasooriya,\nHonourable Ministers, Distinguished Representatives,\nLadies and Gentlemen, Friends from the Media,",
    "Ayubowan, Vanakkam, Namaste, and Good Morning!",
    "I warmly welcome His Excellency the Prime Minister of India, Shri Narendra Modi, and the distinguished delegation, as the first Head of State to visit Sri Lanka since the formation of our government. I consider it as a historic occasion to recognize the achievements of Prime Minister Shri Narendra Modi, who assumed office with a strong public mandate to transform the political culture and overcome long-standing prejudices that had hindered his country’s progress toward becoming a modern, developed nation.",
    "This visit reflects the deep-rooted closeness and friendship that have existed between Sri Lanka and India for ages. It is worth noting that the bond between our two countries separated by a narrow stretch of ocean less than 50 kilometers wide, is even closer than this physical proximity suggests.",
    "India, a land of rich diversity, has made significant contributions to the world’s cultural and spiritual heritage throughout history, and it continues to play a prominent role on the global stage today.\nWe have witnessed India’s remarkable rise and success. We sincerely applaud the way India has positioned itself not only as a regional power but also as a global leader. It is important to emphasize that our admiration is genuine and heartfelt. Like India, Sri Lanka firmly believes in the potential of South Asia to rise and shine on the world stage, a goal that we must strive to achieve together.",
    "Sri Lanka and India share far more than geographical proximity. We are neighbours bound by deep historical, religious, and cultural ties that span over two thousand five hundred years. Our enduring relationship that has withstood the test of time is founded on shared values, mutual respect, and common aspirations. As civilizational partners, Sri Lanka and India have grown close across every sphere, including history, language, religion, ethics, art, culture, architecture, and beyond, reflecting the richness and dynamism of our two nations.\nOne of the closest and most enduring examples of friendship that we fondly recall is India’s gesture during the 1996 Cricket World Cup, when India joined Sri Lanka in an exhibition match after two teams declined to tour our country due to security concerns. We take this opportunity to once again express our heartfelt gratitude for that act of solidarity.",
    "Sri Lanka’s foreign policy is firmly guided by national interests, with a focus on promoting peace and respecting the sovereignty of all nations, principles that form the foundation of our diplomatic roadmap. Just prior to this event, Prime Minister Modi and our delegation held bilateral discussions.",
    "We conducted a broad review of the current state of our bilateral cooperation and exchanged views on ways to further strengthen our relations in areas of mutual interest.",
    "Recalling my successful visit to New Delhi, I conveyed to Prime Minister Modi Sri Lanka’s firm commitment to implementing the actions outlined in the India-Sri Lanka Joint Declaration titled “Fostering Partnerships for a Shared Future,” which was adopted during that visit.\nI expressed my gratitude to Prime Minister Modi and the Government of India for their steadfast support in the recovery, growth, and stability of our country’s economy.",
    "Prime Minister Modi’s leadership and transformative initiatives, which have elevated India to the global stage, along with his personal friendship with Sri Lanka, have brought immense benefits to us in the areas of economic reforms, infrastructure development, and social empowerment.",
    "I am deeply grateful to Prime Minister Modi for his unwavering commitment and support to our country’s economic recovery process and sustainable development, in alignment with India’s foreign policy framework of “Neighborhood First.”",
    "I briefed Prime Minister Modi on the success of our debt restructuring programme and provided an update on our current economic situation, which is progressing towards stability. I am deeply grateful for the support of the Government of India throughout the debt restructuring process\nWe had detailed discussions on the further development of the already exsisting defence cooperation between our two countries. I reaffirmed our commitment that Sri Lankan territory will not be used for any purpose that could undermine India’s security or regional stability.",
    "I requested Prime Minister Modi’s intervention to urgently initiate bilateral technical discussions regarding Sri Lanka’s claim to the United Nations Commission on the Limits of the Continental Shelf, with the aim of establishing the outer limits of the continental shelf beyond the mutual exclusive economic zone.",
    "Sri Lanka recognizes the importance of developing a digital economy to drive growth, innovation, and efficiency. We discussed the potential for digitalization cooperation across several key areas. I am deeply grateful to the Government of India for their financial contribution of INR 300 million towards the implementation of the Sri Lanka Digital Identity (SLUDI) project.",
    "We also acknowledged that the partnership between our two countries plays a crucial role in strengthening both our economic and people-to-people ties. I extended my thanks to Prime Minister Modi for converting the US$ 14.9 million line of credit provided for the construction of the Maho-Omanthai railway line into a grant for the installation of the signalling system on the Maho-Anuradhapura railway line.",
    "Prime Minister Modi and I are pleased to announce that we will inaugurate these two projects in Anuradhapura tomorrow. We discussed in detail our government’s priority to ensure reliable, affordable, and timely access to energy resources to meet the needs of the people. We also explored further cooperation in this area to achieve energy security and meet the growing demands of our population.",
    "Additionally, we exchanged views on development cooperation, particularly in agriculture. Prime Minister Modi and I also addressed trade and investment cooperation between our two countries. We sought the support of the Government of India and Prime Minister Modi to encourage increased Indian investments in Sri Lanka, particularly in key areas of mutual interest.",
    "Our discussions also covered cooperation in the tourism sector. India has consistently been the largest source of tourists visiting Sri Lanka, and we agreed to enhance cooperation to fully realize the potential of this sector.",
    "Lastly, we requested Prime Minister Modi’s intervention to expedite the conclusion of the social security agreement between our two countries, which will benefit our expatriate workers.\nWe discussed the need for a cooperative approach to providing a sustainable solution to the fisheries issue. Recognizing the serious environmental damage caused by bottom trawling, a prohibited practice in both our countries, we called for decisive measures to halt this activity and to address illegal, unreported, and unregulated fishing.",
    "Today, we are pleased to participate in the exchange of several important bilateral agreements between Sri Lanka and India, covering areas such as energy, security cooperation, health sector collaboration, infrastructure projects, and debt restructuring.",
    "This marks another significant step forward in our relationship. I am particularly pleased to join the virtual ceremony with Prime Minister Modi to lay the foundation stone for the Sampur Solar Power Plant, which will contribute 120 MW to our national grid. Additionally, we are launching the project to provide solar power systems to 5,000 religious sites across Sri Lanka, and inaugurating the Dambulla Temperature and Humidity Controlled Agro Cold Storage complex, the only temperature-controlled agricultural warehouse in Sri Lanka. We are deeply grateful to the Government of India for its generous cooperation and support in realizing these people-centric projects.",
    "I am also pleased to announce that Prime Minister Modi and his delegation will visit Anuradhapura tomorrow, which stands as a symbol of the great civilization that emerged in our country following the arrival of Buddhism, the greatest gift we have received from India. Prime Minister Modi will also pay homage to the sacred Jaya Sri Maha Bodhi in Anuradhapura.",
    "During the recent economic crisis, Prime Minister Modi announced that India would continue to support Sri Lanka in strengthening its democracy, stability, and economic recovery. It must be emphasized that India’s support, as a partner and friend, played a crucial role in Sri Lanka’s resilience. The people of both our nations must be given the opportunity to embrace a common path forward, through partnership in development, innovation, security, stability, peace in the Indian Ocean region, and the prosperity of our people.",
    "India and Sri Lanka are not merely two countries on a map. It is essential to recognize that they are two nations deeply connected by history, strongly united by trade, and bound by friendship. I would also like to commend Prime Minister Modi’s concept of “Sabka Saath, Sabka Vikas” (Together with all, development for all), which is a timely and pragmatic vision.",
    "I am pleased to announce that the Government of Sri Lanka has decided to confer upon Prime Minister Shri Narendra Modi the highest Sri Lankan honor, the ‘Sri Lanka Mitra Vibhushana,’ as a symbol of the enduring friendship and unwavering, multifaceted support that he has consistently extended to Sri Lanka and its people. This prestigious honor is reserved for foreign heads of state in",
    "recognition of their friendship and cooperation with the people of Sri Lanka. We firmly believe that Prime Minister Modi, who has always stood by Sri Lanka, is most deserving of this distinction.\nIn Sri Lanka, we too are on a transformative path, which we call the “A Thriving Nation and a Beautiful Life” National Policy. This policy is designed to pave the way for economic progress, social justice, and to provide every citizen with the opportunity to prosper, regardless of their background.",
    "As neighbors, partners, and long-standing friends, let us resolve, at this moment, to build a future filled with shared development. Once again, I express my sincere gratitude to Prime Minister Shri Narendra Modi and his delegation for visiting Sri Lanka at this crucial time, when a people-centered political transformation is underway."
  ]
}