{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-30-2eb1f6",
  "num": "2eb1f6",
  "date_str": "2025-04-30",
  "description": "Positively considering the GSP+ review",
  "url_metadata": "https://pmd.gov.lk/news/positively-considering-the-gsp-review/",
  "lang": "en",
  "article_title": "Positively considering the GSP+ review",
  "article_body_paragraphs": [
    "– Charles Whiteley, Head of South Asia Division of the EU",
    "The Head of South Asia Division, European External Action Service of the European Union Mr. Charles Whiteley stated that the European Union has a favorable perspective on the current GSP+ review process.",
    "He made these remarks during a meeting held today (30) at the Presidential Secretariat with President Anura Kumara Disanayake, as part of an official visit by a European Union delegation to Sri Lanka.",
    "Mr. Whiteley highlighted the longstanding partnership between Sri Lanka and the EU, which has led to significant trade gains. He affirmed the EU’s willingness to continue supporting Sri Lanka in achieving further commercial progress.",
    "He stated that the GSP+ concessions from the European Union are anticipated to encourage Sri Lanka to provide products that meet standardized quality requirements. He further said that the continuation of GSP+ trade concession is assessed on alignment with the current government’s policy commitments and progress.",
    "The meeting assessed Sri Lanka’s advancements in executing 27 international conventions related to the European Union’s GSP+ tax concession, known as the Generalized System of Preferences.",
    "President Disanayake expressed his gratitude for the EU’s assistance during Sri Lanka’s economic crisis. He acknowledged that the GSP+ facility has played an important role in supporting the country’s export sector and economic recovery.",
    "The President further noted that the collapse of Sri Lanka’s economy was the result of a deeply flawed political system, marked by corruption and mismanagement. The President stated that the current administration is working to rebuild the country through stable and transparent governance, though this transformation will require time.",
    "Highlighting a key shift in political support, the President pointed out that unlike previous governments, which relied heavily on support from the South, the current administration was elected with the collective support of Sinhala, Tamil and Muslim communities from across the country. The President reaffirmed his government’s commitment to delivering on the promises made to all citizens.",
    "Also present at the meeting were Minister of Labour, Deputy Minister of Economic Development Dr. Anil Jayantha Fernando, Minister of Justice and National Integration Harshana Nanayakkara, Attorney-at-law, Deputy Minister of Finance and Planning Dr. Harshana Suriyapperuma , Senior Additional Secretary to the President Roshan Gamage, the Ambassador designate of the European Union to Sri Lanka and the Maldives H.E. Carmen Moreno, General for Trade and Economic Security – Policy Officer of the European Commission’s Directorate Mr. Guido Dolara, Desk Officer for Sri Lanka at European External Action Service Ms. Galija Agisheva along with other EU and Sri Lankan officials."
  ]
}