{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-05-en-9dc3d7",
  "num": "en-9dc3d7",
  "date_str": "2025-04-05",
  "description": "Receiving the ‘Sri Lanka Mitra Vibhushana’ Award is…",
  "url_metadata": "https://pmd.gov.lk/news/receiving-the-sri-lanka-mitra-vibhushana-award-is-a-great-honour-for-me/",
  "lang": "en",
  "article_title": "Receiving the ‘Sri Lanka Mitra Vibhushana’ Award is a great honour for me",
  "article_body_paragraphs": [
    "• Indian Prime Minister Shri Narendra Modi",
    "Indian Prime Minister Shri Narendra Modi stated that receiving the ‘Sri Lanka Mitra Vibhushana’ Award, in recognition of the friendship and cooperation extended to the people of Sri Lanka, is a great honour for him. The Prime Minister also emphasized that this is not only an award for him but for the 140 crore Indians. He expressed his gratitude to the President, the Government of Sri Lanka and the people of Sri Lanka for this recognition.",
    "Prime Minister Shri Narendra Modi made these comments during a joint media briefing following an official meeting with President Anura Kumar Disanayake at the Presidential Secretariat today (April 5).",
    "He highlighted the historic ties and deep friendship between India and Sri Lanka, noting that his visit in 2019 occurred during a very sensitive period. He also mentioned that this visit was his fourth trip to Sri Lanka as Prime Minister.",
    "Prime Minister Modi expressed confidence that Sri Lanka, given the bravery and resilience of its people, will recover and rise again stronger. He stated that he is pleased to see Sri Lanka returning to the path of progress.",
    "He further added that India feels proud to be able to fulfill its duty as a respected friend, especially in times like the terrorist attack of 2019, the COVID-19 pandemic and the subsequent economic crisis, during which the Indian government stood firmly by the people of Sri Lanka.",
    "Citing the words of Tamil saint Thiruvalluvar, Prime Minister Modi emphasized that in the face of challenges and enemies, there is no stronger assurance than a true friend and the shield of his friendship.",
    "“President Disanayake chose India for his first foreign visit after becoming President, and I have had the privilege of becoming his first foreign guest”, the Prime Minister said.",
    "“Sri Lanka has a special place in both our Neighbourhood First Policy and Vision ‘MAHASAGAR’. In the last four months, since President Disanayake’s visit to India, we have made significant progress in our cooperation”, he further said.",
    "The cooperation between the two nations has benefitted Sri Lanka’s people, from the Sampur solar power plant project to the establishment of the Trincomalee power station. Prime Minister Modi assured that the benefits of this cooperation would be shared by all the people of Sri Lanka.",
    "The Grid Inter-Connectivity Agreement between the two countries will create opportunities for Sri Lanka to export electricity. The Prime Minister also expressed happiness about the installation of 5,000 solar panels at religious sites in Sri Lanka.",
    "Regarding Sri Lanka’s digital transformation, he mentioned that India will provide support, and also noted that his government has contributed 2.4 billion Sri Lankan rupees for the economic and social development of the country. He also pointed out India’s assistance in building Sri Lanka’s largest agricultural storage complex to benefit farmers.",
    "Prime Minister Modi shared that tomorrow, he will participate in the commissioning of the newly renovated ‘Maho-Omanthai’ railway line and the ‘Maho-Anuradhapura’ railway signalling system, and that India will assist in building 10,000 houses for the Indian Origin Tamil Community in Sri Lanka. He also mentioned that 700 Sri Lankan personnel representing various sectors will receive good governance training, with support from the Indian government.",
    "Under India’s “Sabka Saath, Sabka Vikas” vision, the Indian government is committed to supporting the development of neighboring countries, including Sri Lanka, and has decided to lower interest rates in the restructuring of Sri Lanka’s debt, offering assistance and a pathway for the people of Sri Lanka.",
    "Prime Minister Modi also recalled the spiritual and cultural ties between India and Sri Lanka, which have existed for centuries. “I am extremely happy to announce that the Holy Relics of Lord Buddha found in 1960, in the Aravali region of my home state – Gujarat, are being sent to Sri Lanka for an exposition”, the Prime Minister said.",
    "He also mentioned that India will provide support for the renovation of religious sites such as the Thirukoneswaram Temple in Trincomalee, construction of the sacred city in the Anuradhapura Mahabodhi temple complex, and the Sita Eliya temple in Nuwara Eliya.",
    "Prime Minister Modi further conveyed his gratitude to President Anura Kumar Disanayake and the Sri Lankan government for the warm reception and high state honors received during his visit."
  ]
}