{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-15-c67e05",
  "num": "c67e05",
  "date_str": "2025-05-15",
  "description": "Seven New Envoys to Sri Lanka Present Credentials…",
  "url_metadata": "https://pmd.gov.lk/news/seven-new-envoys-to-sri-lanka-present-credentials-to-the-president/",
  "lang": "en",
  "article_title": "Seven New Envoys to Sri Lanka Present Credentials to the President",
  "article_body_paragraphs": [
    "Seven newly appointed foreign ambassadors to Sri Lanka presented their credentials to President Anura Kumara Disanayake today (15) at the Presidential Secretariat.",
    "The new ambassadors represent the State of Israel, the Argentine Republic, the Republic of Zimbabwe, the Republic of the Philippines, the Republic of Tajikistan, the Kingdom of Cambodia, and the Kingdom of Denmark.",
    "Accordingly:",
    "* His Excellency Mr. Mariano Agustin Caucino has been appointed as the Ambassador-designate of the Argentine Republic, based in New Delhi.\n* Her Excellency Ms. Stella Nkomo has been appointed as the Ambassador-designate of the Republic of Zimbabwe, based in New Delhi.\n* His Excellency Mr. Reuven Javier Azar has been appointed as the Ambassador-designate of the State of Israel, based in New Delhi.\n* Her Excellency Ms. Nina P. Cringlet has been appointed as the Ambassador-designate of the Republic of the Philippines, based in Dhaka.\n* His Excellency Mr. Lukmon Bobokalonzoda has been appointed as the Ambassador-designate of the Republic of Tajikistan, based in New Delhi.\n* Her Excellency Ms. Rath Many has been appointed as the Ambassador-designate of the Kingdom of Cambodia, based in New Delhi.\n* His Excellency Mr. Rasmus Kristensen has been appointed as the Ambassador-designate of the Kingdom of Denmark, based in New Delhi.",
    "Minister of Foreign Affairs, Foreign Employment and Tourism, Vijitha Herath, along with the Secretary to the President, Dr. Nandika Sanath Kumanayake, were also present at the occasion."
  ]
}