{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-21-en-3f9613",
  "num": "en-3f9613",
  "date_str": "2025-05-21",
  "description": "This year’s Poson Festival will be Celebrated with…",
  "url_metadata": "https://pmd.gov.lk/news/this-years-poson-festival-will-be-celebrated-with-full-state-patronage/",
  "lang": "en",
  "article_title": "This year’s Poson Festival will be Celebrated with Full State Patronage",
  "article_body_paragraphs": [
    "• Chief Incumbent of Mihintale Rajamaha Viharaya, Ven. Walawahengunawewa Dhammarathana Thero Commends for Hosting Poson Festival with Full State Patronage After 2023",
    "The Chief Incumbent of Mihintale Rajamaha Viharaya, Ven. Walawahengunawewa Dhammarathana Thero, expressed his appreciation to the government for its decision to hold the Poson Festival 2025 with full state patronage.",
    "The Nayaka Thero made these remarks during a discussion held today (21) at the Presidential Secretariat regarding the State Poson Festival 2025.",
    "The meeting was attended by the Minister of Buddhasasana, Religious and Cultural Affairs , Dr. Hiniduma Sunil Senevi and Secretary to the Presidential Dr. Nandika Sanath Kumanayake.",
    "Venerable Dhammarathana Thero further reiterated that it is the responsibility of the government to reinstate the State Poson Festival, which has been on hold since 2023, and to safeguard it for the benefit of future generations.",
    "The theme of this year’s State Poson Festival will be “May the world be enlightened by the teachings of Buddha.”",
    "In line with the State Poson Festival, a series of religious programmes focusing on offerings of both material and doctrinal significance will commence from June 1.",
    "Poson Week will be observed from June 7 to June 13. During this period, it was decided to close all liquor outlets in the Anuradhapura District to maintain the sanctity of the observances.",
    "Special attention was also drawn to ensuring that all necessary facilities are provided for the hundreds of thousands of pilgrims expected to visit Anuradhapura during the festival period.",
    "Secretary to the President, Dr. Nandika Sanath Kumanayake, instructed state officials to take appropriate measures to facilitate the successful conduct of the State Poson Festival.",
    "Senior Additional Secretary to the President Roshan Gamage, Director General of Buddhist Affairs R.M.P. Rathnayake and other Heads of institutions were also present at the occasion."
  ]
}