{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-15-en-eb81c9",
  "num": "en-eb81c9",
  "date_str": "2025-07-15",
  "description": "Meeting Between President and the Heads of Saudi…",
  "url_metadata": "https://pmd.gov.lk/news/meeting-between-president-and-the-heads-of-saudi-fund-for-development/",
  "lang": "en",
  "article_title": "Meeting Between President and the Heads of Saudi Fund for Development",
  "article_body_paragraphs": [
    "A meeting between President Anura Kumara Disanayake and Chief Executive Officer (CEO) of the Saudi Fund for Development (SFD) Sultan A. Al-Marshad was held yesterday afternoon (14) at the Presidential Secretariat.",
    "The primary focus of the discussion was to assess the current progress of projects implemented with assistance from the Saudi Fund for Development and to identify opportunities for new initiatives.",
    "During the meeting, extensive discussions were held on the support provided by the Saudi Fund to Sri Lanka. The Fund also expressed its willingness to place greater emphasis on digitalization, recognizing its importance in strengthening and enhancing the efficiency of key public services.",
    "The discussions also focused on the continued implementation of the projects currently underway in Sri Lanka with the support of the Saudi Fund for Development.",
    "President Anura Kumara Disanayake recalled the long-standing friendship between Sri Lanka and Saudi Arabia and expressed his gratitude for the unconditional support extended by Saudi Arabia during Sri Lanka’s recent economic crisis.",
    "The President stated that the assistance provided by the Saudi Fund for Development for new projects would be allocated based on the priorities of the people and directed toward meeting those identified needs.",
    "The Ambassador of the Kingdom of Saudi Arabia to Sri Lanka, H.E. Khalid Hamoud Nasser Aldasam Alkahtani, along with Director General of Asia Operations Saudi Fund for Development Dr. Saud Ayid Al-Shammari and a delegation of representatives from the Fund, participated in this occasion.",
    "Representing the Government of Sri Lanka, Minister of Labour and Deputy Minister Economic Development Dr. Anil Jayantha Fernando, Senior Additional Secretary to the President Roshan Gamage, Secretary to the Ministry of Finance Dr. Harshana Suriyapperuma and Director General of the Department of External Resources R.M.S.P.S. Bandara participated in the occasion."
  ]
}