{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-09-01-1a3b5a",
  "num": "1a3b5a",
  "date_str": "2025-09-01",
  "description": "‘Seiri Week’ from September 01–04 to Revitalize State…",
  "url_metadata": "https://pmd.gov.lk/news/seiri-week-from-september-01-04-to-revitalize-state-institutions/",
  "lang": "en",
  "article_title": "‘Seiri Week’ from September 01–04 to Revitalize State Institutions",
  "article_body_paragraphs": [
    "The government has decided to launch a special programme called ‘Seiri Week’under the national initiative Clean Sri Lanka. It will run from September 1 to 4, targeting all state institutions, with the aim of improving efficiency and productivity in the public service.",
    "The main goal of this programme is to create a peaceful, safe and well-organized working environment for public officials. The concept of Seiri, part of the five principles of productivity, refers to identifying what is necessary and eliminating what is unnecessary.",
    "Accordingly, a key focus will be on removing unused items from state institutions and making the best use of limited space.",
    "According to a circular issued by the Secretary to the Ministry of Public Administration, Provincial Councils and Local Government, all Ministries, Departments and state organizations must allocate two hours each morning during this week for cleaning and organizing. Attention will also be given to maintaining clean and attractive buildings and surroundings, improving access roads and ensuring facilities for persons with disabilities.",
    "Guidelines have also been given to properly dispose of unusable inventory items, old motor vehicles and out-dated files.",
    "Crucially, Seiri Week is intended to be an on-going initiative rather than a singular occurrence. All the Heads of the institutions have been directed to implement a lasting framework to maintain the organized environment fostered during this programme, with designated officials tasked with ensuring its persistence."
  ]
}