{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-05-c1035d",
  "num": "c1035d",
  "date_str": "2025-04-05",
  "description": "Seven Memoranda of Understanding Exchanged Between India and…",
  "url_metadata": "https://pmd.gov.lk/news/seven-memoranda-of-understanding-exchanged-between-india-and-sri-lanka-covering-multiple-sectors/",
  "lang": "en",
  "article_title": "Seven Memoranda of Understanding Exchanged Between India and Sri Lanka Covering Multiple Sectors",
  "article_body_paragraphs": [
    "Seven Memoranda of Understanding (MoUs) between India and Sri Lanka, covering several key sectors, were exchanged this morning (05) at the Presidential Secretariat in the presence of President Anura Kumara Disanayake and Indian Prime Minister Shri Narendra Modi.\nMarking a new chapter in Indo-Sri Lanka relations, these agreements focus on enhancing cooperation in the fields of energy, digitalization, defence, healthcare, and development assistance.\nAccordingly, the following MoUs were exchanged:",
    "1. MoU between the Government of India and the Government of Sri Lanka for Implementation of HVDC Interconnection for Import/Export of Power- Exchanged by Prof. K.T.M. Udayanga Hemapala, Secretary of the Ministry Energy of Sri Lanka, and Vikram Misri, Foreign Secretary of India.",
    "",
    "2. MoU on Cooperation in the Field of Sharing Successful Digital Solutions Implemented at Population Scale for Digital Transformation. – Exchanged by Mr. Varuna Sri Dhanapala, Secretary of the Ministry of Digital Economy of Sri Lanka, and Vikram Misri, Foreign Secretary of India.",
    "",
    "3. MoU between the Government of India, the Government of Sri Lanka, and the Government of United Arab Emirates for Cooperation in Development of Trincomalee as an Energy Hub – Exchanged by Prof. K.T.M. Udayanga Hemapala, Secretary of the Ministry of Energy of Sri Lanka; Vikram Misri, Foreign Secretary of India; and His Excellency Khaled Nasser AlAmeri, Ambassador of the United Arab Emirates to Sri Lanka.",
    "",
    "4. MoU on Defence Cooperation between India and Sri Lanka – Exchanged by Retired Air Vice Marshal H.S. Sampath Thuyacontha, Secretary of the Ministry of Defence of Sri Lanka, and Vikram Misri, Foreign Secretary of India.",
    "",
    "5. MoU on Cooperation in the Field of Health & Medicine between the Ministry of Health and Family Welfare of India and the Ministry of Health and Mass Media of Sri Lanka- Exchanged by Specialist Dr. Anil Jasinghe, Secretary of the Ministry of Health and Mass Media of Sri Lanka, and H.E.Mr. Santosh Jha, High Commissioner of India to Sri Lanka.",
    "",
    "06 A Memorandum of Understanding (MoU) on Pharmaceutical Cooperation was exchanged between the Indian Pharmaceutical Export Promotion Council of the Ministry of Health and Family Welfare of India and the National Medicines Regulatory Authority of Sri Lanka – The MoU was exchanged by Secretary to the Ministry of Health and Mass Media, Specialist Dr. Anil Jasinghe, and His Excellency Santosh Jha, High Commissioner of India to Sri Lanka.",
    "",
    "07 A Memorandum of Understanding (MoU) on Multi-sectoral Grant Assistance for Eastern Province was exchanged by Secretary to the Ministry of Finance, Economic Stabilization, and National Policies, Mahinda Siriwardana and His Excellency Santosh Jha, High Commissioner of India to Sri Lanka.",
    "",
    "Reaffirming the theme “Friendship of Centuries, Commitment to a Prosperous Future”, Indian Prime Minister Shri Narendra Modi is undertaking a State Visit to Sri Lanka at the invitation of President Anura Kumara Disanayake.",
    "A number of Cabinet Ministers representing the Government of Sri Lanka, along with India’s Minister of External Affairs Dr. S. Jaishankar, India’s National Security Advisor Ajit Doval, and other members of the Indian delegation, participated in this event."
  ]
}