{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-07-31-d7c31d",
  "num": "d7c31d",
  "date_str": "2025-07-31",
  "description": "President Returns to the Island Concluding Successful State…",
  "url_metadata": "https://pmd.gov.lk/news/president-returns-to-the-island-concluding-successful-state-visit-to-the-maldives/",
  "lang": "en",
  "article_title": "President Returns to the Island Concluding Successful State Visit to the Maldives",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake returned to the island last night (30), successfully concluding his state visit to the Maldives that commenced on the 28th.",
    "The President undertook this state visit at the invitation of Dr. Mohamed Muizzu, President of the Maldives.",
    "During this state visit, President Anura Kumara Dissanayake held extensive discussions with President Dr. Mohamed Muizzu, as well as with the Cabinet Ministers and high-ranking state officials of the Maldives, on bilateral, regional and international issues of mutual importance.",
    "Two key agreements were exchanged during the visit were a Mutual Legal Assistance Agreement between Sri Lanka and the Maldives and a Memorandum of Understanding (MoU) between the Foreign Service Institute of Maldives (FOSIM) and the Bandaranaike International Diplomatic Training Institute of Sri Lanka (BIDTI).",
    "President Muizzu also hosted a special state banquet in honour of President Dissanayake at the ‘Kurumba Maldives’ Resort.",
    "To mark the 60th anniversary of diplomatic relations between the two nations, President Dissanayake planted a sapling at Sultan Park in Male.",
    "The President also addressed the Business Forum jointly organized by the Sri Lanka High Commission in the Maldives and the Sri Lanka–Maldives Business Council of the Ceylon Chamber of Commerce, as well as a gathering of Sri Lankan expatriate community, organized by the Sri Lanka High Commission.",
    "President Dissanayake highlighted the significance of further strengthening the enduring friendship and diverse collaboration that have evolved over the last sixty years, founded on political trust and robust connections between people.",
    "Both countries expressed their mutual commitment to further strengthen and expand their close friendship and cooperation.",
    "The President was accompanied on this visit by Minister of Foreign Affairs, Foreign Employment and Tourism, Vijitha Herath, along with several senior government officials."
  ]
}