{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-31-2025-08-31-a50519",
  "num": "2025-08-31-a50519",
  "date_str": "2025-08-31",
  "description": "President’s Fund Recognises A-Level High Achievers in North…",
  "url_metadata": "https://pmd.gov.lk/news/presidents-fund-recognises-a-level-high-achievers-in-north-central-province/",
  "lang": "en",
  "article_title": "President’s Fund Recognises A-Level High Achievers in North Central Province",
  "article_body_paragraphs": [
    "A ceremony to honour the top performers in the 2023/2024 G.C.E. Advanced Level examinations at the district level, sponsored by the President’s Fund, was held today (31) at the Anuradhapura Central College auditorium. The event was chaired by the Speaker of Parliament, Hon. Jagath Wickremaratne.",
    "During the ceremony, 241 students from the Anuradhapura and Polonnaruwa districts who secured positions 1 to 10 across all six subject streams in the 2023 and 2024 A-Level examinations were awarded certificates and an incentive payment of Rs. 100,000 each. The total expenditure for this initiative by the President’s Fund was Rs. 24.1 million.",
    "Senior Additional Secretary to the President and Secretary to the President’s Fund, Mr. Roshan Gamage, delivered the welcome address and outlined the objectives of the programme.",
    "The keynote address was delivered by the Speaker of Parliament, Hon. Jagath Wickremaratne. He stated that the President’s Fund is now fulfilling its true role by providing highly efficient and effective services for the people and expressed his great satisfaction regarding this initiative.",
    "The event was also addressed by the Deputy Minister of Land and Irrigation, Mr. Susil Ranasinghe and the Governor of the North Central Province, Mr. Wasantha Jinadasa. Parliamentarians including Mr. Sena Nanayakkara, Mr. Bhagya Sri Herath and Mr. Thilina Samarakoon were among the distinguished guests in attendance.",
    "Meanwhile, a special one-day training workshop was held yesterday (30) at the Anuradhapura District Secretariat for officers in charge of the subject from all Divisional Secretariat offices in the North Central Province. This is part of the initiative to decentralise the operations of the President’s Fund to the regional level.",
    "The workshop aimed to educate the officers working on President’s Fund matters in the Anuradhapura and Polonnaruwa districts. The programme is expected to increase the number of beneficiaries from the North Central Province, provide higher quality service to them and introduce updated online methodologies for the delivery of more expedient services through the relevant knowledge and training.",
    "Senior Additional Secretary to the President and Secretary to the President’s Fund, Mr. Roshan Gamage, the Anuradhapura District Secretary, Mr. Ranjith Wimalasuriya and a group of senior officials from the President’s Fund were present on this occasion."
  ]
}