{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-01-en-d2463f",
  "num": "en-d2463f",
  "date_str": "2025-07-01",
  "description": "Students from Mayurapada Central College Visit Presidential Secretariat…",
  "url_metadata": "https://pmd.gov.lk/news/students-from-mayurapada-central-college-visit-presidential-secretariat-and-presidents-house/",
  "lang": "en",
  "article_title": "Students from Mayurapada Central College Visit Presidential Secretariat and President’s House",
  "article_body_paragraphs": [
    "Students of Mayurapada Central College, Mawanella in the Kegalle District, had the opportunity today (01) to participate in the Vision programme organized by the Presidential Secretariat, as part of their educational tour.",
    "This programme, jointly implemented by the Presidential Secretariat, the Ministry of Education and the Department of Communication of the Parliament, provides students with the opportunity to visit key national institutions relevant to their fields of study, including the Presidential Secretariat, the President’s House, Colombo Port City and the Parliament of Sri Lanka.",
    "As part of the programme, Prime Minister Harini Amarasuriya addressed the students and teachers, highlighting the responsibilities of the media, the significance of integrating Artificial Intelligence in the media sector and the importance of the on-going educational reforms.",
    "In parallel to this initiative, students were also educated on the “Clean Sri Lanka” programme and its conceptual significance in fostering a culture of environmental responsibility.",
    "To mark the occasion, and as a symbolic act to encourage environmental preservation, Prime Minister Harini Amarasuriya gifted the school with valuable saplings.",
    "Senior Additional Secretary to the President, Mr. K.N.M. Kumarasinghe, Assistant Director of the Tri-Forces Coordination Unit, Major Nadika Dangolla, Principal of Mayurapada Central College, Mawanella, Mr. E.G.P.I. Dharmatilaka, along with members of the academic staff and other invitees also participated in the event."
  ]
}