{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-12-09-7b7a7d",
  "num": "7b7a7d",
  "date_str": "2024-12-09",
  "description": "Let us unite to transform Sri Lanka into…",
  "url_metadata": "https://pmd.gov.lk/news/let-us-unite-to-transform-sri-lanka-into-a-nation-with-minimal-corruption-and-bribery/",
  "lang": "en",
  "article_title": "Let us unite to transform Sri Lanka into a nation with minimal corruption and bribery",
  "article_body_paragraphs": [
    "– President Anura Kumara Dissanayake stated during the International Anti-Corruption Day celebration.",
    "President Anura Kumara Dissanayake emphasized that no matter how many laws are enacted or institutions are established, justice cannot be ensured to the citizens if those responsible for enforcing them fail to implement them properly.",
    "He further highlighted that the power entrusted by the people must be utilized to serve them; otherwise, that power becomes meaningless.",
    "President Dissanayake made these remarks during a ceremony held today (09) at the Bandaranaike Memorial International Conference Hall (BMICH) to mark the “International Anti-Corruption Day National Celebration – 2024.”",
    "This year’s International Anti-Corruption Day is being commemorated under the theme, ” Uniting with Youth against Corruption: Shaping tomorrow’s Integrity.”",
    "The President pointed out that Sri Lanka already has sufficient laws and institutions to combat bribery and corruption. However, he called for introspection, urging all to examine their conscience and question whether these mechanisms are truly being employed to prevent misconduct.",
    "President Anura Kumara Dissanayake described corruption and bribery as a social tragedy and questioned the relevance of celebrating International Anti-Corruption Day, given Sri Lanka’s decline in rankings from 79th in the international index in 2013 to 115th in 2023.",
    "He highlighted that corruption and fraud have worsened year by year, stressing that if tangible progress is not made in reducing these issues by next year, such celebrations would hold no real value.",
    "The President also noted the performance of the Commission to Investigate Allegations of Bribery or Corruption (CIABOC), revealing that 69 cases were filed in 2021, of which 40 were later withdrawn. Similarly, in 2022, 89 cases were filed, and 45 were subsequently withdrawn.",
    "President Dissanayake emphasized the need to inform the public about the reasons behind the withdrawal of bribery and corruption cases and to disclose why investigating officers failed to appear as witnesses in these cases.",
    "Highlighting that the Bribery or Corruption Commission had convicted only two constables, a Grama Niladhari, and a clerk in a single year, the President noted a widespread public perception that the law in Sri Lanka operates like a spider’s web—where small offenders get caught, while powerful individuals escape unscathed.",
    "The President stressed that rebuilding the country requires a complete overhaul of the state system, asserting that a healthy and functional state cannot be created without such reforms.",
    "He further pointed out that the public’s trust in the legal system and its institutions has been eroded, emphasizing that justice delayed is justice denied.",
    "The President urged collective dedication to transform Sri Lanka into a state with minimal corruption, which he said is essential to restore citizens’ confidence and fulfill their expectations.",
    "As part of these efforts, the United Nations Development Program (UNDP), through its JURE project, has trained over 1,000 government officials to serve as exemplary officers. President Dissanayake formally conferred appointments to 15 of these trained officials.",
    "Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Prime Minister G.P. Saputhanthri, Secretary to the Ministry of Public Security D.W.R.B. Seneviratne, Governor of the Central Bank of Sri Lanka (CBSL) Dr. P. Nandalal Weerasinghe, Acting Inspector General of Police (IGP) Senior DIG Priyantha Weerasooriya, Chairman of the CIABOC W. M. N. P. Iddawala, Supreme Court Justice Yasantha Kodagoda, foreign ambassadors and CIABOC officials were also present."
  ]
}