{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-06-26-4aae34",
  "num": "4aae34",
  "date_str": "2025-06-26",
  "description": "President Meets Former South African President Thabo Mbeki",
  "url_metadata": "https://pmd.gov.lk/news/president-meets-former-south-african-president-thabo-mbeki/",
  "lang": "en",
  "article_title": "President Meets Former South African President Thabo Mbeki",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake met with former President of the Republic of South Africa, Mr. Thabo Mbeki, this afternoon (26) at the Presidential Secretariat.",
    "Mr. Mbeki, who is on his first visit to Sri Lanka, expressed his appreciation for the opportunity to visit the country, stating that he has long followed Sri Lanka’s efforts toward national unity and reconciliation with keen interest. He noted that he was pleased to visit Sri Lanka at this significant moment.",
    "Although South Africa and Sri Lanka are geographically distant, the former President observed that both nations share similarities in their multi-ethnic, multi-religious and multicultural compositions. He added that both countries face similar challenges in achieving peace and reconciliation and expressed his willingness to share lessons learned and experiences from South Africa’s own reconciliation journey.",
    "Mr. Mbeki stated his confidence in President Disanayake’s ability to unite Sri Lanka’s diverse communities and overcome current economic and reconciliation related challenges.",
    "President Disanayake reaffirmed his commitment to fostering national harmony and reconciliation while leading the country forward amidst economic challenges. He emphasized that he remains dedicated to building unity among all ethnic groups and steering the nation toward stability and progress.",
    "Also present at the meeting were South African High Commissioner to Sri Lanka, Sandile Schalk, Chief Executive Officer of the Thabo Mbeki Foundation, Maxwell Boqwana and the Foundation’s Chief Operating Officer, Mr. Lukhanyo Neer.",
    "Representing Sri Lanka were Minister of Public Security and Parliamentary Affairs, Ananda Wijepala and Senior Additional Secretary to the President, Roshan Gamage.",
    "Executive Group Director of The Capital Maharaja Group, Chevaan Daniel and Group Manager Anushka Lewke also joined the occasion."
  ]
}