{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-10-25-243d52",
  "num": "243d52",
  "date_str": "2024-10-25",
  "description": "New Zealand High Commissioner Pledges Support for Economic…",
  "url_metadata": "https://pmd.gov.lk/news/new-zealand-high-commissioner-pledges-support-for-economic-growth-tourism-boost-and-increased-investments-in-sri-lanka/",
  "lang": "en",
  "article_title": "New Zealand High Commissioner Pledges Support for Economic Growth, Tourism Boost, and Increased Investments in Sri Lanka",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake met with the High Commissioner of New Zealand, H.E. David Pine, today (25) at the Presidential Secretariat.",
    "The High Commissioner congratulated the President on his recent victory and pledged New Zealand’s continued support in building a stronger economy and more effective governance to meet the aspirations of the Sri Lankan people.",
    "He expressed his intention of supporting Government of Sri Lanka to increase New Zealand tourist arrivals in Sri Lanka to 50,000 annually, up from the current figure of 7,500. He also discussed opportunities for New Zealand investments in Sri Lanka.",
    "Discussions also focused on enhancing Sri Lanka’s dairy sector, with the High Commissioner offering New Zealand’s expertise in advanced standards, technology, training, and resources to support this development.",
    "Extensive talks were also held on advancing Sri Lanka’s education sector, particularly in vocational training. Additionally, they discussed fostering women’s sports and enhancing governance practices related to sports.",
    "The President provided an update on recent travel advisories, emphasizing measures taken to enhance safety for both tourists and residents. He highlighted strengthened security protocols in major tourist areas, including an increased law enforcement and emergency services presence to ensure a safe environment.",
    "Deputy High Commissioner Mrs. Gabrielle Isaak also joined the discussions."
  ]
}