{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-01-07-9e54e4",
  "num": "9e54e4",
  "date_str": "2025-01-07",
  "description": "President Discusses Vehicle Imports, Tax Reforms and Digitalization…",
  "url_metadata": "https://pmd.gov.lk/news/president-discusses-vehicle-imports-tax-reforms-and-digitalization-with-finance-ministry-officials/",
  "lang": "en",
  "article_title": "President Discusses Vehicle Imports, Tax Reforms and Digitalization with Finance Ministry Officials",
  "article_body_paragraphs": [
    "• He reiterated the government’s commitment to maximizing the benefits provided to citizens, even amidst the current challenges.",
    "President Anura Kumara Disanayake held an extensive discussion with officials from the Ministry of Finance today (07) at the Presidential Secretariat. The meeting focused on issues related to vehicle imports, withholding tax, and the digitalization of VAT collection.",
    "A significant portion of the discussion addressed the challenges surrounding vehicle imports into Sri Lanka. The President emphasized the need for a well-balanced approach to address these concerns, taking into account the country’s financial constraints and economic priorities.\nThe President also highlighted the importance of establishing a mechanism to refund withholding taxes deducted from retirees who are not subject to income tax.\nAdditionally, President Disanayake highlighted the urgent need to digitize Value-Added Tax (VAT) collection processes to enhance efficiency and transparency. He announced plans to implement a comprehensive digital system soon, which is expected to improve tax compliance and revenue generation.",
    "During the meeting, the President expressed optimism about Sri Lanka’s economic progress, stating that the country is steadily moving towards recovery and stability. He reiterated the government’s commitment to maximizing the benefits provided to citizens, even amidst the current challenges.",
    "The meeting was attended by Deputy Minister of Finance and Planning Dr. Harshana Suriyapperuma, Secretary to the Ministry of Finance, Mahinda Siriwardana, the Governor of the Central Bank Nandalal Weerasinghe, Senior Advisor to the President Duminda Hulangamuwa and senior officials from the Ministry of Finance."
  ]
}