{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-01-21-en-b29f41",
  "num": "en-b29f41",
  "date_str": "2025-01-21",
  "description": "Financial and Technical Assistance from the World Bank…",
  "url_metadata": "https://pmd.gov.lk/news/financial-and-technical-assistance-from-the-world-bank-for-key-government-projects-martin-raiser-vice-president-for-south-asia-world-bank-eradicating-poverty-is-only-possible-through-education/",
  "lang": "en",
  "article_title": "Financial and Technical Assistance from the World Bank for Key Government Projects-   Martin Raiser, Vice President for South Asia, World Bank  Eradicating poverty is only possible through education.",
  "article_body_paragraphs": [
    "– President",
    "Martin Raiser, Vice President for South Asia at the World Bank, stated that the organization is committed to providing financial and technical assistance for Sri Lanka’s key government projects.",
    "This statement was made during a meeting between President Anura Kumara Disanayake and representatives of the World Bank held today (21) at the Presidential Secretariat.",
    "During the discussion, consensus was reached to extend financial and technical support for programs aimed at generating employment for youth, the “Clean Sri Lanka” project, poverty alleviation in rural areas, and digital transformation projects.",
    "New projects in the areas of education, energy, digitalization, and Northern development were also discussed for potential support.\nMr. Martin Raiser assured that the World Bank would ensure the timely disbursement of approved financial assistance for Sri Lanka.",
    "President Anura Kumara Disanayake emphasized that rural poverty could be alleviated by developing the education sector. He called on the World Bank representatives to support the government’s ongoing educational reforms and requested assistance for the development of the public transportation sector.",
    "Despite 28% of Sri Lanka’s labour force being engaged in agriculture, the sector contributes only around 6% to the Gross Domestic Product (GDP). The President highlighted that this contribution is insufficient and needs improvement.\nThe President explained the government’s plans to provide essential facilities for the population, given the country’s high population density.",
    "The meeting also covered the government’s strategies for youth employment generation and the implementation of new programs to attract tourists in 2025.",
    "President Anura Kumara Disanayake also revealed plans for the rapid development of ports and airports and stated that the government is focused on speeding up port development initiatives.\nSpecial attention is being directed toward Northern development, with plans to establish three investment zones in the Northern Province.",
    "The President added that efforts are underway to enhance tourism in the north, improve water facilities, and address the social issues of the Northern population while preserving their cultural identity.",
    "The meeting was attended by Minister of Labour and Deputy Minister of Economic Development, Dr. Anil Jayantha Fernando; Secretary to the President Dr. Nandika Sanath Kumanayake; World Bank Regional Country Director for Nepal, Maldives, and Sri Lanka, David Sislen; the World Bank and International Finance Corporation (IFC) Country Manager for Sri Lanka and Maldives, Gevorg Sargsyan; and the Vice President’s Special Assistant, Kishan Abeygunawardena."
  ]
}