{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-22-en-8ca910",
  "num": "en-8ca910",
  "date_str": "2025-05-22",
  "description": "BOC and NSB Record Historic Profits, Signal New…",
  "url_metadata": "https://pmd.gov.lk/news/boc-and-nsb-record-historic-profits-signal-new-era-of-banking-excellence/",
  "lang": "en",
  "article_title": "BOC and NSB Record Historic Profits, Signal New Era of Banking Excellence",
  "article_body_paragraphs": [
    "In a milestone moment for Sri Lanka’s financial sector, the Bank of Ceylon (BOC) and the National Savings Bank (NSB) reported record-breaking profits for the year 2024, officially presenting their annual reports to President Anura Kumara Disanayake at the Presidential Secretariat today (22).",
    "The achievements, marked by robust fiscal discipline, strategic vision and public accountability, signal a renewed trajectory of confidence in state-owned banking institutions.",
    "The BOC announced a staggering pre-tax profit of Rs. 106 billion, the highest ever recorded not only by a bank but by any institution, public or private, in Sri Lanka’s history. BOC Chairman Kavinda de Zoysa emphasized the significance of this financial milestone, stating, “This is a historic record as the BOC recorded the highest profit before tax of Rs. 106 billion, the highest profit achieved by any institution, bank or company in Sri Lanka in its entire history.”",
    "He credited the bank’s strategic focus on national development and SME support, adding, “BOC continues as the largest SME and development bank in the country with the best business rehabilitation unit which is futuristic and supports the entire nation.”",
    "Meanwhile, the NSB posted a dramatic turnaround, reporting a pre-tax profit of Rs. 26.4 billion, a remarkable leap from Rs. 4.2 billion in 2023. Chairman Dr. Harsha Cabral attributed this growth to prudent fiscal governance and effective stakeholder collaboration.",
    "“The National Savings Bank recorded the highest ever profit before tax of Rs. 26.4 billion for the year 2024. This is a momentous success and a major increase from the Rs. 4.2 billion in 2023,” he said. “The success of NSB is mainly due to the financial discipline and macroeconomic stability of the country. I dedicate this achievement to the entire NSB family, including our employees, board of directors, senior staff, customers and all stakeholders who support us directly or indirectly.”",
    "Dr. Cabral highlighted that NSB is no longer a burden on the state. “We are a self-sustaining success story and not a burden on the Treasury anymore. With professional management and financial discipline, the NSB has achieved its targets and hopes to exceed them in 2025,” he noted. He also pointed to internal reforms and staff incentives that bolstered morale and productivity. In 2024, NSB’s workforce was streamlined from 4,600 to 4,200 while maintaining a 262-branch network. Employees were rewarded with a five-month bonus, and gold coins were reintroduced for long service recognition after a five-year gap.",
    "Both chairmen underscored a rare but significant aspect of their governance: neither they nor their board members draw a salary for their service. “Our reward is the institution’s success and its contribution to national development,” Cabral remarked, a sentiment echoed by de Zoysa as a model of civic-minded leadership.",
    "President Anura Kumara Disanayake commended the accomplishments of both institutions, stating, “These banks demonstrate how strategic leadership and ethical governance can transform public institutions into pillars of national strength. Their performance is a beacon of what’s possible in Sri Lanka’s economic future.”",
    "With an eye on 2025, BOC is set to expand its digital infrastructure to enhance accessibility and customer service, while NSB plans to refine its operations further, guided by corporate governance best practices."
  ]
}