{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-12-10-b4a02a",
  "num": "b4a02a",
  "date_str": "2024-12-10",
  "description": "Committee to Review Economic Use of State-Allocated Residences…",
  "url_metadata": "https://pmd.gov.lk/news/committee-to-review-economic-use-of-state-allocated-residences-for-former-presidents-deputy-ministers-and-state-institutions/",
  "lang": "en",
  "article_title": "Committee to Review Economic Use of State-Allocated Residences for Former Presidents, Deputy Ministers and State Institutions",
  "article_body_paragraphs": [
    "A Cabinet approval has been granted for a unified proposal presented by President Anura Kumara Dissanayake and the Minister of State Administration, Provincial Councils, and Local Government. The proposal aims to create a suitable strategy for the effective economic utilization of government properties, including residences allocated to former presidents, deputy ministers, and various state institutions.",
    "Under the Ministry of Public Administration, Provincial Councils, and Local Government, there are 50 government bungalows located in Colombo 07 and Colombo 05. In addition, there are several Presidential Residences under the administration of the Presidential Secretariat, situated in Colombo, Kandy, Nuwara Eliya, Mahiyanganaya, Anuradhapura, Kataragama, Jaffna, Embilipitiya, and Bentota. Apart from the Presidential Residences in Colombo and Kandy, which are in continuous use, the remaining Presidential residencies and the “Visumpaya” in Colombo 02, formerly the official residence of several state leaders and now managed by the Urban Development Authority, the official residence of the Prime Minister in Nuwara Eliya which is under the Prime Minister’s Office, and the aforementioned government bungalows are set to be used in a more economically productive manner.",
    "Currently, these properties are not being used to their full potential, and the proposal aims to remedy this situation by ensuring that these assets are utilized in a more productive and economically beneficial manner."
  ]
}