{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-14-a9a8c7",
  "num": "a9a8c7",
  "date_str": "2025-05-14",
  "description": "Presidential Secretariat Launches National Sanitation Programme for Fuel…",
  "url_metadata": "https://pmd.gov.lk/news/presidential-secretariat-launches-national-sanitation-programme-for-fuel-stations-under-clean-sri-lanka/",
  "lang": "en",
  "article_title": "Presidential Secretariat Launches National Sanitation Programme for Fuel Stations under “Clean Sri Lanka”",
  "article_body_paragraphs": [
    "In a landmark move to promote public hygiene and accessibility, the Government today (14) launched a national-level initiative to install modern sanitation facilities at fuel stations across the country under the “Clean Sri Lanka” programme. The official launch was held at the Presidential Secretariat, with the participation of top government officials and key industry stakeholders.\nThe initiative aims to transform fuel stations into clean, safe and inclusive spaces by providing essential sanitation infrastructure accessible to all segments of the public, particularly women, children, the elderly and people with disabilities.\nAn MoU was signed between the Presidential Task Force on Clean Sri Lanka, the Ministry of Energy and the island’s four major fuel providers: Ceylon Petroleum Corporation (CPC), Lanka IOC PLC (LIOC), Sinopec Energy Lanka (Pvt) Ltd and RM Parks (Pvt) Ltd.\nUnder the three-year programme, 540 modern public sanitation facilities will be established at selected fuel stations islandwide. The timeline for rollout is as follows:",
    "By the end of 2025, at least 100 of these facilities are expected to be operational, providing clean and user-friendly amenities to travellers across the country.\nSpeaking at the event, Secretary to the President Dr Nandika Sanath Kumanayake stated, “This is not just a policy commitment but a promise to build a healthier, cleaner and more dignified Sri Lanka. The Clean Sri Lanka initiative seeks to deliver long-term public services that meet modern hygiene standards.”\nHe also highlighted that this partnership between the public and private sectors sets an example for delivering effective and sustainable services. Plans are in place to encourage further participation from large-scale private sector entities, such as retail chains, to extend the reach and impact of the programme.",
    "",
    "The event was attended by Secretary to the Ministry of Energy, Prof. Udayanga Hemapala; Senior Additional Secretary to the President, Mr Russell Aponsu; senior executives from the four fuel providers; and officials from the Clean Sri Lanka Presidential Task Force."
  ]
}