{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-09-25-9abb69",
  "num": "9abb69",
  "date_str": "2024-09-25",
  "description": "Appointment of New Secretaries for 15 Ministries, Including…",
  "url_metadata": "https://pmd.gov.lk/news/appointment-of-new-secretaries-for-15-ministries-including-prime-ministers-and-cabinet-secretaries/",
  "lang": "en",
  "article_title": "Appointment of New Secretaries for 15 Ministries, Including Prime Minister’s and Cabinet Secretaries",
  "article_body_paragraphs": [
    "New secretaries have been appointed for 15 ministries, including the positions of Prime Minister’s Secretary and Cabinet Secretary.\nThe full list of appointments is as follows:\n1. Mr. G.P. Saputantri – Secretary to the Prime Minister\n2. Mr. W.M.D.J. Fernando – Cabinet Secretary\n3. Mr. K.D.S. Ruwanchandra – Secretary to the Ministry of Transport, Highways, Ports, and Civil Aviation\n4. Mr. K.M.M. Siriwardena – Secretary to the Ministry of Finance, Economic Development, Policy Formulation, Planning, and Tourism\n5. Mrs. Aruni Wijewardena – Secretary to the Ministry of Foreign Affairs\n6. Ms. J.M.T. Jayasundara – Secretary to the Ministry of Education, Science and Technology\n7. Mr. K. Maheson – Secretary to the Ministry of Women, Children, Youth Affairs, and Sports\n8. Mr. M.M. Naimuddin – Secretary to the Ministry of Trade, Commerce, Food Security, Cooperative Development, Industry, and Entrepreneurship Development\n9. Mr. A.M.P.M.B. Atapattu – Secretary to the Ministry of Rural and Urban Development, Housing, and Construction\n10. Mr. Palitha Gunaratne Mahipala – Secretary to the Ministry of Health\n11. Mr. W.P.P. Yasaratne – Secretary to the Ministry of Justice, Public Administration, Home Affairs, Provincial Councils, Local Government, and Labour\n12. Mr. B.K. Prabhath Chandrakeerthy – Secretary to the Ministry of Environment, Wildlife, Forest Resources, Water Supply, Plantation, and Community Infrastructure\n13. Mr. M.P.N.M. Wickramasinghe – Secretary to the Ministry of Agriculture, Lands, Livestock, Irrigation, Fisheries, and Aquatic Resources\n14. Mr. H.S.S. Thuiyakontha – Secretary to the Ministry of Defence\n15. Mr. D.W.R.B. Seneviratne – Secretary to the Ministry of Public Security\n16. Mr. Ranjith Ariyaratne – Secretary to the Ministry of Buddhasasana, Religious and Cultural Affairs, National Integration, Social Security and Mass Media\n17. Professor K.T.M. Udayanga Hemapala – Secretary to the Ministry of Energy"
  ]
}