{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-06-en-b264c4",
  "num": "en-b264c4",
  "date_str": "2025-05-06",
  "description": "President Engages in High-Level Discussions with Vietnam’s Business…",
  "url_metadata": "https://pmd.gov.lk/news/president-engages-in-high-level-discussions-with-vietnams-business-community/",
  "lang": "en",
  "article_title": "President Engages in High-Level Discussions with Vietnam’s Business Community",
  "article_body_paragraphs": [
    "During his official state visit to Vietnam, President Anura Kumara Disanayake participated in a series of high-level discussions with key representatives of Vietnam’s business community.",
    "As part of this engagement, the President met with senior executives of Vingroup, a leading investor in real estate and tourism. The discussions were attended by Mr. Nguyen Viet Quang, Vice Chairman and Chief Executive Officer of Vingroup, along with other members of the company’s top management.",
    "The President also held talks with Sun Group, Vietnam’s foremost developer of premier leisure and theme park projects. The meeting was chaired by Mr. Dang Minh Truong, Chairman of Sun Group.",
    "In a separate engagement, discussions took place with FPT Corporation, a pioneer in digital transformation. The delegation from FPT was led by Mr. Nguyen Van Khoa, Chief Executive Officer of the company.",
    "Further discussions were held with SOVICO Group, with the participation of Mr. Dinh Viet Phuong, Chief Executive Officer of Vietjet Air, a subsidiary of the group. In addition, talks with ROX Group were conducted, attended by Mr. Tran Xuan Quang, Chief Executive Officer, and other senior executives.",
    "These discussions focused on strengthening investment ties and exploring opportunities for collaboration across sectors including tourism, real estate, digital transformation, aviation, finance and infrastructure.",
    "Minister of Foreign Affairs, Foreign Employment and Tourism Vijitha Herath, also took part in the meetings representing the Government of Sri Lanka."
  ]
}