{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-09-01-fd4ee1",
  "num": "fd4ee1",
  "date_str": "2025-09-01",
  "description": "President declares open the Immigration and Emigration Department’s…",
  "url_metadata": "https://pmd.gov.lk/news/president-declares-open-the-immigration-and-emigration-departments-jaffna-regional-office/",
  "lang": "en",
  "article_title": "President declares open the Immigration and Emigration Department’s Jaffna Regional Office",
  "article_body_paragraphs": [
    "– President",
    "President Anura Kumara Dissanayake stated that efforts are underway to enable the public to carry out all payments and transactions with the government through online methods by next year.",
    "The President stated that digitalisation, a key programme of the present government, enables the decentralisation of all administrative functions, which were previously confined to Colombo, to remote rural villages, thereby giving the people the opportunity to access government services much more conveniently.",
    "President Anura Kumara Dissanayake stated this while participating in the event to open the Jaffna Regional Office of the Department of Immigration and Emigration today (01).",
    "This office, established within the premises of the Jaffna District Secretariat, is equipped with all facilities including modern technology.",
    "Until now, the people of Jaffna, Kilinochchi and Mullaitivu had to travel a long distance to the Vavuniya Regional Office, the only regional office in the Northern Province, to obtain immigration and emigration services. As the number of foreign passport applications from the Northern Province is increasing, this regional office was opened to fulfill the need for a more easily accessible location.",
    "The issuance of three passports by the President symbolised the commencement of providing Department of Immigration and Emigration services to the people of Jaffna.",
    "Subsequently, at a meeting with Jaffna District public officials held at the auditorium of the Jaffna District Secretariat, the President stated that in order to meet the expectations of the people, political authorities and public officials must work together.",
    "The President emphasised that while the government will do its utmost to protect public officials who use their authority for the welfare of the people, it will not hesitate to enforce the law against those who misuse that authority for monetary gain. He further stated that, at present, all public servants in the country have the opportunity to fulfill their duty to the nation.",
    "The President further pointed out that a strong public service is needed to build the country and behind the development of every developed country in the world, there is a strong public service.\nFurther expressing his views, President Anura Kumara Dissanayak said;",
    "“Today, we have established facilities for obtaining services from the Regional Office of the Department of Immigration and Emigration at the Jaffna District Secretariat. Although symbolically it was the issuance of an immigration document, our intervention in this task had a much broader purpose. Our entire administrative structure has been centred in Colombo, compelling people living in distant provinces to travel to Colombo for many services.",
    "The aim of our government is to decentralise this administration to even the most remote rural villages. Facilities must be arranged so that citizens can access government services close to them. By next year, our objective is to enable people to carry out all their transactions with the government through computer software systems and even from their mobile phones. The foremost priority of our government is digitalisation.",
    "At the same time, steps have been taken to strengthen the public service. At the District Committee meeting held at this very place earlier, I announced that we would be granting a salary increase in April. We have done so. By next January, we will ensure that the remaining portion of that increase is also provided. If this country is to be rebuilt, a strong public service is essential. Every developed nation has a robust public service and we too are working to build one in our country.”",
    "Your signature carries great responsibility. If you use it to serve the people, we will give you our fullest protection. But if you use it for financial gain, the law will take its course. We need a State that upholds the rule of law. Unfortunately, our country has become a place where the law has been disregarded and the dignity of public institutions has collapsed. We must restore respect to every state institution and ensure that every public officer regains the honour they deserve. To support this, we will provide the necessary facilities to state institutions.",
    "Our country has reached a point where we must rebuild from the ground up. We have a comprehensive development plan for the Northern Province. For the first time, at the last Presidential and General Elections, the people of the North entrusted their votes to form a government. In a country once divided and mistrustful, people placed confidence in governance. Our duty now is to ensure that this unity is not broken but strengthened, building a nation of togetherness and brotherhood for future generations.",
    "We are aware that certain defeated political forces are attempting to use nationalism as a tool to regain power. This can be seen both in the North and the South. But such nationalist politics serve politicians, not the people. Therefore, all of us whether in the North or the South must reject nationalist politics and ensure it never rises again. We are firmly committed to this.",
    "As a government, we strongly believe there will never be another war in our country. Some try to spread fear that war will return. But our work is to ensure it does not. We must return people’s lands to them, reopen closed roads and eliminate suspicion between communities. I am confident that all of us will work to prevent another war and with that mind-set, we must move our country forward. We must build a new society, leaving behind failed political movements, religious divisions and casteism these belong to the past. Today, what matters is not ethnicity, religion or caste, but humanity. We must place humanity above all divisions and build a country where humanity is the highest value. That is the future of both our country and the world.",
    "I am aware that when we excavate the earth, old skeletons surface. Today, the discovery of mass graves in Chemmani has caused great concern. We are conducting a fully transparent investigation into these. Our goal is to ensure that such mass graves will never be created again in this country.",
    "At this moment, we are fulfilling the most important needs of our nation. Together with our religious leaders, political authorities, state officials and representatives of the security forces, we must work with one purpose. As political leaders, we will fulfill our responsibilities to the fullest. Let us all unite to rebuild this country.",
    "The event was attended by Minister of Public Security and Parliamentary Affairs Ananda Wijepala, Minister of Fisheries, Aquatic and Ocean Resources, Ramalingam Chandrasekar, Deputy Minister of Public Security and Parliamentary Affairs Sunil Watagala, Deputy Minister of Land and Irrigation Susil Ranasinghe, Members of Parliament, Governor of the Northern Province Nagalingam Vethanayahan, Controller General of Immigration and Emigration Chaminda Pathiraja, Jaffna District Secretary M.Piiratheepan, along with state officials and representatives of the security forces."
  ]
}