{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-03-11-en-48aaf9",
  "num": "en-48aaf9",
  "date_str": "2025-03-11",
  "description": "President Meets with the Excise Department Officials",
  "url_metadata": "https://pmd.gov.lk/news/president-meets-with-the-excise-department-officials/",
  "lang": "en",
  "article_title": "President Meets with the Excise Department Officials",
  "article_body_paragraphs": [
    "A meeting between President Anura Kumara Disanayake and officials of the Excise Department was held today (11) at the Presidential Secretariat.",
    "The discussion focused on addressing the current challenges faced by the Excise Department and achieving this year’s revenue targets.",
    "A key point of the discussion was the integration of the department’s operations with the Inland Revenue Department to enhance efficiency and fairness in tax collection.",
    "Attention was drawn to the efficient and effective regulation of alcohol and other approved intoxicants within the country to support economic growth. This includes increasing state revenue through proper regulation of the alcohol and tobacco industries, facilitating legal revenue generation, enforcing compliance with laws and regulations, implementing strong awareness programs against illegal alcohol, hazardous drugs, and psychoactive substances, preventing health risks associated with unregulated alcohol consumption, and ensuring public safety.",
    "Discussions were held on revenue collection and protection through an effective decision-making and management mechanism in strategic and operational activities.",
    "The necessity of formulating a human resource and technological development plan to enhance the efficiency of the Excise Department was also discussed.",
    "The meeting was attended by Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Finance Mahinda Siriwardana, Commissioner General of Excise Udaya Kumara Perera, and a group of Excise Department officials."
  ]
}