{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-30-def980",
  "num": "def980",
  "date_str": "2025-05-30",
  "description": "Students from four schools visit the Presidential Secretariat",
  "url_metadata": "https://pmd.gov.lk/news/students-from-four-schools-visit-the-presidential-secretariat/",
  "lang": "en",
  "article_title": "Students from four schools visit the Presidential Secretariat",
  "article_body_paragraphs": [
    "A group of students from four schools located in the Hewanakumbura, Baddegama, Polonnaruwa and Wekandawela areas visited the Presidential Secretariat and the President’s House, today (30).",
    "Accordingly, a group of students from Hewanakumbura Sri Pungnasaara Maha Vidyalaya, Baddegama Christ Church Boys’ College, Polonnaruwa Bakamuna Mahasen National School and Wekandawela Morayaya Maha Vidyalaya visited the Presidential Secretariat and the President’s House.",
    "These schools provided with this opportunity in conjunction with the ‘Vision’ series of programmes designed for school children by the Presidential Secretariat, the Ministry of Education and the Department of Communication of the Sri Lanka Parliament.",
    "After visiting the Presidential Secretariat (formerly the Old Parliament Building), the students were also educated about the history of Parliament.",
    "The academic staff and students of these colleges were also made aware of the ‘Clean Sri Lanka’ initiative, which is being carried out based on a concept proposed by President Anura Kumara Disanayake, emphasizing the importance of the executive’s role and the rule of law.",
    "Acting Inspector General of Police Priyantha Weerasuriya presented a lecture addressing the issue of drug menace and the enhancement of values.",
    "To mark this occasion, books to the libraries of these schools and sports equipment were donated. Furthermore, valuable saplings were distributed to the schools to commemorate the commencement of Environment Week.",
    "Minister of Energy, Kumara Jayakody , Minister of Labour and Deputy Minister of Economic Development Anil Jayantha Fernando, Senior Additional Secretary to the President K. M. N. Kumarasinghe, Presidential Advisor (Legal) Senior Advocate J. M. Wijebandara, Assistant Director Nadeeka Dangolla and Principals, Deputy Principals, and teaching staff of the relevant schools were present at this event."
  ]
}