{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-09-9a054c",
  "num": "9a054c",
  "date_str": "2025-05-09",
  "description": "Second Phase of Bidding for Luxury Vehicles from…",
  "url_metadata": "https://pmd.gov.lk/news/second-phase-of-bidding-for-luxury-vehicles-from-the-presidential-secretariat-commences/",
  "lang": "en",
  "article_title": "Second Phase of Bidding for Luxury Vehicles from the Presidential Secretariat Commences",
  "article_body_paragraphs": [
    "The second phase of bidding has commenced for the sale of 27 luxury and decommissioned vehicles from the Presidential Secretariat.",
    "These vehicles, manufactured between 1991 and 2016, include a range of high-end and utility models: two BMW cars, two Ford Everest SUVs, one Hyundai Terracan SUV, two Land Rover SUVs, one Mitsubishi Montero, three Nissan petrol cars, two Nissan-type motor cars, one Porsche Cayenne, five SsangYong Rexton SUVs, one Land Cruiser Sahara SUV, six V08 vehicles and one Mitsubishi Rosa air-conditioned bus.",
    "Tender documents are available from the Finance Division, located on the second floor of the Sema Building at the Presidential Secretariat, on working days between 9:00 a.m. and 3:00 p.m. until 14th May. Interested parties may also inspect the vehicles at the Salusala premises, No. 93, Jawatta Road, up to the same date.",
    "This auction follows the successful first phase of the programme, during which 14 luxury vehicles, six decommissioned vehicles and various spare parts were sold. That phase included the auction of 15 vehicles, including nine Defender Jeeps. The initiative reflects the government’s ongoing commitment to reducing public expenditure and ensuring fiscal discipline.",
    "It is important to note that the vehicles on offer were not allocated to the permanent staff of the Presidential Secretariat. They were utilised by advisors and other individuals appointed under Article 41(1) of the Constitution during the tenure of the previous President.",
    "The official notice regarding this auction is attached herewith. Click Here"
  ]
}