{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-11-ef24f0",
  "num": "ef24f0",
  "date_str": "2025-04-11",
  "description": "Focus on Commercializing Research and Development Activities Related…",
  "url_metadata": "https://pmd.gov.lk/news/focus-on-commercializing-research-and-development-activities-related-to-defence-sector/",
  "lang": "en",
  "article_title": "Focus on Commercializing Research and Development Activities Related to Defence Sector",
  "article_body_paragraphs": [
    "A meeting organized by the National Initiative for Research & Development Commercialisation (NIRDC) was held yesterday (10) at the Presidential Secretariat to streamline and commercialize research and development activities in the defence sector.",
    "Participating institutions included the Centre for Defence Research and Development under the Ministry of Defence, the Sri Lanka Army, Navy and Air Force, the General Sir John Kotelawala Defence University and the Research and Development Division of the Sri Lanka Police.",
    "The NIRDC Unit, established under the Presidential Secretariat, aims to accelerate national development by facilitating investment opportunities to commercially apply completed or nearing completion research projects from both public and private institutions.",
    "Defence institutions play a critical role for the progress of technology and science in relation to national security and development. Acknowledging this importance, the meeting was chaired by Senior Advisor to the President on Science and Technology, Professor Gomika Udugamasuriya.",
    "During the meeting, it was discussed in detail regarding the completed and on-going research and development projects within the defence sector, as well as those planned for the future. Special attention was given to identifying opportunities for collaboration among research and development units, enhancing innovation capabilities, and exploring ways to share resources effectively.",
    "The discussion focused on identifying opportunities for collaboration between research and development units relevant to these sectors, enhancing innovation capabilities and exploring ways to share resources effectively. It also examined possible steps to strengthen coordination between civil and defence research institutions. The discussion concluded productively, with several innovations identified that have the potential for future commercialization.",
    "The event was attended by Senior Additional Secretary to the President (Finance and Economic Affairs) Mr. Russel Aponsu, NIRDC Director General Dr. Muditha D. Senarath Yapa, Director (Investments) Mr. Idunil Gunathilaka along with other officials."
  ]
}