{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-10-16-fc7e2c",
  "num": "fc7e2c",
  "date_str": "2024-10-16",
  "description": "President Anura Kumara Dissanayake Urges Education Reform to…",
  "url_metadata": "https://pmd.gov.lk/news/president-anura-kumara-dissanayake-urges-education-reform-to-align-with-global-demands-for-future-growth/",
  "lang": "en",
  "article_title": "President Anura Kumara Dissanayake Urges Education Reform to Align with Global Demands for Future Growth",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake emphasized the need to rebuild Sri Lanka’s education system in alignment with global demands to achieve the country’s educational goals.",
    "He pointed out that children must be equipped with knowledge to improve the nation’s human capital for Sri Lanka’s future progress. The President further highlighted that the responsibility of creating the workforce needed by the world over the next decade falls on education officials, stressing the importance of aligning educational projects with this vision.",
    "President Anura Kumara Dissanayake made these remarks today (16) during a progress review meeting of the Ministries of Education, Science, and Technology at the Presidential Secretariat.",
    "During the review, chaired by President Dissanayake and Prime Minister Dr. Harini Amarasuriya, there was an extensive discussion on five key projects implemented by the Ministries of Education, Science, and Technology.",
    "The meeting focused on areas such as modernizing school education, improving teacher training, advancing secondary education, enhancing technical education, and developing information technology education.",
    "Both the President and Prime Minister instructed officials to expedite the implementation of these projects. Attention was also drawn to reorganizing the current school system to ensure that educational reforms are more accessible and effective for all children.",
    "Further discussions were held on expanding the number of schools offering science, mathematics, and technology curriculums for Advanced Level students.",
    "The meeting was attended by the Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Education Tilaka Jayasundara, and other ministry officials."
  ]
}