{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-13-c17c36",
  "num": "c17c36",
  "date_str": "2025-05-13",
  "description": "“Vesak Bhakti Gee Saraniya” Commences at the Presidential…",
  "url_metadata": "https://pmd.gov.lk/news/vesak-bhakti-gee-saraniya-commences-at-the-presidential-secretariat-premises/",
  "lang": "en",
  "article_title": "“Vesak Bhakti Gee Saraniya” Commences at the Presidential Secretariat Premises",
  "article_body_paragraphs": [
    "The “Vesak Bhakti Gee Saraniya” (Vesak Bakthi Ghee recital) commenced at 6:30 p.m. yesterday (12) within the premises of the Presidential Secretariat. The event is held in parallel with the Buddha Rashmi Vesak Zone, jointly organised by the Hunupitiya Gangaramaya Temple, the Presidential Secretariat and the Prime Minister’s Office.",
    "The programme features Bakthi Ghee performances by choirs from the Sri Lanka Army, Navy, Air Force, Police and Civil Security Department, along with popular vocalists from across the island. These performances will take place on 13, 14 and 15 May at the Presidential Secretariat.",
    "In conjunction with these celebrations, a dansala (almsgiving), jointly organised by the Presidential Secretariat and the Sri Lanka Army, also commenced yesterday near the Secretariat. A large number of devotees from across the country participated. The dansala will continue today (13).",
    "Additionally, a short-eats dansala for those visiting Colombo to witness the Vesak festivities began yesterday (12) near the Presidential Secretariat and will continue until 16 May.",
    "Under the patronage of the Presidential Secretariat, a variety of Vesak programmes have been organised around the Gangaramaya Buddha Rashmi Vesak Zone and the Bauddhaloka Vesak Zone. These include decorative lighting of the Secretariat premises, surrounding buildings and roads, as well as Vesak lantern exhibitions. The staff of the Presidential Secretariat have actively contributed to these activities."
  ]
}