{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-10-11-16eda8",
  "num": "16eda8",
  "date_str": "2024-10-11",
  "description": "President Directs Officials to Provide a Monthly Allowance…",
  "url_metadata": "https://pmd.gov.lk/news/president-directs-officials-to-provide-a-monthly-allowance-of-rs-3000-to-pensioners-from-next-week/",
  "lang": "en",
  "article_title": "President Directs Officials to Provide a Monthly Allowance of Rs. 3,000 to Pensioners from Next Week",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake has instructed officials of the Ministry of Finance to take necessary action to provide a monthly interim allowance of Rs. 3000 to all pensioners, from next week.",
    "After reviewing the delay in adding the Rs. 3000 allowance to the October pension, the President directed that this amount be credited to the pensioners’ accounts within the next week.",
    "These instructions were given during a meeting held yesterday (10) afternoon at the Presidential Secretariat with senior officials of the Ministry of Finance, chaired by President Anura Kumara Dissanayake.",
    "Despite the circular No. 02/2024 dated 2024/08/24 issued by the Public Administration Department to grant a monthly interim allowance of Rs. 3000 to all pensioners, funds were not allocated for this purpose.",
    "Upon reviewing the matter, President Anura Kumara Dissanayake informed the officials of the Ministry of Finance to ensure that the required funds are provided.",
    "Considering the hardships faced by pensioners due to the non-payment of the Rs. 3000 allowance with the October pension, and their subsequent requests, the President decided to proceed with the payment from this month, despite the prevailing financial difficulties of the government.",
    "Since the October pension has already been credited to the pensioners’ accounts, the President instructed officials to ensure that the Rs. 3000 allowance is credited to their accounts within the next week, and from next month, this allowance will be added to the monthly pension.",
    "Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Finance Mahinda Siriwardena and several senior officials from the Ministry of Finance were present at this meeting"
  ]
}