{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-02-28-4bb116",
  "num": "4bb116",
  "date_str": "2025-02-28",
  "description": "The NPP Government Will End the Criminal Underworld…",
  "url_metadata": "https://pmd.gov.lk/news/the-npp-government-will-end-the-criminal-underworld-operating-beneath-the-legal-state/",
  "lang": "en",
  "article_title": "The NPP Government Will End the Criminal Underworld Operating Beneath the Legal State",
  "article_body_paragraphs": [
    "• There Will Be No Opportunity for Nationalism or Extremism to Resurface in the Country",
    "• The Simultaneous Operation of Several Criminal Gangs Raises Suspicion of a Conspiracy",
    "• The Current Government Has Ended the Era of Inhumanity and Paved the Way for Discipline",
    "– President States in Parliament",
    "President Anura Kumara Dissanayake affirmed that the National People’s Power (NPP) government is committed to eradicate the criminal underworld that operates within the legal state.",
    "The President emphasized that nationalism and extremism have historically posed significant threats to national security and assured that the current administration will not allow either to resurface in Sri Lanka.",
    "President Dissanayake also stated that the government is prepared to repeal the Prevention of Terrorism Act (PTA) and introduce a new legal framework to prevent terrorism.",
    "President Anura Kumara Dissanayake made these remarks today (28) in Parliament while delivering the response speech as the Minister of Defence during the Committee Stage Debate of the 2025 Budget, addressing the expenditure heads of the Ministry of Defence, the Ministry of Public Security, and the Ministry of Parliamentary Affairs.",
    "He firmly stated that his government would never leave room for the opposition to realize their dream of toppling the government, whether by creating an illusion of economic collapse, fabricating a security crisis, or inciting public unrest.",
    "Furthermore, he asserted that the current administration has ended the era of inhumanity and is paving the way for a more disciplined and principled governance. The President challenged the opposition to surpass the standards set by the present government, warning that failure to do so would render them political fossils stuck in out-dated politics.",
    "He also made it clear that no criminal gangs operating within the hidden criminal underworld would receive any protection or endorsement from members of the current government.",
    "President Anura Kumara Dissanayake affirmed that the Sri Lanka Army and Police would be restructured into fully professional institutions. He emphasized that all appointments and transfers within the security forces have been conducted without favouritism or political influence.",
    "He further stated that the former Chief of Defence Staff had been granted seven service extensions. However, as key positions cannot be assigned based on personal relationships or favouritism, new appointments have been made to ensure a fresh and merit-based approach.",
    "The President underscored that the current government is committed to building a military that is loyal to the state rather than individuals and to enhancing its professionalism.",
    "He also stated that the government is taking all possible measures to ensure justice and fairness for crimes that have been buried by the passage of time.",
    "Highlighting the importance of trust in the structure of the security sector, the President noted that the current government is working to restore discipline and integrity to the state, which has deteriorated to its deepest level.",
    "The President declared that the opposition’s aspiration to attain power through the creation of an economic crisis has now come to a conclusion. He further expressed scepticism regarding the opposition’s current efforts to seize power by inciting a national security crisis.",
    "The President revealed that an investigation into the five recent crimes that occurred this month indicated they were committed by five criminal gangs. He further stated that, during the investigation, the direction of the inquiry is being directed towards identifying the perpetrators. There is suspicion that multiple gangs operated simultaneously, raising concerns of a possible conspiracy. The President mentioned that once these conspiracies are identified, the government will take steps to suppress them. He emphasized that the era of transferring governmental power through conspiracies has come to an end, and that it is possible to form a government based on civility and proper conduct.",
    "The President further stated that state institutions and political authorities are working towards building a society free from criminal gangs.",
    "The President stated that the current budget includes proposals to increase allowances for foreign training for the defence sectors. Provisions have been allocated for the purchase of necessary aircrafts for the Air Force and, the Navy, and plans are in place to allocate Rs. 1,000 million for providing facilities to the Sri Lanka Police. Additionally, funds have been set aside for new recruitments in the tri-forces and the police. The budget includes provisions for the recruitment of 10,000 personnel each for the Air Force and the Police."
  ]
}