{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-09-c53f38",
  "num": "c53f38",
  "date_str": "2025-05-09",
  "description": "Students of Gonagala Maha Vidyalaya and Dedigama Perakumba…",
  "url_metadata": "https://pmd.gov.lk/news/students-of-gonagala-maha-vidyalaya-and-dedigama-perakumba-vidyalaya-visit-the-presidents-house/",
  "lang": "en",
  "article_title": "Students of Gonagala Maha Vidyalaya and Dedigama Perakumba Vidyalaya Visit the President’s House",
  "article_body_paragraphs": [
    "Students from Gonagala Maha Vidyalaya in the Ampara District and Dedigama Parakumba Maha Vidyalaya in the Kegalle District had the opportunity today (09) to take part in the ‘Vision’ programme organized by the Presidential Secretariat, as part of their educational tour.",
    "Implemented jointly by the Presidential Secretariat, the Ministry of Education and the Parliamentary Department of Communication, this programme offers schoolchildren a chance to visit and gain insights into the Presidential Secretariat, the President’s House, the Colombo Port City and the Parliament, in alignment with their academic interests.",
    "During the visit, school shoes were also donated to the students, with the full sponsorship of D. Samson Group.",
    "In parallel with the programme, the students were educated about the ‘Clean Sri Lanka’ initiative and its core conceptual values.",
    "Highlighting the significance of environmental conservation, Secretary to the President Dr. Nandika Sanath Kumanayake presented valuable saplings to the schools as symbolic gifts. He also engaged in a cordial discussion with the students.",
    "The event was also attended by Senior Additional Secretary to the President K.M.N. Kumarasinghe, Presidential Legal Advisor Attorney-at-Law J.M. Wijebandara, Director of Tri-Forces Coordination Air Commodore Asiri Gallage, Assistant Director Major Nadeeka Dangolla, as well as principals and teachers from the respective schools."
  ]
}