{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-10-04-a1f460",
  "num": "a1f460",
  "date_str": "2024-10-04",
  "description": "President Dissanayake Reaffirms Commitment to IMF Objectives, Advocates…",
  "url_metadata": "https://pmd.gov.lk/news/president-dissanayake-reaffirms-commitment-to-imf-objectives-advocates-for-alternative-solutions-to-ease-the-burden-on-people/",
  "lang": "en",
  "article_title": "President Dissanayake Reaffirms Commitment to IMF Objectives, Advocates for Alternative Solutions to ease the burden on people",
  "article_body_paragraphs": [
    "In a significant meeting today, President Anura Kumara Dissanayake engaged directly with IMF delegation included Director of the Asia Pacific Department, Krishna Srinivasan and Senior\nMission Chief Dr. Peter Breuer to discuss the progress of Sri Lanka’s on-going IMF programme.",
    "The President was accompanied by key Sri Lankan officials, including Central Bank Governor Dr.Nandalal Weerasinghe, Secretary to the Treasury Mr. Mahinda Siriwardena, Dr. Harshana Sooriyapperuma, Senior Advisors to the President Prof. Anil Jayantha and Mr. Duminda Hulangamuwa.",
    "President Dissanayake reaffirmed the government’s broad agreement in principle with the objectives of the IMF programme but emphasized the importance of achieving these objectives through\nalternative means that relieves the burden off the people. The President stated that the government plans to provide relief to those who are struggling due to high VAT and income taxes.",
    "The IMF appreciated President Dissanayake’s willingness to commit to the programme’s goals and agreed to discuss the alternative approaches proposed by the Sri Lankan government.",
    "Additionally, the two parties discussed the initiation of the third review of the programme. While there have been delays due to upcoming General Elections, President Dissanayake assured the IMF of the government’s dedication to continuing the programme without disruption and facilitating the third review process."
  ]
}