{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-04-en-dc7716",
  "num": "en-dc7716",
  "date_str": "2025-06-04",
  "description": "“Beautiful Coastline – Attractive Destination”: Coastal Caretaker Appointment…",
  "url_metadata": "https://pmd.gov.lk/news/beautiful-coastline-attractive-destination-coastal-caretaker-appointment-programme-launches/",
  "lang": "en",
  "article_title": "“Beautiful Coastline – Attractive Destination”: Coastal Caretaker Appointment Programme Launches",
  "article_body_paragraphs": [
    "A special initiative to appoint individuals as caretakers of coastal areas adjoining tourist hotels was launched this morning (04) at the premises of the Habaraduwa Divisional Secretariat. The project aims to preserve the cleanliness and natural beauty of beach zones adjacent to tourism establishments.",
    "As part of this initiative, a Memorandum of Understanding (MoU) was signed between the Marine Environment Protection Authority (MEPA) and the relevant tourist hotels. Under this agreement, a local resident will be appointed to maintain each designated beach area and will receive a stipend in recognition of their service.",
    "The project is implemented under the “Clean Sri Lanka” programme, under the theme “Beautiful Coastline Attractive Tourist Destination” and involves collaboration among government, private sector and civil society stakeholders.",
    "Preserving the cleanliness of coastal areas across the island plays a vital role in the growth of the tourism industry. Furthermore, this effort contributes to Sri Lanka’s pursuit of international environmental recognition through the globally acknowledged Blue Flag certification, an important component of marine conservation planning.",
    "The event was attended by Chairman of the Habaraduwa Pradeshiya Sabha Mr. Harsha B. Punchihewa, Secretary to the Governor of the Southern Province Mr. Indika Samarakoon and Additional District Secretary of Galle Ms. Ayesha Kariyawasam."
  ]
}