{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-02-27-en-42d119",
  "num": "en-42d119",
  "date_str": "2025-02-27",
  "description": "Allocate Rs. 1,400 billion in recurrent expenditure to…",
  "url_metadata": "https://pmd.gov.lk/news/allocate-rs-1400-billion-in-recurrent-expenditure-to-productive-projects-over-the-next-8-months/",
  "lang": "en",
  "article_title": "Allocate Rs. 1,400 billion in recurrent expenditure to productive projects over the next 8 months.",
  "article_body_paragraphs": [
    "• The responsibility of revitalizing both the economy and the fractured social fabric falls on everyone.",
    "– President instructs the District Secretaries",
    "President Anura Kumara Disanayake directed the District Secretaries to allocate Rs. 1,400 billion in recurrent expenditure for the implementation of productive projects at the grassroots level over the next eight months.",
    "The President made these remarks during a discussion held with the District Secretaries, today (27) at the Presidential Secretariat.",
    "The President also emphasized that by developing the rural economy, the country’s economic growth could be elevated by 3% to 4%. He stressed the need to enhance existing economic opportunities and identify new sources of growth during the expansion of the economy to rural areas.",
    "The pension schemes proposed in the 2025 budget were also deliberated upon during this meeting.",
    "Moreover, the President pointed out that there is a prevailing negative perception of the public sector and that inefficiency within government services has contributed to this situation. He underscored the necessity of creating satisfied and effective government officials, and emphasized the need to improve the efficiency of public services.",
    "Currently, 30,000 vacancies have been identified within the public service, and the President stated that the government plans to recruit for these positions in categories, which would complete the mid-level staffing of the public service.",
    "The President emphasized that development is not limited to constructing buildings and bridges but also involves uplifting the fractured social structure, a responsibility that primarily lies with the District Secretaries.",
    "Additionally, the District Secretaries raised issues specific to their districts, which were brought to the President’s attention, and extensive discussions were held on possible solutions and proposals.",
    "The meeting was attended by the Minister of Public Administration, Provincial Councils and Local Government, Dr. Chandana Abeyratne; Secretary to the President, Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Public Administration Alok Bandara, as well as the District Secretaries."
  ]
}