{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-21-2025-08-21-4a385e",
  "num": "2025-08-21-4a385e",
  "date_str": "2025-08-21",
  "description": "Environment Pioneers Awarded Presidential Medals",
  "url_metadata": "https://pmd.gov.lk/news/environment-pioneers-awarded-presidential-medals/",
  "lang": "en",
  "article_title": "Environment Pioneers Awarded Presidential Medals",
  "article_body_paragraphs": [
    "The ‘Environment Pioneer President’s Medal Awarding Ceremony – 2025’ was held this morning (21) at the Bandaranaike Memorial International Conference Hall in Colombo, under the patronage of President Anura Kumara Dissanayake.",
    "The event, jointly organised annually by the Central Environmental Authority and the Ministry of Education, recognises and appreciates students with exceptional knowledge of environmental conservation and management by presenting them with Presidential Medals.",
    "At this year’s ceremony, the 11th of its kind, 192 Environment Pioneers were awarded Presidential Medals by President Anura Kumara Dissanayake.",
    "Teachers who had trained schoolchildren as Environment Pioneers were also felicitated at the occasion.",
    "A special commemorative publication prepared for the ‘Environment Pioneer President’s Medal Awards Ceremony – 2025’ was also presented to the President.",
    "Addressing the gathering, Minister of Environment Dammika Patabendi stated that today the entire world is facing the adverse consequences of environmental pollution. He noted that the destruction of the environment, which earlier generations did not experience, has been brought about by human activity and it is now the responsibility of everyone to reverse this damage and create a healthier environment for all living beings.",
    "The Minister further pointed out that the present government’s policy statement places significant emphasis on environmental protection and has already introduced a number of related programmes. Among them, he highlighted the Clean Sri Lanka initiative, which has now been launched in full force.",
    "He stressed that the government, under the leadership of the President, prioritises advancing people’s lives while maintaining a balance between nature and development. The Minister urged all medal recipients to act as strong guardians in this mission, working to ensure that future generations inherit a greener and healthier environment than the one we live in today.",
    "The event was also attended by Deputy Minister of Environment Anton Jayakody; Deputy Minister of Education and Higher Education Madhura Seneviratne; Secretary to the Ministry of Environment K.R. Uduwawala; Secretary to the Ministry of Education and Higher Education Nalaka Kaluwewa; Chairman of the Central Environmental Authority Prof. Tilak Hewawasam; its Director General, Padmasiri Moonamale; provincial directors of education; school principals; and other distinguished guests."
  ]
}