{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-04-en-254821",
  "num": "en-254821",
  "date_str": "2025-04-04",
  "description": "National New Paddy Harvest Festival under the Patronage…",
  "url_metadata": "https://pmd.gov.lk/news/national-new-paddy-harvest-festival-under-the-patronage-of-the-president/",
  "lang": "en",
  "article_title": "National New Paddy Harvest Festival under the Patronage of the President",
  "article_body_paragraphs": [
    "– President",
    "The National New Paddy Harvest Festival (Aluth Sahal Mangalya), a traditional annual ceremony of offering the first portion of the freshly harvested Maha season paddy to the sacred Sri Maha Bodhi, was held this morning (04) under the patronage of President Anura Kumara Disanayake at the historic Sri Maha Bodhi premises in Anuradhapura.",
    "The 58th edition of the National New Paddy Harvest Festival was organized by the Ministry of Agriculture and the Department of Agrarian Services under the theme “In unison, let us cultivate the land, to build a self-sufficient nation” (අහරින් ස්වයංපෝෂිත දැයක් තනන්නට එක මිටට ගොවි බිමට), following the guidance of the Atamasthanadhipathi, the Most Venerable Pallegama Hemarathana Nayaka Thera.",
    "This ritual, which dates back to the era of ancient monarchs, saw the participation of farmers from across the country. In accordance with tradition, they prayed for timely rains and fertile fields and invoked blessings for a self-sufficient and prosperous economy through agriculture.",
    "President Anura Kumara Disanayake first paid homage and received blessings from the sacred Jaya Sri Maha Bodhi before joining the ceremonial proceedings.",
    "The sacred procession, which carried the newly harvested paddy from near the historic Sinha Kanuwa in Anuradhapura, arrived at the sandy courtyard (වැලි මලුව) of the Sri Maha Bodhi, marking the ceremonial commencement of the New Paddy Harvest Festival.",
    "The Most Venerable Pallegama Hemarathana Nayaka Thera commenced the ritual by filling the golden bowl with the new paddy, after which representatives from all provinces added paddy from their respective regions, symbolically filling the golden bowl.\nPresident Anura Kumara Disanayake also participated in this ritualistic moment, amidst the chanting of Pirith by the Maha Sangha.",
    "A vessel of pure bee honey, traditionally offered to the Sri Maha Bodhi, was ceremonially presented to the President by Deputy Leader of the Vedda Community W.U. Bandiyala Eththo.",
    "The vessel of ghee, brought from the historic Saman Devalaya in Sabaragamuwa, was also presented to President Anura Kumara Disanayake, to be used in the customary ghee offering at the Sri Maha Bodhi.",
    "The President also received the commemorative plaque of the 58th National New Paddy Harvest Festival and presented tokens of appreciation to farmer leaders who have made significant contributions to the development of the country’s agriculture sector.",
    "As part of the initiative to secure a pest-free harvest, the President participated in the distribution of pest-resistant seed paddy to farming communities across the provinces.",
    "Addressing the subsequent official ceremony, President Anura Kumara Disanayake stated that the current government is working to transform an economy that was in disarray. He noted that the Paddy Marketing Board is burdened with a debt of Rs. 28 billion, while harvested paddy is being left to spoil in storage.",
    "The President emphasized that the current administration has accepted the responsibility of restoring and restructuring this disordered system. He added that the government expects the support not only of the state machinery related to agriculture but also of all farming communities. He affirmed the intention to integrate Sri Lanka’s cultural and traditional systems to reclaim the legacy of the agricultural economy and thereby strengthen the national economy.",
    "President Disanayake further stated that the country’s ancient kings achieved greatness through their contributions to agriculture and irrigation and that self-sufficiency in food was a critical factor in that success.\nHe highlighted that sustainable development has become a global discourse today and that Sri Lanka’s “Tank Cascade System” or “Vapi System,” stands as a remarkable example of sustainable development. The country’s irrigation system, which dates back nearly 2,000 years, continues to contribute to the advancement of agriculture even today.",
    "As such, the government has allocated Rs. 2 billion in the current budget to rehabilitate the irrigation system and renovation work on the North Central Maha Ela Project has already commenced to revitalize the country’s agricultural industry. He added that the government also plans to develop seed farms to produce self-sufficient seeds, while protecting genetic ownership.",
    "He further emphasized the need for fair prices for agricultural produce, both for farmers and consumers. Due to long-standing market distortions, the government will intervene over the next two to three harvesting seasons to ensure both parties receive fair prices.",
    "The President also stated that the necessary provisions for such state interventions have been made in the current budget. Steps have been taken to create storage capacity to hold 300,000 metric tons of paddy, which is expected to mitigate market distortions going forward.",
    "Among those present at the occasion were the Chief Incumbent of the Ruwanweliseya and Chancellor of the Rajarata University, Most Venerable Ithalawetunuwewe Gnanatillake Thera, the Chief Incumbent of the Lankaramaya, Most Venerable Ralapanawa Dhammajothi Thera and members of the clergy; Minister of Agriculture, Livestock, Lands and Irrigation K.D. Lalkantha; Minister of Trade, Commerce, Food Security and Cooperative Development Wasantha Samarasinghe; Governor of the North Central Province Wasantha Kumara Wimalasiri; and Deputy Minister of Agriculture and Livestock Namal Karunaratne, along with a large number of farmer leaders and other dignitaries."
  ]
}