{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-09-01-2025-09-01-923779",
  "num": "2025-09-01-923779",
  "date_str": "2025-09-01",
  "description": "Third Phase of Development of the Myliddy Fisheries…",
  "url_metadata": "https://pmd.gov.lk/news/third-phase-of-development-of-the-myliddy-fisheries-harbour-in-jaffna-commences-under-the-presidents-patronage/",
  "lang": "en",
  "article_title": "Third Phase of Development of the Myliddy Fisheries Harbour in Jaffna Commences under the President’s Patronage",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake stated that it is the responsibility of the government to provide the necessary facilities for the fishing community and that steps are being taken to develop the fisheries harbour in the North in order to provide such facilities and resolve the issues faced by fishing community.",
    "He made these remarks this morning (01) while attending the inauguration of the third phase of the Myliddy Fisheries Harbour Development Project in Jaffna.",
    "The President further noted that although previous governments acted with the expectation of war, the present government is working with the aim of ensuring that no form of war will ever recur in this country and to build peace and harmony within the nation. He also stated that every plot of land in the North, which was acquired for the security forces during the war, will be released back to the people.",
    "Emphasising further, the President said the government is committed to safeguarding the surrounding seas, islands and landmass of the country for the benefit of the people and will not allow any external force to exert influence in this regard.",
    "The symbolic inauguration of the third phase of the Myliddy Fisheries Harbour Development Project was carried out by the President.",
    "Under this phase, essential facilities such as water, electricity, fuel, cold storage, net-mending centres, auction halls and radio communication centres will be provided not only for the fishing community of the Northern Province but also for fishing boats arriving from the Eastern and Southern Provinces. The government has allocated Rs. 298 million for this purpose in the current year.",
    "Minister of Fisheries, Aquatic and Ocean Resources Ramalingam Chandrasekar, Deputy Minister of Public Security and Parliamentary Affairs Sunil Watagala, Deputy Minister of Land and Irrigation Susil Ranasinghe, Members of Parliament, Northern Province Governor Nagalingam Vethanayahan, Secretary to the Ministry of Fisheries, Aquatic and Ocean Resources, as well as officials of the Northern Provincial Council, senior defence officers and others were present at the occasion."
  ]
}