{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-01-27-en-18c4c0",
  "num": "en-18c4c0",
  "date_str": "2025-01-27",
  "description": "President’s Fund to Provide Services at the Regional…",
  "url_metadata": "https://pmd.gov.lk/news/presidents-fund-to-provide-services-at-the-regional-level-starting-from-february-7/",
  "lang": "en",
  "article_title": "President’s Fund to Provide Services at the Regional Level Starting from February 7",
  "article_body_paragraphs": [
    "In an effort to provide more efficient services to the public, the President’s Fund is set to launch a new initiative to deliver services at the regional level through the offices of the Divisional Secretaries, under the leadership of President Anura Kumar Disanayake on February 7 at the Temple Trees, Colombo.\nPreviously, the official work of the President’s Fund was limited to the Colombo area. However, under the new plan, these services will be extended nationwide through 341 sub-offices established at Divisional Secretary offices across the country.\nThe relevant pilot projects for five selected Divisional Secretary offices are already operational, and the full-scale implementation of the new service model will begin nationwide on February 7.\nThis initiative was announced during a virtual meeting held today (25) at the President’s Office to brief Divisional Secretaries about the new approach to the President’s Fund’s services.\nSecretary of the President’s Fund and the Senior Additional Secretary to the President, Roshan Gamage, highlighted that the new digitalization and networking plan aims to provide more efficient and effective services to the public.\nThrough this system, anyone can request financial assistance related to their disease at their local Divisional Secretary office, and the necessary documentation can be submitted there as well.\nDuring the discussion, Divisional Secretaries were informed about the procedures for selecting patients, preparing the necessary documents and the responsibilities of the President’s Fund.",
    "Previously, the official work of the President’s Fund was limited to the Colombo area. However, under the new plan, these services will be extended nationwide through 341 sub-offices established at Divisional Secretary offices across the country.",
    "The relevant pilot projects for five selected Divisional Secretary offices are already operational, and the full-scale implementation of the new service model will begin nationwide on February 7.",
    "This initiative was announced during a virtual meeting held today (25) at the President’s Office to brief Divisional Secretaries about the new approach to the President’s Fund’s services.",
    "Secretary of the President’s Fund and the Senior Additional Secretary to the President, Roshan Gamage, highlighted that the new digitalization and networking plan aims to provide more efficient and effective services to the public.",
    "Through this system, anyone can request financial assistance related to their disease at their local Divisional Secretary office, and the necessary documentation can be submitted there as well.",
    "During the discussion, Divisional Secretaries were informed about the procedures for selecting patients, preparing the necessary documents and the responsibilities of the President’s Fund."
  ]
}