{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-18-en-65cde1",
  "num": "en-65cde1",
  "date_str": "2025-05-18",
  "description": "Decentralization of the President’s Fund at Divisional Level…",
  "url_metadata": "https://pmd.gov.lk/news/decentralization-of-the-presidents-fund-at-divisional-level-proves-successful/",
  "lang": "en",
  "article_title": "Decentralization of the President’s Fund at Divisional Level Proves Successful",
  "article_body_paragraphs": [
    "• Remain Committed to Expanding the Services of the President’s Fund for Underprivileged Patients\n– Secretary to the President",
    "A special training workshop was held today (17) at the President’s Media Centre (PMC) for officials in charge of implementing activities related to the President’s Fund across Divisional Secretariats in the Western Province.",
    "The programme aimed to further enhance the decentralization of the services of the President’s Fund at the divisional level. This workshop brought together subject officers from all Divisional Secretariats in the Colombo, Kalutara and Gampaha districts, with a focus on strengthening their practical knowledge and operational capacity in delivering services through the President’s Fund.",
    "Media Advisor to the President Mr. Chandana Sooriyabandara addressed the participants, highlighting the importance of building and maintaining strong relationships between public servants and the general public.",
    "The session also covered critical areas such as information security in the computer system, the step-by-step process of handling medical aid applications from submission to approval as well as common challenges faced by officers while operating the system. Practical and theoretical training was provided on integrating the system with the Fund’s procedures at each Divisional Secretariat.",
    "Secretary to the President Dr. Nandika Sanath Kumanayake emphasized that the primary mission of the President’s Fund is to serve the most vulnerable individuals. He noted that decentralizing operations to the Divisional Secretariat level has significantly expanded access, allowing more people to obtain assistance conveniently.",
    "Dr. Kumanayake further stated that he believes all state officials now understand the importance of this service and that the success of government programmes on behalf of the people depends on the cooperation of all stakeholders. He also stressed that the annual funds received by the President’s Fund must be directed to benefit the underprivileged, particularly patients in need of medical aid and urged continued commitment to expanding these services.",
    "At present, more than a thousand applications have been registered in the President’s Fund computer system through Divisional Secretariat offices, with approximately 40% of these applications being submitted via the Divisional Secretariats in the Western Province, stated the Secretary of the President’s Fund and Senior Additional Secretary to the President Mr. Roshan Gamage.",
    "Mr. Roshan Gamage further highlighted since the commencement of the decentralization of the President’s Fund to the Divisional Secretariat offices on 7th February 2025, approximately 80% of the applications currently being received have come through these Divisional Secretariat offices.",
    "The workshop concluded with the presentation of certificates of appreciation to participating officers from the Divisional Secretariats.",
    "Senior Assistant Secretaries to the President, Mr. P.H. Kolambage and Mr. P.R. Prasad Perera, Chief Accountant of the President’s Fund Mr. D.A.M. Wickramaratne, Assistant Secretary to the President Ms. Ushani Rathnayake and staff of the President’s Fund were present at the occasion."
  ]
}