{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-15-en-ee7a99",
  "num": "en-ee7a99",
  "date_str": "2025-06-15",
  "description": "Concurrent with Poson Week, numerous Clean Sri Lanka…",
  "url_metadata": "https://pmd.gov.lk/news/concurrent-with-poson-week-numerous-clean-sri-lanka-initiatives-were-implemented-in-anuradhapura/",
  "lang": "en",
  "article_title": "Concurrent with Poson Week, numerous Clean Sri Lanka initiatives were implemented in Anuradhapura",
  "article_body_paragraphs": [
    "Aligned with the 2025 National Poson Festival, the Clean Sri Lanka Secretariat spearheaded several environmentally conscious initiatives during Poson Week, including maintaining cleanliness in areas surrounding the Atamasthana (Eight Sacred Places). Key waste management measures included the establishment of permanent, covered enclosures for biodegradable and non-biodegradable waste receptacles near the Atamasthana and Mihintale. Dedicated plastic bottle collection bins were strategically placed alongside general waste bins and in collaboration with Ceypetco, discarded barrels were repurposed as waste containers.",
    "Sites for these facilities have already been identified, with construction and the installation of secure covers for 20 waste collection points around the Sacred City scheduled for completion within the month.",
    "Significant support came from sponsors including the Irrigation Department, ARPICO, Rambewa Mechanical Engineering Works, the Cargills and Keells Group (for plastic containers), Coca-Cola Beverages Sri Lanka (for plastic collection bins), and Ceypetco and the Sri Lanka Army (for waste bins).",
    "Additional safety and awareness initiatives included placing waste bins near bathing areas and bridges adjacent to major reservoirs (Tissa Wewa, Basawakkulama Wewa, Nuwara Wewa, Mahakanadarawa Wewa, Nachchaduwa Wewa, Bulankulama Wewa and Kunchikulama Wewa) to reduce littering. Warning signs were installed at hazardous locations and lifesaving personnel and naval craft were deployed during the Poson Week.",
    "Waste bins for bridge areas were supplied by Phoenix Industries and ARPICO, while informational signage around the Sacred City was sponsored by AIA, Ceylinco and Sri Lanka Insurance. Overall coordination was managed by the Anuradhapura Municipal Commissioner.",
    "A Clean Sri Lanka coordination centre established within the Poson Zone facilitated awareness programmes for schoolchildren and the general public on themes such as environmental stewardship and intergenerational responsibility. These efforts involved Provincial and District Secretaries and institutions including the Post-Harvest Technology Institute.",
    "Additional programmes targeting public officials and citizens focused on national food security, financial literacy and ethical public service.",
    "Environmental sustainability projects carried out during the week included canal cleaning in collaboration with the Irrigation Department, Provincial Irrigation Department and the Department of Agrarian Development and a tree-planting initiative titled “Environmental Security” in partnership with the Forest Conservation Department and school communities.",
    "Personality development and leadership workshops were also conducted. A full-day session was held on 7 June 2025 at St. Thomas’ College, Anuradhapura (7:30 AM to 7:30 PM), sponsored by Perera & Sons, the Anuradhapura Lions Club and the Dream Force Sri Lanka Society. Similar workshops were conducted at Maitripala Senanayake Vidyalaya and Swarnamali Balika Vidyalaya, with participants also presenting a devotional song concert.",
    "On 11 June 2025, a morning awareness session for rural farmers was held, covering Post-Harvest Technology (presented by Mr. C.R. Gunawardana, National Post-Harvest Management Institute) and Financial Management (presented by Mr. Duminda Disanayake, Central Bank of Sri Lanka), featuring a special address by MP Susantha Kumara Navaratne.",
    "On the morning of 12 June 2025, the Clean Sri Lanka Secretariat and the Anuradhapura Municipal Council jointly conducted a waste removal drive at the Basawakkulama Wewa tank bund, extracting plastic, polythene and other refuse. Participants included venerable monks from the Sri Lanka Bhikkhu University Bhikkhu Student Association, Anuradhapura Mayor Mr. N. Karunaratne, the Association President and lay devotees. That afternoon, the Secretariat’s Music Therapy programme began at the Surapura Open Air Theatre, Anuradhapura, attended by over a thousand personnel from the armed forces, police, Civil Security Department and state institutions.",
    "A special lecture was also delivered by Clinical Psychologist Dr. Madhura Gunawardana."
  ]
}