{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-02-10-en-33c532",
  "num": "en-33c532",
  "date_str": "2025-02-10",
  "description": "A Robust Data System is Essential for a…",
  "url_metadata": "https://pmd.gov.lk/news/a-robust-data-system-is-essential-for-a-strong-food-security-policy-framework/",
  "lang": "en",
  "article_title": "A Robust Data System is Essential for a Strong Food Security Policy Framework",
  "article_body_paragraphs": [
    "Minister of Trade, Commerce, Food Security, and Cooperative Development Wasantha Samarasinghe, along with members of the Food Policy and Security Committee, convened for the second time today (10) at the Presidential Secretariat. During the discussion, the critical need for a robust data system to support policy decisions on ensuring food security was strongly emphasized.",
    "The primary objective of the committee is to implement measures ensuring a safe, healthy, and sustainable food system for all citizens, in line with the government’s food security policy.",
    "It was underscored that accurate data and information are crucial for making informed policy decisions on food security. The government is not willing to continue making decisions without reliable data, and priority will be given to establishing a comprehensive and accurate food information system.",
    "Key concerns discussed included ensuring the uninterrupted supply of essential food items during the Sinhala and Tamil New Year season and maintaining price controls on these goods.",
    "A significant portion of the discussion was dedicated to the paddy purchasing process, particularly the loan facilities provided to mill owners for purchasing paddy. The necessity of conducting a thorough review of the quantities purchased under these loan schemes was also emphasized.",
    "The meeting also focused on expanding the Cooperative and ‘Sathosa’ networks to provide essential goods at affordable prices to consumers. Additionally, strategies were discussed to regulate prices and create a consumer-friendly market.",
    "Minister Samarasinghe also highlighted the importance of studying national food consumption patterns to promote better public health and reduce food waste. He instructed the committee members to take necessary steps to address these concerns.",
    "Several key areas were also discussed, including developing a National Food Security Policy Framework, maintaining an essential food information system, introducing a new program based on internationally recognized standards and increasing local production and distribution through scientific evidence-based strategies. The meeting further addressed food security, food pricing, and market management.",
    "Among the attendees were Secretary to the Prime Minister, G.P. Saputhanthri, Senior Additional Secretary to the President, Kapila Janaka Bandara, and other Secretaries from relevant ministries, who also serve as members of the Food Policy and Security Committee."
  ]
}