{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-29-2025-08-29-a4e687",
  "num": "2025-08-29-a4e687",
  "date_str": "2025-08-29",
  "description": "President leads 2026 Pre-Budget Discussion with Private Sector…",
  "url_metadata": "https://pmd.gov.lk/news/president-leads-2026-pre-budget-discussion-with-private-sector-stakeholders-in-the-tourism-industry/",
  "lang": "en",
  "article_title": "President leads 2026 Pre-Budget Discussion with Private Sector Stakeholders in the Tourism Industry",
  "article_body_paragraphs": [
    "“Invest in converting President’s Houses in Tourist Zones into Holiday Resorts” – President",
    "A discussion on the 2026 Pre-Budget for the tourism sector with private sector stakeholders was held this afternoon (29) at the Presidential Secretariat, under the patronage of President Anura Kumara Dissanayake.",
    "The President pointed out that mere promotional programmes would not suffice to achieve the expected targets of the tourism sector for 2026. He emphasised the need for a new strategic programme jointly implemented by both the public and private sectors.",
    "Inviting entrepreneurs to invest in transforming President’s Houses and Ministers’ official bungalows located in areas such as Nuwara Eliya, Anuradhapura, Mahiyanganaya and Kataragama into comfortable holiday resorts targeting foreign tourists, the President announced that a formal programme in this regard would be launched in the near future.",
    "During the discussion, business leaders highlighted the existing shortcomings and challenges in the tourism industry. The President also requested entrepreneurs to present their proposals for the advancement of the sector.",
    "Among those present were Secretary to the Ministry of Finance Dr. Harshana Suriyapperuma, Senior Economic Adviser to the President Duminda Hulugamuwa, Senior Additional Secretary to the President Russell Aponsu, Chairman of the Sri Lanka Tourism Development Authority Buddhika Hewawasam and Chairman of the Export Development Board Mangala Wijesinghe, along with a number of private sector stakeholders and business representatives."
  ]
}