{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-11-05-en-8ade71",
  "num": "en-8ade71",
  "date_str": "2024-11-05",
  "description": "Ways of the public service must change to…",
  "url_metadata": "https://pmd.gov.lk/news/ways-of-the-public-service-must-change-to-achieve-government-objectives/",
  "lang": "en",
  "article_title": "Ways of the public service must change to achieve government objectives",
  "article_body_paragraphs": [
    "– says the President at the Sri Lanka Administrative Service Association meeting",
    "President Anura Kumara Dissanayake stated that rural development and upgrading the rural people’s social and economic well-being is one of the primary objectives of the government during this term.",
    "The President expressed these views during a discussion held today (05) at the Presidential Secretariat with members of the Sri Lanka Administrative Service Association (SLAS).",
    "The President highlighted the necessity of public officials cooperating with the government to successfully implement government initiatives, noting that the experiences of government officials is valued and instrumental to implement government policy.",
    "The President pointed out that there is a gap between the government’s objectives and the traditional operational modalities of the public service. To ensure the effectiveness of government programs aimed at national development, he stated that the functioning of public administration also has to change.",
    "President Dissanayake highlighted that combating fraud and corruption is a top priority for the government, stating that failures to implement projects with attention have caused significant damage to the country’s economy.",
    "He also emphasized that the political leadership will not interfere in the public service protecting their capacity to operate independently.",
    "President Dissanayake mentioned that government officials have a unique responsibility to play in regional development and stressed the need to minimize unnecessary expenses in the public service without cutting public services.",
    "The event was attended by members of the Sri Lanka Administrative Services Association, including President Mahesh Gammanpila and Secretary Jayaveera Fernando."
  ]
}