{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-15-44821d",
  "num": "44821d",
  "date_str": "2025-05-15",
  "description": "Vesak Celebrations Continue for Third Day at Presidential…",
  "url_metadata": "https://pmd.gov.lk/news/vesak-celebrations-continue-for-third-day-at-presidential-secretariat-premises/",
  "lang": "en",
  "article_title": "Vesak Celebrations Continue for Third Day at Presidential Secretariat Premises",
  "article_body_paragraphs": [
    "The third day of Vesak festivities, organised at the Presidential Secretariat premises by the Gangaramaya Temple, Hunupitiya, in collaboration with the Presidential Secretariat and the Prime Minister’s Office, commenced yesterday (14) at 6:30 PM under the patronage of Prime Minister Dr. Harini Amarasuriya and Speaker Jagath Wickramaratne. The event, part of the “Buddha Rashmi” Vesak Zone, featured the “Vesak Bathi Gee Saraniya” programme, blending spiritual and cultural performances.",
    "The third day’s celebrations included a musical performance by the Sri Lanka Police Band and devotional songs by renowned artists such as Ilyas Beg, Iman Perera, Buddika Ushan and the Sri Lanka Police Choir. A vibrant Vesak lantern exhibition was also held at the Presidential Secretariat premises, drawing crowds from across the city.",
    "The Bhakthi Gee programme will conclude today (15 May), while food stalls and ice cream stalls, set up near the Presidential Secretariat for visitors arriving in Colombo to witness Vesak festivities, will remain operational until 16 May.",
    "In tandem with the “Buddha Rashmi” and “Bauddhaloka” Vesak Zones, the Presidential Secretariat has supported a series of Vesak-themed events in the surrounding area. These include illuminated buildings, streets adorned with decorative electric lights, lantern displays and other cultural activities organised with the participation of the Presidential Secretariat staff.",
    "The celebrations reflect Sri Lanka’s rich Buddhist heritage, fostering community spirit and reverence during the sacred Vesak period."
  ]
}