{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-03-20-en-a90185",
  "num": "en-a90185",
  "date_str": "2025-03-20",
  "description": "The President Meets with the PSUNU",
  "url_metadata": "https://pmd.gov.lk/news/the-president-meets-with-the-psunu/",
  "lang": "en",
  "article_title": "The President Meets with the PSUNU",
  "article_body_paragraphs": [
    "• Health professionals’ strikes are unacceptable despite the highest salary increase given by a government in history\n– President",
    "President Anura Kumara Disanayake stated that the trade union actions by healthcare professionals cannot be justified, considering that the largest salary increase in history granted by a government without any demands or pressure from professional associations has already been implemented.",
    "The President made these remarks during a meeting held today (19) at the Presidential Secretariat with the Public Services United Nurses Union (PSUNU).",
    "President Anura Kumara Disanayake highlighted that despite operating within a constrained economic framework, the government has prioritized increasing the basic salaries of public sector employees in this year’s budget. This initiative aims to enhance the efficiency of the public service, attract skilled professionals, and ensure the sustainability of the sector.",
    "The President stated that salaries have been increased under six key categories in the budget. These include a minimum increase of Rs. 15,000 in the basic salary, an increment in overtime and holiday allowances, an 80% increase in salary increments, an upward revision of pension benefits in line with the revised total salary, and an increase in the taxable income threshold.",
    "Officials from the PSUNU expressed their appreciation for the salary increments, highlighting that they have been well received by a significant portion of the public sector workforce. They also brought to the President’s attention the existing challenges within the nursing profession and requested prompt solutions to address these issues.",
    "The meeting was attended by the Chancellor of the University of Colombo, Chief Sanganayaka of Western Province, the Chairman of PSUNU Most Ven. Muruththettuwe Ananda Thera, Minister of Health and Mass Media Dr. Nalinda Jayatissa, Secretary to the President Dr. Nandika Sanath Kumanayake along with several officials from the PSUNU."
  ]
}