{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-06-83b16e",
  "num": "83b16e",
  "date_str": "2025-04-06",
  "description": "President and Indian Prime Minister Jointly Inaugurate Upgraded…",
  "url_metadata": "https://pmd.gov.lk/news/president-and-indian-prime-minister-jointly-inaugurate-upgraded-maho-omanthai-railway-line-maho-anuradhapura-railway-signalling-system/",
  "lang": "en",
  "article_title": "President and Indian Prime Minister Jointly Inaugurate Upgraded Maho-Omanthai Railway Line & Maho-Anuradhapura Railway Signalling System",
  "article_body_paragraphs": [
    "The upgraded Maho–Omanthai railway line and newly installed Maho–Anuradhapura railway signalling system were officially inaugurated today (06) by President Anura Kumara Disanayake and Indian Prime Minister Shri Narendra Modi.",
    "The Prime Minister of India is currently visiting Sri Lanka at the invitation of President Anura Kumara Disanayake, reinforcing the longstanding bond encapsulated in the theme “Friendship of Centuries Commitment to a Prosperous Future” between the two nations.",
    "Highlighting one of the key aspects of this visit, the two leaders participated in these inaugural ceremonies. The President and the Prime Minister of India jointly unveiled the commemorative plaque and launched the railway line and signalling system, and gave the initial signal to depart the train.",
    "The upgraded Maho-Omanthai Railway Line project was carried out with funding from the Indian Credit Line, totalling an investment of US$ 91.27 million.",
    "The Maho–Anuradhapura railway signalling system, established as a result of President Disanayake’s recent visit to India, was funded by the Indian Government amounting to USD 14.89 million.",
    "The event was attended by Minister of Foreign Affairs, Foreign Employment and Tourism Vijitha Herath, Minister of Trade, Commerce, Food Security and Cooperative Development Wasantha Samarasinghe, Minister of Health and Mass Media Dr. Nalinda Jayatissa, North Central Province Governor Wasantha Jinadasa, His Excellency Santosh Jha, High Commissioner of India to Sri Lanka and others.",
    ""
  ]
}