{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-30-791979",
  "num": "791979",
  "date_str": "2025-05-30",
  "description": "President Pledges to Fulfil His Fundamental Duty of…",
  "url_metadata": "https://pmd.gov.lk/news/president-pledges-to-fulfil-his-fundamental-duty-of-enhancing-sri-lankas-international-reputation-as-a-lawful-nation-rather-than-being-perceived-as-a-criminal-state/",
  "lang": "en",
  "article_title": "President Pledges to Fulfil His Fundamental Duty of Enhancing Sri Lanka’s International Reputation as a Lawful Nation, Rather Than being Perceived as a Criminal State",
  "article_body_paragraphs": [
    "– President at the Relic Chamber Opening at Siri Samadhi Maha Viharaya in Galkiriyagama",
    "President Anura Kumara Disanayake emphasized his unwavering commitment to fulfilling his fundamental responsibility of elevating Sri Lanka’s international standing not as a criminal state protected by political patronage, but as a well-governed and law-abiding nation.",
    "President Disanayake pointed out that although Sri Lanka is a resource-rich and naturally blessed country, previous rulers failed to lead it toward prosperity due to a lack of coherent planning. The President stressed that the current government is steadily and systematically rebuilding the national economy with a strong focus on stability and long-term development.",
    "President Anura Kumara Disanayake made these remarks this afternoon (30), while attending the religious ceremony to declare open the Relic Chamber (Dathu Mandiraya) and unveiling of the Meth Bodhisattva statue at the Siri Samadhi Maha Viharaya in Pahaminiyagama, Galkiriyagama.",
    "The President participated in the event at the invitation of the Venerable Kagama Sirinanda Thero. Following the opening of the Relic Chamber, the President had the honour of offering the first floral tribute as part of the proceedings.",
    "At the subsequent ceremony, addressing the gathering President Disanayake stated that he has never acted out of personal ambition or for positional gain. Instead, as a leader who genuinely understands the hardships faced by the people, he remains fully committed to building a prosperous nation on behalf of all citizens.",
    "The President emphasized that the government is currently working to establish the rule of law and create a common country for everyone. He assured that the responsibility of protecting future generations from drug menace is being diligently fulfilled. Furthermore, steps are being taken to strengthen the institutional framework required to combat the trafficking of illegal drugs and related crimes effectively.",
    "President Disanayake highlighted that the Maha Sangha including the religious leaders in the country, holds a significant responsibility in nurturing a healthy and compassionate citizenry essential for building the prosperous nation everyone aspires to. He acknowledged and appreciated the valuable social and religious contributions of Ven. Kagama Sirinanda Thero in this regard.",
    "The event was graced by prominent religious leaders including the Anuradhapura Atamasthanadhipathi, Chief Sanghanayaka of Nuwara Kalaviya Ven. Pallégama Hemarathana Nayaka Thera, The Tri-Nikaya Maha Sangha, led by Venerable Mahalakotwe Wimaladhamma Thero, the Chief Sangha Nayaka for the Matale District of the Malwatta Chapter of the Siam Maha Nikaya. Also present were Minister of Trade, Commerce, Food Security and Cooperative Development Wasantha Samarasinghe and Member of Parliament Thilina Samarakoon, among others."
  ]
}