{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-14-en-7e1069",
  "num": "en-7e1069",
  "date_str": "2025-04-14",
  "description": "New Year Message",
  "url_metadata": "https://pmd.gov.lk/news/new-year-message-2/",
  "lang": "en",
  "article_title": "New Year Message",
  "article_body_paragraphs": [
    "As we celebrate the Sinhala and Tamil New Year this year, a festival that symbolises the hope of both physical and spiritual renewal, our nation finds itself at a defining moment, achieving significant victories while resolutely striving towards the realisation of a better and more prosperous future.",
    "It is with profound joy and gratitude that I reflect upon the efforts undertaken by the National People’s Power government over the past months to lift our nation from adversity and steer it towards economic, social and political advancement. The successes we have thus far achieved rightfully belong to the people of this country, whose steadfast trust, as expressed in the most recent Presidential and General Elections, has been the driving force behind this transformative journey.",
    "As a responsible government, we possess the strength and determination to further deepen our commitment to the nation, even amidst formidable challenges. We are implementing well-considered plans to address the multifaceted challenges confronting our country, both in terms of national development and within the broader geopolitical landscape.",
    "The Sinhala and Tamil New Year traditions beautifully reflect the harmony between humanity and nature, bearing witness to the deep-rooted history of coexistence between our Sinhala and Tamil communities. While contemporary society may be burdened by various divisions, occasions such as the New Year provide a timely reminder of the enduring values of unity, harmony and peaceful coexistence. It is our solemn responsibility, particularly at this time of renewal, to nurture those values within ourselves and to foster a more compassionate and ethical society.",
    "Moreover, the rituals associated with the sun’s transition are underpinned by the universal aspiration to create a renewed individual, one free from outdated thoughts and attitudes. The New Year, therefore, offers us an invaluable opportunity to embrace renewal in our own lives.",
    "As we welcome this New Year, I call upon all of you to come together with renewed strength, unity and goodwill. Let us collectively work towards a common purpose, supporting the government’s vision for economic, social and political transformation and thereby ensuring enduring progress and prosperity for our country and all its people.",
    "May this New Year bring you and your loved ones peace, happiness, renewed hope and abundant prosperity in your journey towards ‘A Thriving Nation – A Beautiful Life”.\nWarmest wishes for a Happy Sinhala and Tamil New Year!"
  ]
}