{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-11-01-en-f3e8a2",
  "num": "en-f3e8a2",
  "date_str": "2024-11-01",
  "description": "President Appoints Chief Advisor on Digital Economy",
  "url_metadata": "https://pmd.gov.lk/news/president-appoints-chief-advisor-on-digital-economy/",
  "lang": "en",
  "article_title": "President Appoints Chief Advisor on Digital Economy",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake has appointed Dr Hans Wijayasuriya as the Chief Advisor to the President on Digital Economy. President Dissanayake has espoused and reiterated a bold vision and personal commitment to elevate Sri Lanka’s digital economy to a level on par with the most advanced nations in the region, envisaging acceleration of economic growth, national competitiveness and delivery of tangible benefits to all citizens.",
    "The Government is strongly committed to multi-sectoral digital transformation through the elevation of Sri Lanka’s information and communication technology and digital infrastructure sectors to global standards, and the establishment of Digital Public Infrastructure (DPI) to deliver inclusive citizen empowerment. The government plans, accordingly, to exploit technological advancement to enable the capture of leap-frog opportunities with respect to economic and social development leading to a progressive digital economy and an enhanced quality of life for all citizens. Dr Wijayasuriya’s appointment is a key move with regard to bringing to fruition the above vision.",
    "Dr Wijayasuriya, a renowned figure in the ICT landscape internationally, is currently the Chief Executive Officer of Telecommunications Business and Group Executive Director at Axiata Group Bhd, a position he has announced he will step down following a transition period.",
    "During this period, Dr Wijayasuriya will lead the Board of the ICTA in the capacity of Non-Executive Chairman, enabling the activation of programme planning and preparation activities related to the ambitious digital transformation aspirations of the GoSL. He will subsequently take up several executive leadership roles within the institutional framework related to the digital economy following relevant legislative enactment. These include Secretary of a newly constituted Ministry of Digital Economy under the direct purview of the President, and Chair of the Digital Economy Authority, an apex body that will be mandated to oversee Digital Economy Acceleration."
  ]
}