{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-05-en-30bc85",
  "num": "en-30bc85",
  "date_str": "2025-05-05",
  "description": "President Invites Vietnam’s Vingroup to Invest in Sri…",
  "url_metadata": "https://pmd.gov.lk/news/president-invites-vietnams-vingroup-to-invest-in-sri-lanka/",
  "lang": "en",
  "article_title": "President Invites Vietnam’s Vingroup to Invest in Sri Lanka",
  "article_body_paragraphs": [
    "At the invitation of His Excellency Luong Cuong, President of the Socialist Republic of Vietnam, President Anura Kumara Disanayake, who is currently on a state visit to Vietnam, extended an open invitation to Vietnam’s leading conglomerate, Vingroup, to explore investment opportunities in Sri Lanka’s real estate and tourism sectors.",
    "While congratulating the Vingroup for their achievements and for building a diversified global brand, President Disanayake invited Vingroup to consider investing in Sri Lanka’s real estate and tourism sectors. He further emphasized that Sri Lanka is pleased to facilitate the creation of a smooth and enabling environment for their investments.",
    "The President made these remarks during a business engagement with Vingroup at their Headquarters in Hanoi, yesterday evening (04) where he met with Vice Chairman and the CEO of the Vingroup Nguyen Viet Quang and the delegation.",
    "President Disanayake emphasized Sri Lanka’s strategic geographic position, progressive infrastructure development and the government’s commitment to fostering a conducive environment for foreign investors, particularly in high-potential sectors such as tourism and real estate.",
    "Vingroup Joint Stock Company (Vingroup JSC) was founded in 1993 in Ukraine. Today, Vingroup is one of Vietnam’s largest and most respected private enterprises, operating as a multi-sector corporation with a focus on three core pillars: industrials & Technology, Real Estate & Services and Social Enterprises.",
    "Minister of Foreign Affairs, Foreign Employment and Tourism, Vijitha Herath also participated in the discussions."
  ]
}