{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-09-02-en-c3d210",
  "num": "en-c3d210",
  "date_str": "2025-09-02",
  "description": "Construction of Vadduvakal Bridge, Mullaitivu Commences under the…",
  "url_metadata": "https://pmd.gov.lk/news/construction-of-vadduvakal-bridge-mullaitivu-commences-under-the-patronage-of-the-president/",
  "lang": "en",
  "article_title": "Construction of Vadduvakal Bridge, Mullaitivu Commences under the Patronage of the President",
  "article_body_paragraphs": [
    "– President",
    "President Anura Kumara Dissanayake stated that the current government’s objective is to drive national development through a structured plan that recognizes economic strengths and brings economic growth to rural areas. He further affirmed his administration’s commitment to lifting rural communities out of poverty during his address at the inauguration of the Vadduvakal Bridge construction project in the Mullaitivu District today (02).",
    "The President noted that a series of new development projects are set to begin across the country this September. He emphasized that the government will put an end to the long-standing practice of delaying projects beyond their deadlines and spending beyond allocated budgets. Instead, all projects will be completed within the scheduled timeframe to ensure their benefits reach the people without delay.",
    "The Vadduvakal Bridge, located near the Nandikadal Lagoon along the Paranthan – Karachchi – Mullaitivu road, accommodates more than 3,000 vehicles daily. Due to the lack of maintenance over an extended period, the bridge has become severely unsafe. The Road Development Authority has planned to construct a new two-lane bridge at a cost of Rs. 1.4 billion in public funds, with completion targeted for September 2, 2027.",
    "Minister of Transport, Highways, Ports and Civil Aviation Bimal Rathnayake, speaking at the event, highlighted that although the project was initially estimated at Rs. 1.8 billion, under the current government’s transparent administration it will be completed at a reduced cost of Rs. 1.4 billion. The remaining Rs. 400 million will be allocated for highway development in the Vanni District. He further stated that Rs. 12.5 billion has been allocated for the construction of bridges and highways in the North this year, with provisions expected to increase further in the coming year.",
    "Minister Rathnayake also emphasized that the present government is dedicated to rebuilding the entire country while uniting the North through peace and development. He urged the public to evaluate the current administration based on observable efforts and concrete actions rather than prejudiced ideas.",
    "Minister of Fisheries, Aquatic and Ocean Resources, Ramalingam Chandrasekar, Deputy Minister of Cooperative Development Upali Samarasingha, Governor of the Northern Province Nagalingam Vethanayahan, Secretary to the Ministry of Transport, Highways, Ports and Civil Aviation Senior Professor Kapila C.K. Perera and officials of the Road Development Authority were among those present."
  ]
}