{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-14-en-eb984a",
  "num": "en-eb984a",
  "date_str": "2025-05-14",
  "description": "Vesak celebrations at the Presidential Office premises continue…",
  "url_metadata": "https://pmd.gov.lk/news/vesak-celebrations-at-the-presidential-office-premises-continue-for-the-second-consecutive-day/",
  "lang": "en",
  "article_title": "Vesak celebrations at the Presidential Office premises continue for the second consecutive day",
  "article_body_paragraphs": [
    "The second day of the “Vesak Bhakti Gee Saraniya”, held in parallel with the “Buddha Rashmi Vesak Kalapaya” jointly organized by the Hunupitiya Gangaramaya Temple, the Presidential Secretariat and the Prime Minister’s Office, commenced yesterday (13) at 6:30 p.m. under the patronage of Secretary to the President Dr. Nandika Sanath Kumanayake, at the Presidential Secretariat premises.",
    "The evening featured musical performances by renowned vocalist Ilyas Beg and the Sri Lanka Air Force Bhakti Gee Troup, accompanied by the Air Force Band. A Vesak lantern exhibition was also held at the venue. The event was attended by the Chief Incumbent of Gangaramaya Temple Venerable Dr. Kirinde Assaji Thero, along with several senior officials of the Presidential Secretariat.",
    "This Bhakthi Gee programme will continue on May 14 and 15 at the same location. Additionally, a short-eats dansala is being held near the Presidential Secretariat for the benefit of the public visiting Colombo for Vesak, and will continue until May 16.",
    "Meanwhile, a ‘Bath Dansala’ organized jointly by the Presidential Secretariat and the Sri Lanka Army was inaugurated yesterday near the Presidential Secretariat, with the participation of senior military officers. A large number of devotees from across the country attended the event.",
    "In line with the ‘Buddha Rashmi’ and ‘Bauddhaloka Vesak Kalapya’, several Vesak programmes have been organized in the vicinity with the support of the Presidential Secretariat. These include the illumination of nearby government buildings and roads with decorative lights, and the display of Vesak lanterns, with the active participation of the Presidential Secretariat staff."
  ]
}