{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-07-18-5c6248",
  "num": "5c6248",
  "date_str": "2025-07-18",
  "description": "Students from Vidyaloka College Kandy, Vidyaloka College Weranketagoda…",
  "url_metadata": "https://pmd.gov.lk/news/students-from-vidyaloka-college-kandy-vidyaloka-college-weranketagoda-and-junior-school-digampathaha-visit-the-presidents-house/",
  "lang": "en",
  "article_title": "Students from Vidyaloka College Kandy, Vidyaloka College Weranketagoda and Junior School Digampathaha Visit the President’s House",
  "article_body_paragraphs": [
    "Students from Vidyaloka College in Kandy, Vidyaloka College in Weranketagoda and Junior School Digampathaha had the opportunity to participate in the Vision programme organized by the Presidential Secretariat today (18).",
    "This programme, jointly conducted by the Presidential Secretariat, the Ministry of Education and the Parliamentary Department of Communication, aims to provide students with practical exposure relevant to their education. As part of the programme, students were given the opportunity to visit the Presidential Secretariat, the President’s House, the Port City Colombo and the Parliament.",
    "In line with the initiative, students were also educated on the “Clean Sri Lanka” programme and its conceptual importance.",
    "To emphasize the value of environmental conservation, symbolic plant saplings were presented to the participating schools.",
    "Addressing the students, Senior Additional Secretary to the President Mr. Kapila Janaka Bandara emphasized that the country needs a generation capable of making significant contributions across all sectors to achieve national development. He noted that with such contributions, Sri Lanka can rise to global prominence.",
    "Mr. Bandara further stated that personal transformation must begin from within by cultivating positive attitudes and that this internal change is the foundation for building Sri Lanka into one of the most beautiful countries in the world.",
    "Also present at the event were Director General of Public Relations at the Presidential Secretariat Dharmasiri Gamage, Director of Tri-Forces Coordination Air Commodore Asiri Gallage, Assistant Director Major Nadeeka Dangolla, school principals, teachers and a group of parents."
  ]
}