{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-06-en-81de3e",
  "num": "en-81de3e",
  "date_str": "2025-06-06",
  "description": "NIRDC Commences Formation of Technical Review Committees to…",
  "url_metadata": "https://pmd.gov.lk/news/nirdc-commences-formation-of-technical-review-committees-to-evaluate-submitted-projects/",
  "lang": "en",
  "article_title": "NIRDC Commences Formation of Technical Review Committees to Evaluate Submitted Projects",
  "article_body_paragraphs": [
    "In line with the Cabinet paper recently approved, the National initiative for the Commercialization of Research and Development (NIRDC) has initiated the establishment of technical review committees to evaluate projects submitted under this framework.",
    "During the first quarter of this year alone, the NIRDC has received project proposals valued at over\nLKR. 2 billion. The process of evaluating the technical viability of these proposals has now commenced, with a focus on transparency and accountability.",
    "Departing from previously flawed and ineffective evaluation mechanisms used in the country, the NIRDC is introducing a new evaluation model grounded in global best practices. This model emphasizes transparency and impartiality, aligning with methods employed by technologically advanced nations.",
    "Accordingly, several training sessions have already been conducted for those who applied to serve on the technical evaluation committees. These sessions aimed to provide reviewers with a fundamental understanding of the new technological evaluation process and to raise awareness of the relevant legal framework governing the procedures. The sessions were organized under the leadership of Prof. Gomika Udugamasuriya, Founder of the NIRDC and Senior Presidential Advisor on Science and Technology.",
    "The sessions, held on the 2nd, 3rd, and 4th of this month, were attended by a group of both local and international experts. The Director General of NIRDC, Dr. Muditha D. Senarath Yapa, along with the NIRDC staff, provided the necessary support and facilities for the successful conduct of these sessions."
  ]
}