{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-06-a207fc",
  "num": "a207fc",
  "date_str": "2025-05-06",
  "description": "Let’s draw upon the illumination of Buddhist philosophy…",
  "url_metadata": "https://pmd.gov.lk/news/lets-draw-upon-the-illumination-of-buddhist-philosophy-to-build-a-world-where-the-fires-of-war-are-extinguished-and-peace-prevails/",
  "lang": "en",
  "article_title": "Let’s draw upon the illumination of Buddhist philosophy to build a world where the fires of war are extinguished and peace prevails",
  "article_body_paragraphs": [
    "– President Says Delivering Keynote Address at 20th United Nations Day of Vesak Celebrations",
    "President Anura Kumara Disanayake extended an appeal to the global community to draw upon the illumination of Buddhist philosophy in building a world where the fires of war are extinguished and peace, development and mutual respect prevail among all nations and peoples.",
    "President Disanayake made this statement today (06) while delivering the keynote address at the 20th United Nations Day of Vesak Celebrations, which commenced in Ho Chi Minh City, Vietnam.\nVesak celebrations will be held this year under the theme “Solidarity and Tolerance for Human Dignity: Buddhist Wisdom for World Peace and Sustainable Development.” The event, held from May 6 to 8, will bring together over 2,800 participants, including high-level delegates from Buddhist countries such as Sri Lanka, India, Nepal, Laos and Cambodia, international delegates from 85 countries and territories.",
    "In his address, President Disanayake highlighted the enduring relevance of Buddhist philosophy in fostering global peace and reconciliation. He emphasised that the teachings of the Buddha offer a path to extinguishing the flames of war and building a world imbued with compassion, tolerance and mutual respect. The President underscored the importance of embracing the Four Brahma Viharas—loving-kindness (metta), compassion (karuna), empathetic joy (mudita) and equanimity (upekkha)—as guiding principles for humanity to overcome suffering and conflict.",
    "President Disanayake expressed his gratitude for the opportunity to participate in the celebrations hosted by Vietnam, a nation that has demonstrated remarkable resilience and progress in the aftermath of war. He commended Vietnam’s commitment to peace and its role in promoting Buddhist values on the international stage.",
    "Following is the full speech delivered by President Disanayake;",
    "I am deeply honoured to deliver the keynote address at the United Nations Day of Vesak Celebrations, held in a country that is rapidly and admirably rising, driven by tireless effort, extraordinary determination, focused commitment, strategic vision and remarkable outcomes.",
    "Vietnam is a land that, despite centuries of painful experiences and countless struggles, has courageously forged a path forward and stood tall. We hold immense pride in the victories your nation has achieved, having once been subjected to some of the most brutal injustices in history, including the use of devastating chemical weapons. It is with deep respect that I choose to refer to your nation as the ‘Land of Determination’.",
    "In a few days, we will mark the Sambudu Themagula, which commemorates the birth, enlightenment and passing away of Buddha. It is a matter of great pride that Vietnam has been selected as the host of the United Nations Day of Vesak Celebrations in conjunction with this sacred event.",
    "In 1999, a proposal was submitted at the United Nations General Assembly to officially recognise Vesak Day as an international observance. This proposal was presented by the late Lakshman Kadirgamar, the former Foreign Minister of Sri Lanka. By the year 2000, the United Nations officially declared Vesak Day an internationally recognised observance. Today, we gratefully remember both the Buddhist and non-Buddhist communities who supported this noble initiative.",
    "In a strong society, power is shared through equality. Without equality, we build not peace, but a world of war. Throughout 2,500 years of Buddhist history, the message of equality preached by Gautama Buddha has been clearly articulated. His teachings on moderation and restraint have now become a practical reality at the global level. Vietnam itself stands as a living testament to this principle of equality. Fittingly, the theme of this year’s United Nations Day of Vesak is also ‘Equality’.",
    "Even as we speak, violations against human dignity are occurring in parts of the world. Thousands of weapons are directed at humanity. Innocent children, who know nothing of war, are caught in its crossfire and suffer in vast numbers. As a result, women lose their husbands, parents lose their children and children lose their parents. Viewed through this lens, it becomes evident that war brings not triumph, but the destruction of human civilisation. What remains for many after war is only sorrow and suffering. As a nation that endured the agony of three decades of war, we too know this pain. Such suffering can only be prevented through peace and restraint. Until that realisation is reached, what humanity inherits will be nothing but sorrow and pain.",
    "The value of acting with peace and restraint during times such as these was insightfully proclaimed by Gautama Buddha over 2,500 years ago. As Sri Lankans, we have deeply embraced these values. Our country has long enjoyed strong bonds among parents and children, relatives and friends, as well as teachers and students. In our culture, offering one’s blood to save another’s life is regarded as a noble act of generosity. I am not aware of any other country where the donation of blood is considered a form of ‘dāna’ (giving) in this way. Moreover, organ donation, including eye donation is also practised by our people.",
    "In this way, our country has closely internalised the Buddhist concept of dāna (giving). For over 2,500 uninterrupted years, the Buddha Dhamma has been rooted in the principle of nonviolence. The message of the Dhamma delivered by the Buddha in the “Dhamsak Pevathum Sutra” Sermon continues to resonate with relevance and expand across the globe today. The Buddha has shown us a path, one that is vastly different from the road that leads to the destruction of human civilisation.",
    "As we walk the path the Buddha taught, we are guided to fight not with weapons, but against the inner enemies of anger, jealousy, hatred, aversion, and delusion. The Dhamma offers powerful means—through the cultivation of loving-kindness (mettā), compassion (karuṇā), sympathetic joy (muditā), and equanimity (upekkhā)—to combat these defilements.\nThis spiritual arsenal, rooted in mindfulness and compassion, is far stronger than any weapon of mass destruction. The Dhamma taught by the Buddha is aimed at overcoming the enemies within. Choosing the path of war leads only to sorrow, tears and profound suffering. But by choosing the path of peace, one comes to truly understand the Dhamma.",
    "We can also learn how deeply the Dhamma can influence a life by looking at the reign of Emperor Ashoka. His rule became known not for the sound of war drums, but for the reverberation of the Dhamma. Those once enthralled by the thrill of war began to experience the joy of loving-kindness. On one occasion, when a conflict arose between the Sakyans over water from the Rohini River, the Buddha himself travelled to Kapilavatthu to demonstrate the greater value of peace over war. Time and again, the Dhamma has emphasised the supremacy of peace.",
    "In today’s world, which has become a global village, the teachings of the Dhamma on compassion, peacefulness and patience, make a profound contribution to our understanding and way of life. The Buddha, as a great teacher, championed both restraint and freedom of expression, encouraging individuals to question his teachings repeatedly in order to realise the Dhamma with clarity and wisdom.\nIn the truest sense of the word, the Dhamma is one that must be realised through personal insight. Following this path, Buddhist monks today carry the message of equality across the world. This message contains no seeds of conflict, no incitement to violence, no shedding of blood, nor any form of punishment. It is the path of peace.",
    "Through moral education, the Dhamma teaches us to respect one another and that hatred does not cease by hatred, but only through non-hatred. The Buddha was the first teacher to preach the message of global peace. His instruction was for each individual to place trust in themselves. In this way, Buddhist philosophy offers a deep and profound guide to living.\nThe Buddha delivered teachings on Buddhist resources and restraint in the Sigālovada Sutta. This Sutta outlines how acquired resources should be utilised, specifying that one part is for consumption, two parts are for strengthening the economy and another portion is set aside for use during unexpected situations.",
    "In addition, the Buddha provided guidance on governance. He instructed rulers to protect human rights by suppressing crime, fostering economic prosperity and leading the country in accordance with moral and spiritual principles. The Buddha’s political philosophy offers a framework for rulers that emphasizes governance based on virtuous policies.",
    "His message was clear: “When the ruler, the first citizen of the country, governs wisely, the people will live in peace and prosperity.” This is a key aspect of the Dhamma taught by the Buddha.",
    "The Buddha’s teachings on governance also include many valuable concepts, particularly within the context of the ten royal virtues (Dasa Rāja Dharmas). These principles guide the ethical and moral conduct of a ruler, encouraging peace and equality. For this reason, I firmly believe that the entirety of the Buddha’s Dhamma conveys a message of peace and equality, central to its core teachings. The Buddha has also taught that all things are impermanent.",
    "One of the well-known verses that summarises the teachings of all the Buddhas is as follows:",
    "“Sabba pāpassa akaraṇaṃ – Kusalassa upasampadā\nSacchitapariyodapanaṃ – Etam Buddhāna Sāsanaṃ”",
    "The simple meaning of this verse is: “Refrain from all evil, cultivate good and purify the mind.” This is the essence of the teachings given by all the Buddhas.",
    "Sri Lanka and Vietnam have maintained close and mutually beneficial relations for centuries. In recent times, these ties have grown even stronger. Just yesterday, I had the privilege of unveiling a unique Bodhi enclosure at the Bai Ding Pagoda in Vietnam. This enclosure houses a sapling of the Jaya Sri Maha Bodhi, which was gifted to Vietnam by Sri Lanka in 2023.",
    "As followers of the Buddha’s Dhamma, we strive for a world free from the fires of war, a world filled with peace, love, and compassion. I call upon all people to embrace the teachings of the Buddha and the Buddhist philosophy, fostering peace, development and mutual respect among all nations and peoples."
  ]
}