{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-01-04-7533fe",
  "num": "7533fe",
  "date_str": "2025-01-04",
  "description": "President Inaugurates FACETS Sri Lanka – 2025: International…",
  "url_metadata": "https://pmd.gov.lk/news/president-inaugurates-facets-sri-lanka-2025-international-gem-and-jewellery-exhibition/",
  "lang": "en",
  "article_title": "President Inaugurates FACETS Sri Lanka – 2025: International Gem and Jewellery Exhibition",
  "article_body_paragraphs": [
    "FACETS Sri Lanka – 2025 International Gem and Jewellery Exhibition was inaugurated under the patronage of President Anura Kumara Disanayake at the Cinnamon Grand Colombo today (04).",
    "The President also visited and inspected the gem and jewellery stalls featured at the exhibition.",
    "Organized by the Sri Lanka Gem and Jewellery Association (SLGJA) in collaboration with the National Gem and Jewellery Authority (NGJA) and the Export Development Board (EDB), this year marks the 31st edition of Asia’s leading gem and jewellery exhibition. The event will continue until January 6.",
    "Delegations from China, India, the United States, Europe, and several other countries, along with representatives from globally renowned gem and jewellery companies visiting Sri Lanka for the first time, are participating in the event.",
    "Additionally, local gem entrepreneurs from prominent industry hubs such as Ratnapura, Elahara, Beruwala, Eheliyagoda, Galle, and Colombo are showcasing their exceptional craftsmanship.",
    "The primary objective of the exhibition is to create business opportunities with traders, exporters, and industry professionals worldwide, with the ambition of exceeding USD 1 billion in gem and jewellery exports.",
    "FACETS Sri Lanka is one of the most anticipated events in the local and global gem and jewellery industry calendar, offering insights into Sri Lanka’s rich heritage, diversity, and sustainability in the sector.",
    "The event was graced by several dignitaries, including Sunil Handunnetti, Minister of Industry and Enterprise Development, Vijitha Herath, Minister of Foreign Affairs, Foreign Employment, and Tourism, and Chaturanga Abeysinghe, Deputy Minister of Industry and Enterprise Development, along with Ambassadors and other distinguished guests."
  ]
}