{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-10-en-82eb53",
  "num": "en-82eb53",
  "date_str": "2025-04-10",
  "description": "34 New Projects under “Clean Sri Lanka” Programme…",
  "url_metadata": "https://pmd.gov.lk/news/34-new-projects-under-clean-sri-lanka-programme-this-year/",
  "lang": "en",
  "article_title": "34 New Projects under “Clean Sri Lanka” Programme This Year",
  "article_body_paragraphs": [
    "• Several Projects to Commence Before End of April",
    "Under the guidance of President Anura Kumara Disanayake, the “Clean Sri Lanka” programme implemented as a key government initiative is set to launch 34 new projects this year, and work on many of these projects is scheduled to commence by the end of this April.",
    "In line with this, a one-day workshop was held today (10) at the “Clean Sri Lanka” Secretariat located in the Lotus Building at the Temple Trees, under the leadership of Secretary to the President Dr. Nandika Sanath Kumanayake. The workshop provided technical guidance on preparing project proposals in accordance with the formats required by the Department of National Planning for submission and approval.",
    "The “Clean Sri Lanka” programme aims to foster social, environmental and ethical transformation across the country, with the active participation of all stakeholders. A sum of Rs. 5 billion has been allocated from this year’s national budget for its implementation.",
    "Once the Department of National Planning grants approval for the proposed projects, detailed action plans will be developed in line with prescribed formats. It was agreed that projects deemed ready for implementation will commence before the end of April.",
    "During the workshop, Secretary to the President outlined the government’s expectations and the intended outcomes of the “Clean Sri Lanka” programme.",
    "Senior officials representing the Ministry of Public Administration, Provincial Councils and Local Government, Ministry of Foreign Affairs, Foreign Employment and Tourism, Ministry of Health and Mass Media, Ministry of Education, Higher Education and Vocational Education, Ministry of Transport, Highways, Ports and Civil Aviation, Ministry of Public Security and Parliamentary Affairs, Ministry of Agriculture, Livestock, Lands and Irrigation, Ministry of Digital Economy, Ministry of Urban Development, Construction and Housing, Ministry of Environment, Ministry of Industries and Entrepreneurship Development, Sri Lanka Police, and the Western Provincial Council were in attendance.",
    "Also present were Engineer S.P.C. Sugeeshwara, Additional Secretary to the President (Clean Sri Lanka Programme) and G.M.R.D. Aponsu, Senior Additional Secretary to the President (Finance and Economic Affairs), along with other senior officials."
  ]
}