{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-11-28-fda5d2",
  "num": "fda5d2",
  "date_str": "2024-11-28",
  "description": "President Anura Kumara Dissanayake holds discussion with the…",
  "url_metadata": "https://pmd.gov.lk/news/president-anura-kumara-dissanayake-holds-discussion-with-the-world-bank-group-president/",
  "lang": "en",
  "article_title": "President Anura Kumara Dissanayake holds discussion with the World Bank Group President",
  "article_body_paragraphs": [
    "A virtual meeting was held yesterday (27) between President Anura Kumara Dissanayake and the President of the World Bank Group (WBG) Mr. Ajay Banga at the Presidential Secretariat, to discuss Sri Lanka’s future development priorities.",
    "The President of the World Bank Group highlighted his commitment to promoting job creation and addressing critical development challenges. These priorities include providing Sri Lanka with financial and technical assistance to implement innovative solutions in sectors such as People’s education, healthcare, social protection, and economic prosperity. The World Bank’s support also extends to economic policy, finance, competitiveness, investments, institutional development, and poverty alleviation. Additionally, efforts are focused on advancing agriculture, water management, climate action, environmental sustainability, social inclusion, infrastructure, and digital transformation.",
    "During the meeting, President Dissanayake emphasized the government’s focus on poverty alleviation, particularly in rural areas. He also stressed the need for increasing government revenue through digitalization and by strengthening key sectors such as tourism, the maritime industry, state-owned enterprises (SOEs), and the energy sector, with a focus on encouraging investor participation in power generation.",
    "The President further discussed efforts to promote economic development in the North and East of Sri Lanka, particularly in improving education, healthcare, and human resource development. President Dissanayake also emphasized the need to improve vocational education parallel with academic education to meet the evolving needs of the workforce in these regions.",
    "The President of the World Bank Group revealed that Sri Lanka has been selected as one of 20 countries worldwide to host the integrated South Asia office, set to open on July 25, 2025.",
    "This initiative is part of Mr. Banga’s plan to establish 20 integrated country offices to improve coordination among the four key World Bank Group institutions: the International Bank for Reconstruction and Development (IBRD), the International Development Association (IDA), the International Finance Corporation (IFC), and the Multilateral Investment Guarantee Agency (MIGA).",
    "Deputy Minister of Economic Development Prof. Anil Jayantha and Deputy Minister of Finance and Planning Dr. Harshana Suriyapperuma also participated in the discussion."
  ]
}