{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-10-25-d0b8fa",
  "num": "d0b8fa",
  "date_str": "2024-10-25",
  "description": "Sri Lanka and South Africa Strengthen Ties:",
  "url_metadata": "https://pmd.gov.lk/news/sri-lanka-and-south-africa-strengthen-ties/",
  "lang": "en",
  "article_title": "Sri Lanka and South Africa Strengthen Ties:",
  "article_body_paragraphs": [
    "* President Dissanayake and High Commissioner Schalk Discuss Peace, Trade, Tourism, and Enhanced Travel Safety Measures",
    "President Anura Kumara Dissanayake met with the South African High Commissioner, H.E. Sandile Edwin Schalk, this morning (25th) at the Presidential Secretariat.",
    "During the meeting, the Ambassador presented a greeting message from the President of South Africa and reaffirmed South Africa’s commitment to strengthening bilateral relations with Sri Lanka. He also expressed continued support for applying South Africa’s peace and national reconciliation model in Sri Lanka. The discussion also covered expanding international trade through the Sri Lanka Chamber of Commerce and enhancing the travel and tourism sector to benefit both nations.",
    "A detailed discussion was held on exchanging South Africa’s technology to address human-elephant conflict management. South Africa’s interest in collaborating on Sri Lanka’s defence, agriculture, and technology sectors was also highlighted, with a commitment to working closely in these areas.",
    "President Anura Kumara Dissanayake briefed the South African High Commissioner on Sri Lanka’s current security situation, emphasizing the recent measures taken to enhance safety for both tourists and residents. He assured that these efforts, in response to recent travel advisories, have led to strengthened security protocols across key tourist areas.",
    "Deputy High Commissioner Ms. Rene Everson-Varney and Second Secretary Ms. Zanethemba-Leilla Tshangela were also present at the discussions."
  ]
}