{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-07-10-eb65f2",
  "num": "eb65f2",
  "date_str": "2025-07-10",
  "description": "President Meets Gates Foundation Delegation",
  "url_metadata": "https://pmd.gov.lk/news/president-meets-gates-foundation-delegation/",
  "lang": "en",
  "article_title": "President Meets Gates Foundation Delegation",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake today (10) met with Dr. Chris Elias, President of Global Development at the Gates Foundation, for high-level discussions focused on key areas critical to Sri Lanka’s development.",
    "The meeting, held at the Presidential Secretariat, explored collaborative efforts in agricultural modernisation, nutrition, digital public infrastructure and rural technological integration.",
    "Central to the discussions was the Inclusive Digital Agriculture Transformation (IDAT) initiative, which leverages data and technology to enable better decision-making and service delivery for smallholder farmers. The initiative represents a shared commitment to modernising agriculture, improving rural livelihoods and enhancing climate resilience.",
    "President Dissanayake welcomed the partnership, expressing optimism about the country’s path forward. “We welcome the continued support of the Gates Foundation as we work together to build a healthier, more equitable and digitally empowered Sri Lanka. This collaboration is a testament to our shared commitment to sustainable development and improving the lives of all our citizens,” he said.",
    "He further noted that the Government seeks the Foundation’s support for its broader programme aimed at integrating rural communities with modern global technology.",
    "Despite the economic challenges facing the nation, the President expressed gratitude for the Foundation’s engagement and emphasised that the visit would help identify and implement national development priorities.",
    "Representatives of the Gates Foundation reiterated their commitment to supporting Sri Lanka’s digital economy strategy. They highlighted that particular focus would be given to the digital transformation of the agriculture sector, with the aim of enhancing productivity and revitalising the economy. The Foundation also assured its full support for the wider socio-economic development agenda, including initiatives in the livestock and dairy industries.",
    "President Dissanayake underscored the importance of connecting rural communities, many of whom remain unaware of global technological advancements, with the tools and knowledge needed for empowerment. He stressed the value of the Foundation’s global experience and technical expertise in addressing development challenges common to many countries.",
    "“One of our Government’s foremost objectives is to extend advanced technology to all levels of society, not only to uplift the national economy but also to improve efficiency across all sectors,” the President noted.",
    "Dr. Elias acknowledged Sri Lanka’s ongoing transformation and welcomed the opportunity for deeper engagement. “We value the opportunity to engage with the Government and local institutions as they pursue strengthened systems to support inclusive growth. Our continued discussions in areas such as agriculture, health and digital infrastructure reflect a shared interest in advancing impactful solutions. I would like to thank the President and the Government of Sri Lanka for their continued commitment to improving the lives of all those living in Sri Lanka,” he stated.",
    "The Gates Foundation delegation included Dr. Chris Elias, President, Global Development Gates Foundation, Jamal Khan, Regional Representative for Policy & Government Relations, South and Southeast Asia; Archna Vyas, Director of Policy Advocacy and Communications, Thushan Wijesinghe, Director Enterprise Data Solutions and Chandita Samaranayake, Chairman Connect To Care.",
    "The Sri Lankan delegation included Deputy Minister of Digital Economy Mr. Eranga Weeraratne, Dr. Nandika Sanath Kumanayake, Secretary to the President; Dr. Hans Wijayasuriya, Chief Advisor to the President on Digital Economy; and Mr. Roshan Gamage, Senior Additional Secretary to the President."
  ]
}