{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-08-13-en-7d90a3",
  "num": "en-7d90a3",
  "date_str": "2025-08-13",
  "description": "Inaugural Session of the Student Parliament of Bomiriya…",
  "url_metadata": "https://pmd.gov.lk/news/inaugural-session-of-the-student-parliament-of-bomiriya-central-college-kaduwela-at-the-presidential-secretariat/",
  "lang": "en",
  "article_title": "Inaugural Session of the Student Parliament of Bomiriya Central College Kaduwela at the Presidential Secretariat",
  "article_body_paragraphs": [
    "The inaugural session of the Student Parliament of Bomiriya Central College, Kaduwela, was held yesterday (12) at the historic former Parliament Chamber of the Presidential Secretariat.",
    "This opportunity was granted to Bomiriya Central College as part of the ‘Vision’ programme series, jointly implemented by the Presidential Secretariat, the Ministry of Education and the Department of Communication of the Parliament of Sri Lanka, for the benefit of schoolchildren.",
    "During the event, members of the Student Parliament were educated on future leadership, the history of parliamentary traditions and the functions of Parliament.",
    "Senior Additional Secretary to the President, Mr. Roshan Gamage, explained the role of the President’s Fund and its importance for schoolchildren.",
    "Following the commencement of the inaugural session, the Speaker of the Student Parliament was elected and sworn in, along with the swearing-in of the Members of Parliament.",
    "Certificates of participation were presented to the Student Parliament members and bank accounts were opened for them with the Bank of Ceylon. Additionally, a valuable sapling was gifted to the school to commemorate the occasion.",
    "The event was attended by Deputy Speaker of Parliament Dr. Rizvie Salih, Director General (Legal) of the Presidential Secretariat, J. M. Wijebandara, Director General (Public Relations) Dharmasiri Gamage, Director (Legislative Services) and Acting Director (Communications) of the Parliament of Sri Lanka, Jayalath Perera, Director of the Tri-Forces Coordination Unit of the Presidential Secretariat, Air Commodore Asiri Gallage, Assistant Director, Major Nadeeka Dangolla, Public Service Officer, Duminda Wickramasinghe, Principal of Bomiriya Central College, M. M. A. A. M. Thilakarathna, Teacher-in-Charge of the Student Parliament, Nadeeka Udayangani Perera, along with a group of teachers, parents and other invitees."
  ]
}