{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-22-3c3e9f",
  "num": "3c3e9f",
  "date_str": "2025-04-22",
  "description": "Investment Friendly Environment Now Created in Sri Lanka…",
  "url_metadata": "https://pmd.gov.lk/news/investment-friendly-environment-now-created-in-sri-lanka-president/",
  "lang": "en",
  "article_title": "Investment Friendly Environment Now Created in Sri Lanka – President",
  "article_body_paragraphs": [
    "UAE Pledges Support for the Promotion of Energy, Tourism, Investment and Foreign Employment Sectors",
    "The Deputy Prime Minister and Minister of Foreign Affairs of the United Arab Emirates (UAE), His Highness Sheikh Abdullah Bin Zayed Al Nahyan, stated that the UAE will prioritize the promotion of the energy, tourism, foreign investment and foreign employment sectors while further strengthening its longstanding ties with Sri Lanka.",
    "The Deputy Prime Minister who is currently on an official visit to Sri Lanka accompanied by a high-level UAE delegation made these remarks during a meeting with President Anura Kumara Disanayake at the Presidential Secretariat today (22).",
    "The Deputy Prime Minister emphasized that this visit aims to further strengthen and expand the strong and longstanding bilateral relations between the two nations, with a focus on achieving mutual economic benefits through deepened cooperation for both countries.",
    "Extending his best wishes on behalf of the UAE and its people to the new administration of Sri Lanka, the Deputy Prime Minister assured the UAE’s full support for the new government’s development agenda.",
    "Furthermore, he praised President Anura Kumara Disanayake’s dedication, efforts and commitment toward rebuilding Sri Lanka, as well as his positive approach toward relations with the UAE.",
    "In response, President Anura Kumara Disanayake emphasized that Sri Lanka has now established an investment-friendly environment. He assured that unlike in the past, the country would not allow the re-emergence of an unstable climate that discouraged investment. The President also stressed that there are now strong legal frameworks in place to protect investments.",
    "The President also briefed the delegation on the government’s steps toward debt restructuring and achieving economic stability. Additionally, he outlined investment opportunities available in port terminal development, port city development, the tourism industry, the energy sector and transportation sector.",
    "President Disanayake further emphasized that the new government’s objective is to position Sri Lanka as the region’s leading investment hub and premier tourist destination.",
    "Among those present at the meeting were Minister of Labour and Deputy Minister of Economic Development, Dr. Anil Jayantha Fernando, Senior Additional Secretary to the President Roshan Gamage, Minister of State (UAE) H.E. Ahmed Ali Al Sayegh; UAE Ambassador to Sri Lanka H.E. Khaled Nasser Al Ameri, Assistant Minister for Economic and Trade Affairs (UAE) H.E. Saeed Mubarak Al Hajeri, Assistant Minister of Foreign Affairs for Energy and Sustainability Affairs (UAE) H.E. Abdulla Balalaa, Deputy Chief of Staff at the Office of the Minister of Foreign Affairs to the UAE, Ahmed Burhaima, Director of the Policy Planning Department at the Ministry of Foreign Affairs (UAE) Muath Alwari, Senior Media and Content Specialist at the Office of the Minister of Foreign Affairs (UAE) Maitha Al Mansouri, Desk Officer for Asian Affairs and Pacific Department (UAE) Ms. Huda Al Abdali and several other officials."
  ]
}