{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-09-en-df968d",
  "num": "en-df968d",
  "date_str": "2025-07-09",
  "description": "Discussion on Implementing the Kalutara Urban Development Plan…",
  "url_metadata": "https://pmd.gov.lk/news/discussion-on-implementing-the-kalutara-urban-development-plan-under-secretary-to-the-presidents-patronage/",
  "lang": "en",
  "article_title": "Discussion on Implementing the Kalutara Urban Development Plan under Secretary to the President’s patronage",
  "article_body_paragraphs": [
    "A discussion on the implementation of the Kalutara Urban Development Plan, which aims to develop Kalutara as a major city connecting the Western and Southern Provinces, was held today (09) at the Presidential Secretariat under the patronage of Secretary to the President Dr. Nandika Sanath Kumanayake.",
    "The importance of expediting the implementation of the Kalutara Urban Development Plan which aimed at transforming Kalutara into a major hub with high potential for industrial and economic growth was brought to the attention of all stakeholders during the discussion.",
    "The discussion focused on ensuring the effective implementation of the Kalutara Urban Development Plan following a feasibility study, with the aim of addressing the existing issues identified within the city. Attention was also drawn to the importance of maintaining strong coordination among all relevant institutions throughout the process.",
    "This city development plan places significant emphasis on establishing a Kalutara city entrance from a more accessible point on the Southern Expressway, enhancing the access road network to Kalutara city, and segmenting and developing Kalutara city into distinct zones.",
    "The discussion was attended by Kalutara District Member of Parliament Nandana Pathmakumara, Mayor of the Kalutara Municipal Council, Dhanuj Somaratne, Senior Additional Secretary to the President, Kapila Janaka Bandara, Kalutara District Secretary, G.M. Janaka K. Gunawardena, Chairman of the Kalutara Pradeshiya Sabha, A.A.P.P. Chandrasekara, Kalutara Municipal Commissioner Piyumali Kularatne, as well as officials from the Urban Development Authority and the National Housing Development Authority."
  ]
}