{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-08-2025-05-08-e36b77",
  "num": "2025-05-08-e36b77",
  "date_str": "2025-05-08",
  "description": "Let’s unite to bring the public service to…",
  "url_metadata": "https://pmd.gov.lk/news/lets-unite-to-bring-the-public-service-to-a-culture-of-modernity/",
  "lang": "en",
  "article_title": "Let’s unite to bring the public service to a culture of modernity!",
  "article_body_paragraphs": [
    "– President says addressing the 41st Annual Convention of the Sri Lanka Administrative Service Association",
    "President Anura Kumara Dissanayake stated that next year’s budget allocations will be set aside to build a modern public service, following a self-critique of the state, which he described as being in a state of physical and spiritual ruin.\nPresident Dissanayake further stated that the public service must be brought into a culture of modernity and that all possible measures will be taken to protect it.\nThe President said that priority attention has been given in next year’s budget to improving the physical facilities of the public service in order to modernise the state, which he described as being in ruins.\nPresident Anura Kumara Dissanayake expressed these views while attending yesterday’s (05) 41st Annual Convention of the Sri Lanka Administrative Service Association (SASA) at Temple Trees as the Chief Guest.\nThe 41st Annual Convention of the Sri Lanka Administrative Service Association was held at Temple Trees today (05), with President Anura Kumara Dissanayake as the chief guest and in the presence of Prime Minister Dr. Harini Amarasuriya and the Minister of Public Administration, Provincial Councils and Local Government, Dr.  Chandana Abayarathna.\nThe Sri Lanka Administrative Service Association is a professional body composed of officers of the Sri Lanka Administrative Service, which is the leading island-wide service in the public sector. It is noteworthy that this year’s annual convention was held after a five year hiatus.\nThe President explained that to strengthen the public service, a salary increase proposed in the last budget would be continued, with Rs. 110 Billion allocated for a salary increase next year. He added that the government also plans to allocate Rs. 110 Billion for public service salary increases in 2027.\nThe President stated that the government, as the political authority, is committed to creating an attractive public service and expects the dedication of public administration officials in this endeavour.\nPresident Dissanayake said that for a minority in the public service, their assigned responsibilities has become a transaction and that the public service, which prioritised financial values over social values, must be salvaged from this situation.",
    "The President said that the responsibility of public officials towards citizens cannot be confined by circulars or statutes. He added that officials who prioritise social values and social core systems must be created and that the responsibility of public officials is not to oppress others but to use their power to build a good public service and provide the public with a better life.\nPresident Anura Kumara Dissanayake stated that the public service has now reached a crossroads and that it is still possible to move forward over time. However, he said that the time has come to evaluate our responsibilities and choose the path necessary to provide an efficient service based on the needs of the citizen.\nThe President said that new experiments should be carried out as required for a new transformative change to create the country that citizens desire and that efforts should be made to restore the ruined state.\nFollowing is the full speech by President Anura Kumara Dissanayake:\n“This is a special occasion. I have met many of you here on various occasions. There are people who studied with me at university and others who were involved in different social activities with me. So, we have met at various times while working in different fields. However, this meeting is more important than all the others. Because you, who are participating in this annual convention of the Sri Lanka Administrative Service, one of the foremost services in our public sector and you are a group of people who bear great effort and responsibility for the maintenance of our state. Therefore, I am very happy to have a discussion like this with you.\nAt the beginning of this event, a video presentation was made about the history and development of the Sri Lanka Administrative Service. Our administrative service has a long history. Even if you take the period after independence, our political sphere has a long history. As a result, our public service and the political machinery have jointly guided this country for a long time.\nHowever, if we look at the current state of our country, can the political authority and the connected state body be happy with where our country is? We have passed various laws and statutes. We have granted various powers. We have caused various political upheavals. We have changed various titles. But if we look back, I don’t think any of us, if we honestly ask ourselves, can be satisfied with the state of the public service. Putting our own measurement aside, go and ask the average citizen if they are satisfied. They are not satisfied. That’s why your convention is taking place at a very important juncture. At this juncture, we have two paths we can choose from.\nOne is the old, mundane path of simply letting time pass, fulfilling the duties assigned to us only as they arise. It is the path our country has travelled for a long time. It is a very easy path.",
    "But there is another path: for each of us to commit to change by honestly evaluating how effectively our role has contributed to building the state and improving people’s lives. This path is not easy, because it is human nature to become comfortable with routine. People often fear change and experimentation. When we continue to perform our daily tasks in the same way, we get used to that routine and learn to manage our responsibilities within that comfort zone.\nHowever, if we choose a new path and are ready to embrace change, we will be challenged by the power of habit. Habit tends to resist transformation and slow down progress. Yet, when we look at the achievements and advancements of human civilization, one thing becomes clear: the key to that progress has been the courage to experiment without fear.\nAdapting to new situations is extremely important. If you fail to adapt, society will leave you behind. That’s why my first request to you is this: be willing to embrace change. Any living being or idea that cannot adjust to new circumstances will soon become irrelevant or disappear. So once again, I urge you to be prepared to adapt.\nHowever, what I’m asking you to do is to adapt to a new situation within a state that is already in ruins. Our state is broken, both physically and spiritually. That is the reality we face. If we are unwilling to confront this harsh truth and instead choose to look away as if we’re merely passing a cemetery, then true transformation will never be possible.\nTherefore, first of all, we need to understand the nature and the truth of the harsh reality that lies before us. We need to be open. We need to bring it to the table for discussion. What is the reality before us? I know that the official vehicles given to the officials here today are old, dilapidated vehicles that are more than 15-16 years old. The computers on your tables are old and in ruins. As a result, the state is physically in ruins. Therefore, we cannot create a modern state from a ruined public service. That is why we will pay special attention in this year’s budget to allocating the necessary funds to provide the facilities and support needed to modernise the public service.\nWe must move swiftly toward digitization, it is the most important transformation in the next phase. However, the power of habit is an obstacle. I’m aware that some institutions have already developed software systems and we acknowledge and appreciate that progress. That’s a good start. At a meeting with District Secretaries, one Secretary shared how she had successfully digitised her office. This was possible because there were officials within that office who supported the change. In other words, it happened due to the personal commitment of the people involved, not as part of a broader, systemic transformation. This is a clear example of how habit continues to resist change.\nNevertheless, we all share a common and sincere goal: to modernise our public service. As part of that effort, we have granted you the highest basic salary increase in recent history.",
    "To pay for this salary increase, Rs. 110 Billion is needed this year. In January next year, you will receive another salary increase, which also requires Rs. 110 Billion. A salary increase in 2027 will also require another Rs. 110 Billion. Therefore, to pay for these increased salaries, we will have to bear a cost of Rs. 330 Billion. This is in addition to the salary you are currently being paid. We have to allocate it from the 2027 budget. In this year’s budget, we allocated Rs. 110 Billion. In next year’s budget, it will become Rs. 220 Billion. By 2027, to pay for this total salary increase, we will have to bear a cost of Rs. 330 Billion. We know that in order to make our public service an attractive place, a fair salary scale must be established. We have done that. We have taken steps to provide an 80% salary increase.\nHowever, in certain areas of the state apparatus, we do not see officials taking responsibility for their duties. There have been instances where officials were found keeping money in their lockers. These are issues of ethics and morality. Prisoners have handcuffs and even keys in their possession. What is the root of this problem? A sense of responsibility and social values has been replaced by monetary value. All traces of humanity have been drowned and destroyed in a sea of ice. These are not matters that can be resolved through circulars, directives, or even the constitution. They must be understood as personal responsibilities and social obligations of every citizen.\nIf we are to create a modern public service, we must create a public service with a new spirit, as well as the objectives I mentioned above. Our public service needs a new system of values and principles. We must also recognise the true meaning of values. Values are not about over-consumption or triumphing by oppressing others. Society needs a new core system of values to replace these wrong values and principles. Gentleness, compassion and accountability for one’s assigned responsibilities are all necessary. We are all citizens. And we have all been assigned responsibilities in our respective fields. We must understand that not a single one of those responsibilities should be used to oppress others. The citizens of our country are looking at all of us with a plea. They are looking with pleading eyes to see if you will save our country and our citizens from the current situation. We have no right to ignore this at this time.\nIf you and we do not make this transformation, the citizens of our country will not even dream of a new world and good things. Therefore, we have a role to play in creating these good things.\nThere have been some criticisms and comments regarding certain investigations, but no one should fear this. We understand that officials may have past records and that there are things people have heard or know about one another. However, we are not judging you based on old perceptions or past reputations. Those are not relevant to us.\nWhat matters to us is how you have conducted yourself from the moment you were given your current responsibilities. Past actions will be investigated where necessary. We know that you sign thousands of documents every day. But if that signature that is meant to serve a social purpose, has been misused for personal financial gain, we will take legal action. This must not be seen as a witch hunt against the public service, nor as an attempt to intimidate officials. We have no such agenda.",
    "I noticed that a former President recently remarked that the Bribery Commission should be left alone and that no one should interfere or comment on its work. There seems to be a hope that the public will rise up against the Commission’s actions. Some believe this is the path to the government’s downfall. They assume that when the law is enforced, certain individuals will become angry and that this wave of discontent will topple the government.\nBut what does this really mean? It means that the rule of law is being restored. And I would like to ask: is reintroducing proper limits and accountability within the public service truly a reason to bring down a government?\nWe must create a new culture within the public service of this country ourselves. Our goal should be to provide a service that truly satisfies the citizens. Take a moment to find out how many people who visit your office on a Wednesday are repeat visitors and ask why that is.\nLet’s commit fully to transforming our public service into this new culture. You have my full support in this endeavour. Let us become the guardians of every decision made with this purpose in mind. We are not hunters seeking to punish, but rather, we are working to restore our country.\nThis is an effort no one should fear, instead, it should be welcomed and supported. I believe you will stand with me in this important task.\nWe have both the desire and the challenge to lead this country towards a new transformation. If you ask yourself whether you can be proud of this country, it means your heart holds a sincere intention to create a better future for our nation and its people. However, there is currently a gap between these good intentions and our actions. It’s time to begin acting according to your true conscience. Listen to that inner voice. This important work can only succeed if both the political leadership and the public sector work together with a shared purpose.\nWe, as the political authority and you, as the public service, have a responsibility. We will not change that in any way. Let’s perform our duties for a single purpose.\nThere have been many discussions about a common purpose on various occasions and groups of colleagues have worked together as friends. I now call on everyone to unite and make this transformation a reality.\nI wish your convention every success and invite everyone to come together to build a strong public service that provides the people with the facilities they need for a better life.",
    "Prime Minister Dr. Harini Amarasuriya:\nFor a long time, the value and dignity of the public administrative service in our country have been somewhat diminished. Political interference has also played a role in this decline. As a result, public trust in the public administrative service has been eroded. We must reconsider how to restore that trust in a service with such a long and proud history. As the political authority, we are committed to intervening in order to establish governance that is truly centred on the people.\nThe political authority will do everything possible to transform the vital work you do into a service centred on the people. Your contribution is essential to making this transformative change a reality. We will neither ask you to act improperly in the public service nor tolerate such behaviour. It is within this foundation of trust that real transformation can take place in our country.We ask you to carry out your duties grounded in that trust. We believe this trust will empower you to effectively implement the policies designed for the benefit of the nation.\nDr. Hans Wijayasuriya, Chief Advisor to the President on Digital Economy:\nWith the power of digitisation in the public service, citizens can receive more efficient and timely services. To progress as a country with capabilities on an international level, digitisation is essential for our public administrative service. Just as Sri Lankan cricket and our rich history have earned a special place in the world, the public service too can gain global recognition through digitisation. Therefore, we must not miss this important opportunity.\nThe role played by the public administrative service in helping the country recover swiftly from the previous economic crisis was crucial. The international community, observing Sri Lanka during that difficult time, doubted that such a rapid recovery was possible. Yet, the Sri Lankan public administrative service rose to the challenge and carried that great responsibility.\nWith the addition of digitisation, it will become even more achievable to elevate Sri Lanka onto the global stage. Digitisation has the ability to create a world-class system of governance. Therefore, this opportunity should be seized without hesitation.\nMeanwhile, a research journal prepared by the Sri Lanka Administrative Service Association was also presented to President Anura Kumara Dissanayake.\nMinisters, Governors, Secretary to the President, Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Industries and Entrepreneurship Development, Thilaka Jayasundara, Ministry Secretaries and officials and members of the Sri Lanka Administrative Service Association, including the Minister of Public Administration, Provincial Councils and Local Government Dr.  Chandana Abayarathna, were among those who attended the event."
  ]
}