{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-10-08-803ef9",
  "num": "803ef9",
  "date_str": "2024-10-08",
  "description": "U.S. President Joe Biden Congratulates President Anura Kumara…",
  "url_metadata": "https://pmd.gov.lk/news/u-s-president-joe-biden-congratulates-president-anura-kumara-dissanayake-on-his-election-victory/",
  "lang": "en",
  "article_title": "U.S. President Joe Biden Congratulates President Anura Kumara Dissanayake on His Election Victory",
  "article_body_paragraphs": [
    "In a significant gesture of diplomatic goodwill, U.S. President Joseph R. Biden Jr. (Joe Biden) extended his congratulations to Sri Lanka’s newly elected President, Anura Kumara Dissanayake.",
    "The message, delivered on behalf of the American people, recognized the importance of the peaceful and democratic nature of the election, which reaffirmed the strength of Sri Lanka’s democratic institutions.",
    "“This election reflects the strength of Sri Lanka’s democratic institutions and the commitment of its citizens to shaping their future through free and fair elections conducted in a peaceful manner, a cornerstone of any democracy,” President Biden remarked in his letter.",
    "The U.S. President emphasized the shared values between the two nations, particularly in advancing stability, prosperity, and inclusivity for all Sri Lankan citizens. President Biden expressed optimism about strengthening bilateral ties under President Dissanayake’s leadership, highlighting cooperation in several key areas.",
    "“The United States shares your vision of a more equitable Sri Lanka that is stable, prosperous, and inclusive of all its citizens,” he stated, expressing his commitment to working with President Dissanayake to further enhance cooperation between the two nations, particularly in promoting inclusive economic growth, regional security, and democratic governance.",
    "This message marks a new chapter in U.S.-Sri Lanka relations, with both countries poised to collaborate on initiatives that will benefit the region and uphold democratic principles."
  ]
}