{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-15-08-2025-15-08-a6b08b",
  "num": "2025-15-08-a6b08b",
  "date_str": "2025-15-08",
  "description": "Workshop to Raise Awareness among Government Executive Officers…",
  "url_metadata": "https://pmd.gov.lk/news/workshop-to-raise-awareness-among-government-executive-officers-on-the-use-of-artificial-intelligence/",
  "lang": "en",
  "article_title": "Workshop to Raise Awareness among Government Executive Officers on the Use of Artificial Intelligence",
  "article_body_paragraphs": [
    "A special workshop for government executive officers on the use of Artificial Intelligence (AI) to transform the public service into a productive and efficient service was held this afternoon (15) at Temple Trees.",
    "Organised by the Ministry of Digital Economy with the support of the Presidential Secretariat, the programme, titled “AI for Transforming Public Service”, was attended by executive officers from ten ministries, including the Prime Minister’s Office and the Cabinet Office.",
    "The objective of the workshop was to raise awareness and prepare government officials as an initial step in the state’s digital transformation agenda and to foster a positive attitude towards artificial intelligence within the public service.",
    "Addressing the gathering, Secretary to the President Dr Nandika Sanath Kumanayake stated that the government was taking necessary steps towards a digital transformation and that the public service must be prepared for it. He emphasised the importance of focusing on improving efficiency in the public sector through the use of AI, thereby delivering better services to the public.",
    "The keynote address was delivered by Senior Adviser to the President on Digital Economy, Dr Hans Wijayasuriya, while Information and Communication Technology Agency of Sri Lanka (ICTA) Board Member Harsha Purasinghe, together with officials from ICTA, contributed as resource persons for the workshop.",
    "Secretary to the Prime Minister Pradeep Saputhanthri was also present, along with executive officers from the Prime Minister’s Office, the Cabinet Office, the Ministry of Foreign Affairs, Foreign Employment and Tourism, the Ministry of Justice and National Integration, the Ministry of Industry and Entrepreneurship Development, the Ministry of Digital Economy, the Ministry of Health and Mass Media, the Ministry of Science and Technology, the Ministry of Trade, Commerce, Food Security and Cooperative Development and the Ministry of Energy."
  ]
}