{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-08-2025-08-08-0201f4",
  "num": "2025-08-08-0201f4",
  "date_str": "2025-08-08",
  "description": "The ‘Sannasa’ Informing Successful Conclusion of Historic Kandy…",
  "url_metadata": "https://pmd.gov.lk/news/the-sannasa-informing-successful-conclusion-of-historic-kandy-sri-dalada-perahera-was-presented-to-the-president/",
  "lang": "en",
  "article_title": "The ‘Sannasa’ Informing Successful Conclusion of Historic Kandy Sri Dalada Perahera was Presented to the President",
  "article_body_paragraphs": [
    "A nation cannot choose its path to future development by abandoning its heritage and culture\n– President",
    "The ‘Sannasa’ (scroll) informing the successful completion of the annual Kandy Esala Maha Perahera of the historic Sri Dalada Maligawa and the Sathara Maha Devala (The Four Chief Shrines) with great pageantry while honouring ancient traditions, was formally presented to President Anura Kumara Dissanayake yesterday (09) at the President’s House in Kandy.",
    "Diyawadana Nilame of Sri Dalada Maligawa, Pradeep Nilanga Dela, handed over the Esala Perahera Sannasa (scroll) to the President.",
    "In accordance with custom, the Nilames of the Sathara Maha Devala and the Pitisara Devala, accompanied the Diyawadana Nilame of Sri Dalada Maligawa, Pradeep Nilanga Dela, in the procession that made its way to the President’s House in Kandy.",
    "To mark the occasion, the President planted a sapling in the premises of the President’s House. Later, in keeping with custom, the President joined the Nilames for a group photograph and also presented gifts and awards to the artists who participated in the Perahera.",
    "Additionally, the President extended financial support to the ‘Pitisara Devala’ through the ‘Esala Perahera Trust’ and received the 20th edition of the ‘Sacred Dalada Culture’ a compilation by the Central Provincial Ministry of Culture.",
    "Addressing the gathering, President Dissanayake said that Sri Lankans are heirs to a great heritage built alongside Buddhist culture one that can never be abandoned, but must be preserved and developed. He noted that the Esala Maha Perahera festival holds a place of utmost importance within this heritage.",
    "The President mentioned that we must reconsider whether we, as a nation, have successfully embraced the new transformation that occurred in the twentieth century, which brought triumphs to the world. The President highlighted that numerous countries, which were previously behind us, surpassed us in the latter part of the twentieth century by swiftly integrating the advancements of that era into their own nations.",
    "The President further stated that we have not succeeded in securing the future of the world and at times, in safeguarding our historical heritage. He emphasized that the challenge and discussion regarding how to select our distinct future and development trajectory confront us today. He emphasized that in discovering our distinct path and shaping the nation’s future, we need to rely on the accomplishments of science and technology, along with our historical legacy.",
    "The President emphasized that the Dalada Perahera is a cultural milestone that should be made even more engaging and brought closer to the people for the benefit of the country’s future. Reflecting on his experience watching the Perahera, the President said he was heartened to see large numbers of enthusiastic youth participating with great energy, as well as both children and elders performing with vigour. President Dissanayake noted, inspires confidence that the nation has a future. “Our goal is to progress as a nation that is linked to these cultural opportunities. Therefore, we need to foster an environment that allows the general public to naturally engage with and understand our historical heritage and culture”, the President said.",
    "The President expressed that the utmost support that can be offered by a political authority to safeguard the nation’s cultural and historical heritage involves detaching politics from the institutional framework, including Devalayas and ensuring they remain the heritage of their historical custodians.",
    "He also mentioned that it is crucial to differentiate between the government sponsorship for these cultural activities and the political agenda.",
    "President Dissanayake also expressed his gratitude to the Mahanayake Theros of Malwathu and Asgiri Chapters and the Maha Sangha for their guidance, to the Diyawadana Nilame of Sri Dalada Maligawa, Pradeep Nilanga Dela and the Nilames of the Sathara Maha Devala and to everyone who contributed to the successful completion of the Perahera.",
    "The event was attended by Minister of Buddhasasana, Religious and Cultural Affairs , Dr. Hiniduma Sunil Senevi, Governor of the Central Province, Prof. Sarath Abeykoon, Secretary to the President , Dr. Nandika Sanath Kumanayake, Kandy District Secretary, Indika Udawatta, government officials, security force representatives and other invited guests.",
    ""
  ]
}