{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-03-10-1988f2",
  "num": "1988f2",
  "date_str": "2025-03-10",
  "description": "Newly Appointed Supreme Mahanayaka Thero of Sri Lanka…",
  "url_metadata": "https://pmd.gov.lk/news/newly-appointed-supreme-mahanayaka-thero-of-sri-lanka-amarapura-maha-nikaya-most-venerable-karagoda-uyangoda-maithree-moorthi-maha-nayaka-thero-awarded-sri-sannas-patra/",
  "lang": "en",
  "article_title": "Newly Appointed Supreme Mahanayaka Thero of Sri Lanka Amarapura Maha Nikaya, Most Venerable Karagoda Uyangoda Maithree Moorthi Maha Nayaka Thero, Awarded ‘Sri Sannas Patra’",
  "article_body_paragraphs": [
    "“Maha Sangha and Religious Institutions Bear Irreplaceable Responsibility in Building a Morally Upright Country.”\n– President",
    "The ceremonial awarding of the ‘Sri Sannas Patra’ to the newly appointed Supreme Mahanayaka Thero of the Sri Lanka Amarapura Maha Nikaya, Most Venerable Karagoda Uyangoda Maithree Moorthi Maha Nayaka Thero, Chief Incumbent of the Rassagala Chapter and Balangoda Sri Dharmananda Vidyayathana Pirivena, was held today (10) at the Bandaranaike Memorial International Conference Hall (BMICH) under the patronage of President Anura Kumara Disanayake.",
    "President Anura Kumara Disanayake presented the ‘Sri Sannas Patra’ to the newly appointed Supreme Mahanayaka Thero of the Sri Lanka Amarapura Maha Nikaya.",
    "Additionally, Minister of Buddhasasana, Religious and Cultural Affairs, Dr. Hiniduma Sunil Senevi offered the ‘Vijinipata’ to the Supreme Mahanayaka Thero.",
    "Most Venerable Karagoda Uyangoda Maithree Moorthi Maha Nayaka Thero was born on October 1, 1948, in Kamburupitiya, Matara, and entered the noble monastic life in 1962 under the guidance of Aggamaha Pandita Balangoda Ananda Maithriya Thero. In recognition of his more than six decades of dedicated service to Buddhism, religion, society, and education, the Sri Lanka Amarapura Maha Nikaya has appointed him as the new Supreme Mahanayaka Thero.",
    "Addressing the ceremony, President Anura Kumara Disanayake stated that in the process of restoring a morally upright nation, the Maha Sangha and religious institutions of this country bear an irreplaceable and profound responsibility.",
    "The President further emphasized that no matter how many economic and political victories are achieved, they would be meaningless if a just and virtuous society is not established.",
    "The President highlighted that the restoration of the nation’s fractured society cannot be achieved through law alone and stressed the need to build a compassionate society. He further stated that the country urgently requires a strong national dialogue on the essence of liberation, as preached by the Buddha and other religious leaders, for the well-being of its citizens.",
    "The President also mentioned that discussions are currently underway with the Mahanayaka Theros regarding the Buddhist Dialogue Act. The President further noted that amendments to Sections 41 and 42 of the Viharagam and Dewalagam Ordinance have been drafted, and steps will be taken to present them to the Cabinet soon. Once approved, they will be submitted to the Parliament for enactment, ensuring the formal establishment of the Sangha Council and granting the necessary authority to the Mahanayaka Theros and the Sangha Sabha.",
    "During the ceremony, commemorative publications, including the biography of the Mahanayaka Thero, were also presented to President Anura Kumara Disanayake.",
    "The event was attended by the Maha Sangha representing the tri-Nikaya, former Presidents and Prime Ministers, Opposition Leader Sajith Premadasa, Ministers, MPs, foreign Ambassadors and High Commissioners, Secretary to the President Dr. Nandika Sanath Kumanayake, government officials, members of ‘Dayaka Sabha’, and a large gathering of devotees."
  ]
}