{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-02-23-f8dd0e",
  "num": "f8dd0e",
  "date_str": "2025-02-23",
  "description": "Special Sacred Tooth Relic Exposition after Sinhala and…",
  "url_metadata": "https://pmd.gov.lk/news/special-sacred-tooth-relic-exposition-after-sinhala-and-tamil-new-year/",
  "lang": "en",
  "article_title": "Special Sacred Tooth Relic Exposition after Sinhala and Tamil New Year",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake announced that a special exposition of the Sacred Tooth Relic will be held for the general public after the Sinhala and Tamil New Year.",
    "He stated that discussions regarding this event were held today (23) with the Chief Prelates (Mahanayaka Theras) of the Malwathu and Asgiriya Chapters.",
    "Furthermore, arrangements for the exposition were agreed upon with the participation of the Governor of the Central Province, the Kandy District Secretary, other government officials and the Diyawadana Nilame of the historic Temple of the Sacred Tooth Relic.\nThis morning (23), President Anura Kumara Disanayake visited the historic Temple of the Sacred Tooth Relic in Kandy, where he paid homage to the Sacred Tooth Relic and received blessings.",
    "Subsequently, he visited the Malwathu Maha Viharaya, where he met with the Chief Prelate of the Malwathu Chapter, Most Venerable Thibbatuwawe Sri Siddhartha Sumangala Thera. The President inquired about the Chief Prelate’s well-being and engaged in a brief discussion. During the visit, the Maha Sangha chanted Seth Pirith (blessings) and bestowed blessings upon the President.",
    "The President then proceeded to the Asgiriya Maha Viharaya, where he met with the Chief Prelate of the Asgiriya Chapter, Most Venerable Warakagoda Sri Gnanarathana Thera and engaged in a brief discussion. Senior monks, including the Anunayaka Theras of the Asgiriya Chapter, were present at the occasion and the Maha Sangha chanted Seth Pirith to invoke blessings upon the President.",
    "Responding to a question from journalists, President Anura Kumara Disanayake assured that there is no threat to national security. He acknowledged that while conflicts among underworld groups exist, they do not pose a risk to public safety.",
    "The President emphasized that the current government is taking firm action to completely eradicate organized crime, which had previously thrived under political protection.",
    "The President reaffirmed the government’s commitment to conducting the local government elections as soon as possible. He assured that there are no legal obstacles preventing the Election Commission from holding the elections and that the government has already allocated the necessary funds. The President expressed confidence that the Election Commission will soon announce the election date.",
    "The event was attended by Minister Samantha Vidyaratna, Deputy Ministers Dr. Prasanna Gunasena and Dr. Hansaka Wijayamuni, Kandy District Member of Parliament Thushari Jayasinghe, Diyawadana Nilame Pradeep Nilanga Dela Bandara and several other dignitaries."
  ]
}