{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-02-04-15b3e2",
  "num": "15b3e2",
  "date_str": "2025-02-04",
  "description": "President Anura Kumara Disanayake’s speech at the 77th…",
  "url_metadata": "https://pmd.gov.lk/news/president-anura-kumara-disanayakes-speech-at-the-77th-national-independence-day-celebrations/",
  "lang": "en",
  "article_title": "President Anura Kumara Disanayake’s speech at the 77th National Independence Day celebrations",
  "article_body_paragraphs": [
    "This year, we commemorate a special Independence Day. Rather than merely reflecting on our past, this year we celebrate Independence Day looking forward to the future. Today, we celebrate Independence Day, at a juncture when people from the northern, southern, eastern, and central regions of our country collectively dream of a future defined by a prosperous Sri Lankan State, a modern Sri Lankan nation.",
    "On February 4, 1948, our country attained the political autonomy requisite for self-determination. Although that freedom was constrained, it nonetheless held profound significance. That moment marked the inaugural instance in our history when we secured political independence. This island, which had been partially subjected to Western imperialist rule since 1505, was entirely subsumed as a British colony in 1815. It is on a day such as today that the political prerequisites for emerging as an independent state, liberated 77 years ago, begin to be fulfilled. Therefore, it is a day worthy of celebration.",
    "Today is a day to honor all the valiant heroes who rendered immense sacrifices to render this day possible. Moreover, even after 1948, as we carried forward the mantle bestowed upon us to realize complete freedom, additional courageous souls have traversed arduous paths in pursuit of our liberation. We have journeyed far to reach this moment of celebrating our 77th anniversary of independence, having borne that baton through the passage of time, including the pivotal year 1972, when we attained full political sovereignty under a constitutional crown. In that journey, we have arrived at this day, forged by the blood and sweat of thousands of gallant people, both celebrated heroes and heroines as well as the unsung ones, who sacrificed their lives for our freedom. We hereby pay our homage to all of them in this moment.",
    "Today, as the democratically elected President of this state, I stand before our proud national flag in Independence Square, not only as your leader but as a brother who has borne the historical burden emblematic of our future freedom. I am confident that you stand with me in this moment, sharing in the weight of this burden.",
    "Together, we must embark upon a journey towards economic liberation and socio-cultural emancipation, in short, towards the freedom essential for us to live with pride as contemporary citizens of this nation. Not only must we overcome the ethnic, religious, and caste divisions that have long fragmented and subjugated us as subjects, but we must also eradicate the entrenched prejudices that exist between political representatives and the populace, between institutional leaders and their staff, between passengers and public transportation operators, between government employees and the citizens they serve, between educators and students, and so forth. We must purify our society by eradicating these prejudices and reaffirm that human dignity, love, and compassion, the hallmarks of the modern era, form the bedrock of all human relationships. Similarly, as citizens of this nation, we must not permit the respect or affection inherently owed to every human being to be curtailed by disability, age, illness, or any other such limitation.",
    "Only when we have fully commemorated 77 years of liberation from colonialism can we reimagine freedom for our nation.",
    "Therefore, we must recognize that in our quest to attain comprehensive economic, social, and cultural freedom, each of us is a warrior on the same battlefield. Collectively, we must persist in our struggle for freedom on behalf of this motherland.",
    "In this endeavor, you, as farmers and fishermen who sustain our nation with food, as educators who cultivate knowledge and nurture future generations, as healthcare professionals who safeguard the well-being of our people, and as members of the police and security forces who ensure the safety of our citizens, bear an indispensable responsibility. Equally, those who fortify our manufacturing sector, propel our nation toward industrialization, and bolster our service economy, from garment factory workers to the women who harvest tea leaves in the highlands, from expatriates laboring abroad to those striving to elevate our nation through information technology, and from advocates of the tourism industry, each of you plays a crucial role in nurturing our motherland.",
    "To secure our economic freedom, rather than succumbing to weakness in the global economic system and being overwhelmed by its every fluctuation, we must unite in our efforts for this motherland. In our pursuit of economic liberation, we must remain steadfast, never relegating our social and cultural freedom to a subordinate position.",
    "Consequently, as artists, writers, journalists, and scholars, you bear an indispensable responsibility to purify and rejuvenate our national spirit, which has been tarnished by hatred and anger. In this context, religious leaders have likewise been entrusted with a profound responsibility.",
    "Similarly, as devoted mothers and fathers nurturing the future generations of this nation, you, too, have a vital role to fulfill.",
    "Likewise, as the sons and daughters diligently studying today in preparation to steward this nation tomorrow, you possess a unique and crucial role.",
    "Just as the mantle of responsibility to lead this nation into the future was entrusted to us through the sacrifices, blood, tears, and sweat of those who loved our country immeasurably, so too shall we one day bestow that honorable responsibility upon you. However, on February 4, 2025, as we commemorate our national independence, 77 years since our liberation from colonial rule, I must pledge one promise to you. The nation we bequeath to you is not merely the country that history has conferred upon us, but your own homeland, a nation in which you can aspire to live as global citizens. It is a nation that reveres human dignity and embodies an elevated cultural ethos. Moreover, it is a country that guarantees your right to partake in the scientific, technological, and intellectual advancements that human civilization has realized thus far, as citizens of this Sri Lankan state.",
    "I assert this unequivocally before you today, for we possess no legitimate excuse to squander this magnificent opportunity bestowed upon us by history. The future will attest that we have not faltered in this regard. I am equally confident that you will guide this cherished motherland into the future with even greater devotion and vigor than we have demonstrated.",
    "As human beings, our inalienable duty, by virtue of our existence on this earth, is to render this world a haven of elevated humanity, and to ensure that all individuals have equitable opportunities to partake in and embody that higher humanity. Our struggle for freedom is intrinsically intertwined with this noble aspiration.",
    "Therefore, let us envision that dream of freedom collectively, let us bring that dream to fruition together.",
    "Perhaps you and I, indeed all of us, are united on this journey, and it is imperative to remember that this journey has the potential to render our motherland, this Sri Lankan state, an enduring exemplar of freedom and democracy in the contemporary political landscape. Although we may not emerge as the wealthiest nation globally, through our concerted efforts, we can evolve into a model state of equality and freedom, one that epitomizes the richest national spirit in the world."
  ]
}