{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-07-08-2025-07-08-3a2ebf",
  "num": "2025-07-08-3a2ebf",
  "date_str": "2025-07-08",
  "description": "Australian Governor-General Meets President",
  "url_metadata": "https://pmd.gov.lk/news/australian-governor-general-meets-president/",
  "lang": "en",
  "article_title": "Australian Governor-General Meets President",
  "article_body_paragraphs": [
    "– Governor-General Samantha Joy Mostyn",
    "Australian Governor-General, Her Excellency Samantha Joy Mostyn, met with His Excellency President Anura Kumara Dissanayake this afternoon (08) at the Presidential Secretariat, where the two parties held bilateral discussions.",
    "During the meeting, lengthy discussions were held on strengthening the more than 75-year-old friendship between Australia and Sri Lanka and expanding areas of cooperation for the mutual benefit of both countries.",
    "Governor-General Mostyn emphasised that Australia is prepared to provide the continued support necessary for a successful journey under President Anura Kumara Dissanayake’s clear and decisive leadership.",
    "She particularly noted Australia’s willingness to extend its support towards strengthening Sri Lanka’s economy.",
    "President Dissanayake remarked that this visit would further strengthen the longstanding friendship between Australia and Sri Lanka. He also recalled the support extended by the Australian Government, both directly and through international institutions, during the tsunami disaster and Sri Lanka’s recent economic crisis.",
    "The President went on to express appreciation for the support Australia has provided to Sri Lanka in areas such as economic development, education, defence, tourism and maritime affairs.",
    "He noted that Australia has become a key hub for employment, education and vocational training for many Sri Lankans, and stated that Sri Lanka has much to learn from Australia’s experience in these fields. He expressed hope that such knowledge and expertise could be effectively shared.",
    "The President also highlighted that Sri Lanka has now created a highly favourable environment for Australian investors.",
    "At the invitation of President Anura Kumara Dissanayake, the Australian Governor-General arrived in Sri Lanka yesterday afternoon (06) on a three-day official visit. She is scheduled to visit several parts of the island, including projects supported by Australia in Bandaragama, Mirissa and Weligama.",
    "Representing Sri Lanka at this discussion were Minister of Labour and Deputy Minister of Economic Development, Dr Anil Jayantha, Secretary to the President, Dr Nandika Sanath Kumanayake and Senior Additional Secretary to the President, Mr. Roshan Gamage."
  ]
}