{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-15-en-15485e",
  "num": "en-15485e",
  "date_str": "2025-07-15",
  "description": "A Memorandum of Understanding to establish a laboratory…",
  "url_metadata": "https://pmd.gov.lk/news/a-memorandum-of-understanding-to-establish-a-laboratory-with-international-accreditation-facilities-with-a-15-million-investment/",
  "lang": "en",
  "article_title": "A Memorandum of Understanding to establish a laboratory with international accreditation facilities with a $15 million investment",
  "article_body_paragraphs": [
    "A Memorandum of Understanding (MoU) was signed this morning (15) at the Presidential Secretariat between STEMedical of the USA and the Sri Lanka Institute of Biotechnology (SLIBTEC) to establish a laboratory with internationally recognised accreditation.",
    "The MoU for this $15 million investment project, conducted under the guidance of the National Initiative for Research and Development Commercialisation (NIRDC), was signed by Professor Hans Keirstead, founder of the American company STEMedical and on behalf of the Sri Lanka Institute of Biotechnology (SLIBTEC), by its Chairman, Professor Samitha Hettige and Chief Operating Officer, Amali Ranasinghe.",
    "For a long time, there has been a need to enhance the capacity of laboratories with internationally recognised accreditation for testing purposes across many sectors in Sri Lanka, including health, agriculture, cosmetics and Ayurveda, as well as in the import and export fields.",
    "Professor Gomika Udugamasooriya, Senior Presidential Advisor on Science and Technology, who attended the event, said that today is a special day for Sri Lanka and that accreditation is very important for a country. Prof. Udugamasooriya emphasised the significance of a laboratory project with such accreditation facilities in achieving the government’s objective of doubling the country’s export revenue by the year 2030.",
    "This laboratory is expected to function as a main lab, working in conjunction with existing laboratories across the island, to ensure the quality of goods and services in various fields.",
    "Professor Hans Keirstead, founder of STEMedical, stated that he is pleased with the current leadership in Sri Lanka, which he said has a broad vision for the scientific sector and has been able to identify developmental needs such as enhancing laboratory capacity. He also said that this project would bring many benefits to the country, not only clinically but also economically. Mr Keirstead further mentioned that it would attract the attention of economic experts and generate revenue by bringing items, such as medicines, from other countries to Sri Lanka for accreditation.",
    "Professor Hans Keirstead, the founder of STEMedical in the United States, is an internationally recognised stem cell expert. He is also a respected entrepreneur in the field of regenerative medicine in the USA. It is also noteworthy that Professor Hans Keirstead, who currently serves as the Chief Executive Officer of the Human Immunome Project, is among the top 100 scientists in the world, as listed by Discover Magazine.",
    "The President’s Senior Additional Secretary, Russel Aponsu; the Director-General of the National Initiative for Research and Development Commercialisation (NIRDC), Dr Muditha Senarath Yapa; and the Chief Executive Officer of STEMedical in the United States, Dr Nistor Gabriel Loan, also attended the event."
  ]
}