{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-12-14-en-556ec5",
  "num": "en-556ec5",
  "date_str": "2024-12-14",
  "description": "Bill & Melinda Gates Foundation Commits to Expanding…",
  "url_metadata": "https://pmd.gov.lk/news/bill-melinda-gates-foundation-commits-to-expanding-support-in-sri-lanka/",
  "lang": "en",
  "article_title": "Bill & Melinda Gates Foundation Commits to Expanding Support in Sri Lanka",
  "article_body_paragraphs": [
    "• Aligned with New Government’s Vision, Ready to Extend Support",
    "• Focus on Nutrition Projects, School Meal Programs, Agriculture Modernization, Digitalization, and Livestock Development",
    "The Bill & Melinda Gates Foundation has committed to expanding its initiatives in Sri Lanka.",
    "As part of this commitment, the Bill & Melinda Gates Foundation has agreed to provide the financial and technical assistance needed to implement nutrition projects, school meal programs for children, agriculture sector modernization project, digitalization efforts, and livestock development programs in Sri Lanka.",
    "This commitment was affirmed during a meeting held today (13) at the Presidential Secretariat. The discussion, chaired by Professor Anil Jayantha Fernando, Minister of Labour and Deputy Minister of Economic Development, involved officials from the Foundation.",
    "Recognizing the priorities of the new government, the Bill & Melinda Gates Foundation expressed its readiness to provide support whenever needed.",
    "Deputy Minister of Finance and Planning Dr. Harshana Suriyapperuma, Deputy Minister of Digital Economy Eng. Eranga Weerarathne, Secretary to the President Dr. Nandika Sanath Kumanayake, Senior Additional Secretary to the President Roshan Gamage, Chief Advisor to the President on Digital Economy Dr. Hans Wijayasuriya, Regional Representative for Southeast Asia at the Bill & Melinda Gates Foundation Dr. Jamal Khan and Director of Digital Public Infrastructure at the Bill & Melinda Gates Foundation were also present."
  ]
}