{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-01-01-en-7e1069",
  "num": "en-7e1069",
  "date_str": "2025-01-01",
  "description": "New Year Message",
  "url_metadata": "https://pmd.gov.lk/news/new-year-message/",
  "lang": "en",
  "article_title": "New Year Message",
  "article_body_paragraphs": [
    "As Sri Lankans, we step into 2025 with the dawn of a new era, a time when the dreams of prosperity that our nation and its people have long cherished begin to materialize.",
    "The parliamentary elections of 2024 enabled us to establish a government with a strong majority, earning the trust of people across the North, East, West, and South. With this mandate, we have initiated a transformative political shift, fulfilling our democratic responsibilities to build the good governance our citizens aspire to.",
    "Our primary developmental goals include eradicating rural poverty, implementing the “Clean Sri Lanka” initiative, and building a digital economy. The “Clean Sri Lanka” initiative, launched alongside the New Year, aims to uplift society to greater heights through social, environmental, and ethical revival.",
    "In 2024, we achieved significant economic stability as a nation. With this progress as our foundation, we move forward in 2025 with renewed vision and determination, working towards creating a prosperous nation and ensuring a beautiful life for everyone. I firmly believe this moment marks an exceptional opportunity to inspire new ideals and foster greater unity for the benefit of all.",
    "For the first time in Sri Lanka’s history since independence, we now have the chance to make the dream of a united and developed nation a reality through people-centered governance. This unparalleled responsibility rests upon all of us, and we fully understand its importance. In 2025, with courage and unwavering commitment, we will strive to regain the victories missed in the past century and bring these dreams to fruition.",
    "Wishing everyone a Happy New Year filled with prosperity, unity, and renewed hope as we strive for peace and progress together.",
    "Anura Kumara Disanayake\nPresident\nDemocratic Socialist Republic of Sri Lanka\n01st January, 2025"
  ]
}