{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-06-20-84e0b2",
  "num": "84e0b2",
  "date_str": "2025-06-20",
  "description": "Committees with Accountable District-Level Officials to be appointed…",
  "url_metadata": "https://pmd.gov.lk/news/committees-with-accountable-district-level-officials-to-be-appointed-to-resolve-human-elephant-conflict/",
  "lang": "en",
  "article_title": "Committees with Accountable District-Level Officials to be appointed to Resolve Human-Elephant Conflict",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake instructed relevant officials to swiftly implement a formal mechanism to resolve the human-elephant conflict, which significantly impacts both the rural economy and people’s lives.",
    "The President issued these directives during a discussion on resolving the human-elephant conflict, held this afternoon (20) at the Presidential Secretariat.",
    "During the discussion, particular attention was paid to the districts most affected by the human-elephant conflict, including Anuradhapura, Puttalam, Polonnaruwa, Ampara, Hambantota, Monaragala, Kurunegala, Badulla and Trincomalee. The respective District Secretaries presented the specific issues in their districts to the President.",
    "Discussions also covered existing vacancies within the Department of Wildlife, vehicle requirements and the challenges faced in carrying out their duties.",
    "The President emphasised the need to streamline the mechanism for resolving the human-elephant conflict and highlighted the importance of implementing this programme in close collaboration with the public.",
    "Accordingly, the President instructed that committees comprising accountable officials from the relevant districts be appointed within the next month to carry out these activities.",
    "The President also directed that retired officers be recruited on a contract basis to fill current vacancies in the Department of Wildlife. As an immediate measure, he instructed officials to assign Civil Security Department officers to the Department of Wildlife with specific training and to enact relevant legislation for this purpose.",
    "Furthermore, the President instructed that the ongoing joint operations by the Police, other security forces and the Department of Wildlife to resolve the human-elephant conflict be made more systematic and efficient.",
    "The event was attended by Professor Chandana Abeyrathne, Minister of Public Administration, Provincial Councils and Local Government; Ananda Wijepala, Minister of Public Security and Parliamentary Affairs; T.B. Sarath, Deputy Minister of Housing; Aruna Jayasekara, Deputy Minister of Defence; Dr. Nandika Sanath Kumanayake, Secretary to the President; Ranjan Marasinghe, Director General of Wildlife; Major General Lasantha Rodrigo, Army Commander; Priyantha Weerasuriya, Acting Inspector General of Police; as well as District Secretaries and other government officials."
  ]
}