{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-05-cc4a55",
  "num": "cc4a55",
  "date_str": "2025-08-05",
  "description": "A discussion between Sri Lankan Singers Association and…",
  "url_metadata": "https://pmd.gov.lk/news/a-discussion-between-sri-lankan-singers-association-and-the-president/",
  "lang": "en",
  "article_title": "A discussion between Sri Lankan Singers Association and the President",
  "article_body_paragraphs": [
    "A meeting between President Anura Kumara Dissanayake and the Sri Lankan Singers Association was held this afternoon (05) at the Presidential Secretariat.",
    "During the meeting, the Sri Lankan Singers Association requested the President to amend the necessary laws to grant full and legal rights to singers and composers, as well as lyricists, for a song.\nIt was highlighted that many well-known singers are facing an issue due to the fact that the lyricist and composer of a song hold exclusive rights under the Intellectual Property Act, preventing them from sharing songs on their social media. As a result, many professional singers have experienced unfair treatment. The Singers Association has urged the President to establish an Independent Committee to review these matters and propose the required legal amendments.\nThe President pointed out that this issue has persisted for a long time. He stated that a solution should be sought by studying existing international law and conventions built on technological needs, while also taking into account the facts presented by all parties mentioned above, to ensure fairness for everyone.",
    "Dr. Hiniduma Sunil Senevi, Minister of Buddhasasana, Religious and Cultural Affairs, Rohan de Silva, President of the Sri Lankan Singers Association, Nadeeka Guruge, Sujatha Attanayake, T.M. Jayaratne, Sunil Edirisinghe, Malkanthi Nandasiri, Jagath Wickremasinghe, Janaka Wickremasinghe, Rohana Bogoda, Somasiri Medagedara, Deepika Priyadarshani and Rodney Warnakula were among those who attended the event."
  ]
}