{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-31-en-d6f99f",
  "num": "en-d6f99f",
  "date_str": "2025-07-31",
  "description": "President Addresses Maldives Business Forum",
  "url_metadata": "https://pmd.gov.lk/news/president-addresses-maldives-business-forum/",
  "lang": "en",
  "article_title": "President Addresses Maldives Business Forum",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake attended Sri Lanka-Maldives Business Forum yesterday (30), held at JEN Maldives Malé Hotel. The forum was jointly organized by the Sri Lankan High Commission in the Maldives and the Sri Lanka-Maldives Business Council of the Ceylon Chamber of Commerce.",
    "The event aimed to invite the Maldivian business community to invest in Sri Lanka by showcasing the country’s high potential in sectors such as investment, trade and tourism.",
    "Addressing the Maldivian business community, President Dissanayake highlighted the opportunities and capabilities for strengthening economic cooperation between Sri Lanka and the Maldives. The President emphasized that since overcoming the 2022 economic crisis, Sri Lanka has achieved economic stability through robust reforms and international collaboration, making it a more conducive environment for investment.",
    "The President stated that challenges such as high inflation have now been brought under control and that Sri Lanka’s foreign reserves have been strengthened. He noted that at present the country is on a clear and stable economic path, with a projected 5% growth in 2025.",
    "President Dissanayake also emphasized the political stability established following the 2024 parliamentary election, where a two-thirds majority government was formed. Under the national vision of “A Thriving Nation – A Beautiful Life,” Sri Lanka is progressing toward transparent governance and a society free of corruption and irregularities.",
    "The President informed Maldivian investors about Sri Lanka’s investment-friendly environment and highlighted major opportunities in sectors such as tourism, food processing, fisheries, real estate, urban infrastructure and information and communication technology (ICT).",
    "Commending the strategies implemented by the Maldives to promote its tourism sector, the President emphasized the importance of regional cooperation in expanding the tourism industry within the Indian Ocean region. With Sri Lanka expecting 3 million tourist arrivals in 2025, he noted the great potential for Maldivian investors to invest in new hotel ventures.",
    "The President also pointed out the mutual benefits that could be achieved through enhanced collaboration in sectors such as fisheries, aquaculture and agro-processing.",
    "Special attention was given to the ICT sector, where Sri Lankan professionals have demonstrated strong capabilities in adopting emerging technologies such as AI, IoT and machinery learning. He stated that this offers considerable opportunities for fresh investments in the digital economy.",
    "Long-term investment opportunities were also discussed, particularly in areas like maritime logistics, urban development projects and luxury housing. The President assured that Sri Lanka is in the process of introducing the necessary legal reforms to protect investor rights and encourage new investments.",
    "The forum also spotlighted the Colombo Port City, which the President described as a future hub for finance, healthcare, education and innovation, offering immense investment potential as a modern financial and business area.",
    "Describing the Maldives not just as a neighbour but as Sri Lanka’s closest friend and trusted partner, President Dissanayake invited Maldivian entrepreneurs to become part of Sri Lanka’s forward journey by investing in its future.",
    "Maldivian Minister of Economic Development and Trade, Mohamed Saeed, also addressed the gathering, along with Mr. Sudesh Mendis, Chairman of the Sri Lanka–Maldives Business Council.",
    "A Q&A session followed, where the President and other officials responded to queries raised by members of the business community.",
    "Top Maldivian business leaders from sectors such as hospitality, F&B, healthcare, construction, maritime and trade participated in the forum. The event served as a valuable platform for meaningful dialogue and enhanced bilateral cooperation in these key areas.",
    "Representing the Government of Sri Lanka, Minister of Foreign Affairs, Foreign Employment and Tourism, Vijitha Herath, along with the Sri Lankan delegation, participated in the event. Officials from the Sri Lankan High Commission in the Maldives, including the Acting High Commissioner, were also in attendance."
  ]
}