{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-10-25-en-271a5b",
  "num": "en-271a5b",
  "date_str": "2024-10-25",
  "description": "EU Delegation Commits to Strengthen Sri Lanka-EU Relations,…",
  "url_metadata": "https://pmd.gov.lk/news/eu-delegation-commits-to-strengthen-sri-lanka-eu-relations-extends-presidential-greetings-from-key-european-leaders/",
  "lang": "en",
  "article_title": "EU Delegation Commits to Strengthen Sri Lanka-EU Relations, Extends Presidential Greetings from Key European Leaders",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake met with the European Union (EU) Delegation, led by EU Ambassador H.E. Carmen Moreno, today (25) at the Presidential Secretariat.",
    "The President informed the EU Delegation about Sri Lanka’s current security situation, highlighting recent measures to improve safety for tourists and residents. He assured that security protocols in key tourist areas are strengthened with more law enforcement and emergency services deployed.",
    "The European Union is a critical partner for Sri Lanka, serving as its second-largest export and tourist market, and third-largest import market.",
    "The EU Delegation reaffirmed its commitment to supporting Sri Lanka in expanding its market access, enhancing employment opportunities within the EU, and boosting tourism. Additionally, the EU pledged support for knowledge exchange and implementing new mechanisms in education, social protection, and anti-corruption efforts.",
    "The Delegation emphasized the EU’s commitment to strengthening key sectors, including vocational education, maritime, investment, and the peace and reconciliation process. They also assured close collaboration to advance these shared priorities.",
    "The Delegation commended Sri Lanka on the peaceful conduct of the recent Presidential Election.",
    "Furthermore, ambassadors from the Kingdom of the Netherlands, France, and Romania conveyed congratulatory messages from their respective Presidents to President Dissanayake.",
    "The EU Delegation included H.E. Felix Neumann, Ambassador of Germany; H.E. Damiano Francovigh, Ambassador of Italy; H.E. Steluta Arhire, Ambassador of Romania; and Chargé d’Affaires Ms. Marie-Noelle Duris of France and Mr. Iwams Rutjens of the Netherlands."
  ]
}