{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-15-en-06743f",
  "num": "en-06743f",
  "date_str": "2025-05-15",
  "description": "President Approves Establishment of Anti-Corruption Investigation Units in…",
  "url_metadata": "https://pmd.gov.lk/news/president-approves-establishment-of-anti-corruption-investigation-units-in-provincial-councils-and-lg-institutions/",
  "lang": "en",
  "article_title": "President Approves Establishment of Anti-Corruption Investigation Units in Provincial Councils and LG Institutions",
  "article_body_paragraphs": [
    "– President",
    "President Anura Kumara Disanayake has approved the establishment of dedicated anti-corruption investigation units within provincial councils and local government institutions, aiming to combat corruption and administrative inefficiencies. The decision follows a request by provincial governors during a high-level discussion held at the Presidential Secretariat today (15).",
    "During the meeting, President Disanayake emphasised that provincial governors bear the primary responsibility for driving development initiatives and ensuring accountability within their respective provinces. He noted, “Strengthening governance mechanisms is critical to addressing systemic challenges and achieving equitable progress.”",
    "Among the key decisions taken was the creation of anti-corruption investigation units modelled after similar bodies operating at the ministerial level. These units will be tasked with monitoring financial transactions, investigating irregularities and enforcing transparency in development projects. The initiative aligns with the government’s broader agenda to eliminate malpractice in public institutions.",
    "The discussion also highlighted that provincial councils have received three times the financial allocations compared to the previous fiscal year. However, governors raised concerns regarding delays and bureaucratic hurdles in utilising these funds effectively. In response, President Disanayake directed officials to streamline procedures and adopt results-oriented mechanisms to accelerate infrastructure development.",
    "Persistent obstacles in upgrading provincial infrastructure such as road networks, healthcare facilities and utility services, were also discussed. The President pledged to implement practical solutions to address these challenges and urged governors to prioritise projects that deliver tangible benefits to citizens.\nThe Governors further stressed the need for improved coordination between provincial councils and central ministries to avoid duplication of efforts. Acknowledging these concerns, President Disanayake underlined the importance of collaborative governance to ensure efficient resource allocation.",
    "“While increased funding is a positive step, its prudent management is non-negotiable. Provincial authorities must ensure every rupee is accounted for and spent efficiently,” he asserted.",
    "The meeting was attended by several senior officials, including Dr. Nandika Sanath Kumanayake, Secretary to the President, Kapila Janaka Bandara, Senior Additional Secretary to the President, Provincial Governors: Hanif Yusuf (Western Province), Sarath Bandara Samarasinghe Abayakon (Central Province), Bandula Harischandra (Southern Province), Tissa Kumarasiri Warnasuriya (North Western Province), Wasantha Kumara Wimalasiri (North Central Province), Nagalingam Vedanayagam (Northern Province), Prof. Jayantha Lal Ratnasekera (Eastern Province), Champa Janaki Rajaratne (Sabaragamuwa Province) and Kapila Jayasekara (Uva Province)."
  ]
}