{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-25-en-435720",
  "num": "en-435720",
  "date_str": "2025-04-25",
  "description": "Statement by the Government of Sri Lanka on…",
  "url_metadata": "https://pmd.gov.lk/news/statement-by-the-government-of-sri-lanka-on-discussions-held-in-washington-dc-with-united-states-trade-representative-ustr-office-on-reciprocal-tariff/",
  "lang": "en",
  "article_title": "Statement by the Government of Sri Lanka on discussions held in Washington DC with United States Trade Representative (USTR) Office on reciprocal tariff",
  "article_body_paragraphs": [
    "A Sri Lankan delegation met with US Trade Representative Ambassador Jamieson Greer on the 22nd of April, 2025 at the US Trade Representative Office in Washington D.C.",
    "Sri Lankan delegation on the instructions of President Anura Kumara Disanayaka, who is also the Minister of Finance, handed over the originals of communications addressed to US Trade Representative Ambassador Greer on behalf of the Government of Sri Lanka.",
    "The delegation updated Ambassador Greer on the challenges that Sri Lanka has faced in the past and the steps that are been taken by the Government of Sri Lanka to overcome future challenges and move towards full economic recovery. Sri Lankan delegation highlighted the prompt and positive commitment of the Government of Sri Lanka to work with the US Government in reducing the trade deficit, and lowering tariff and non-tariff barriers.",
    "Ambassador Greer was appreciative of the proposals that Sri Lanka has made in order to commence negotiations and expressed the hope that an agreement can be reached soon between two countries to ensure fair and equitable trade relations.",
    "Later on that day, the Sri Lankan delegation met with the USTR delegation appointed by Ambassador Greer lead by Assistant United States Trade Representative, In-charge of South and Central Asia, Brendan Lynch along with Director In-charge of South Asia, Emily Ashby to discuss further the offer made in writing by Sri Lanka to the US. The two sides agreed to continue the discussions with the objective of finalizing a bilateral trade agreement between the two countries. Both sides expressed the desire to finalize the agreement in the shortest possible time period.",
    "The Office of the U.S. Trade Representative (USTR) is responsible for developing and coordinating U.S. international trade, commodity, and direct investment policy, and overseeing negotiations with other countries. The head of USTR is the U.S. Trade Representative, a Cabinet member who serves as the president’s principal trade advisor, negotiator, and spokesperson on trade issues."
  ]
}