{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-07-01-3da08b",
  "num": "3da08b",
  "date_str": "2025-07-01",
  "description": "Media Heads Briefed on ‘Praja Shakthi’ National Programme",
  "url_metadata": "https://pmd.gov.lk/news/media-heads-briefed-on-praja-shakthi-national-programme/",
  "lang": "en",
  "article_title": "Media Heads Briefed on ‘Praja Shakthi’ National Programme",
  "article_body_paragraphs": [
    "A workshop to enhance awareness among media organizations regarding the “Praja Shakthi” national programme, one of the current government’s key initiatives aimed at empowering communities and ensuring equitable distribution of economic advantages was held yesterday afternoon (30) at the Presidential Secretariat, under the patronage of Senior Additional Secretary to the President, Kapila Janaka Bandara. The workshop also aimed to gather feedback and suggestions from media representatives.",
    "Aligned with the government’s policy statement, the “Praja Shakthi” programme is scheduled to be officially launched on Friday (04) under the patronage of President Anura Kumara Disanayake. It adopts a multifaceted approach to community empowerment, with a strong focus on structured social protection for vulnerable groups.",
    "Currently, one in every six Sri Lankans suffers from multidimensional poverty, with approximately 95.3% of this population residing in rural and estate sectors. The continued persistence of this condition negatively impacts the country’s economy and production systems. In response, the “Praja Shakthi” programme aims to systematically address these disparities by strengthening communities and implementing targeted social safety nets.",
    "Unlike previous anti-poverty initiatives that were often fragmented across different governments, this programme marks a significant shift by adopting an integrated approach focused on community empowerment.",
    "Notably, the education sector long regarded as a key driver in alleviating poverty has not been formally recognized as a core part of these efforts. The new initiative intends to correct this by incorporating education alongside other key sectors such as health, transportation, food security and marketing.",
    "As part of this new strategic direction, three structural reforms have been proposed to implement the “Praja Shakthi” programme effectively:",
    "At the national level, a National Policy Council on “Praja Shakthi”, chaired by the President and comprising nine Cabinet Ministers, has already been established. Its aim is to guide the implementation of the programme, with the Minister of Rural Development, Social Security, and Community Empowerment, Upali Pannilage, serving as convener.",
    "To execute the policy council’s decisions, a “Praja Shakthi” National Operations Committee has been set up under the chairmanship of the same Minister. Its members include nine Ministry Secretaries and Provincial Chief Secretaries. The committee’s Secretary and Convener is the Senior Additional Secretary to the President (Development Administration).",
    "A Community Development Council will be formed at the Grama Niladhari Division level to oversee this national programme in collaboration with Regional Coordination Committees, District Coordination Committees, Ministries and Provincial Councils, extending to the national level. The Chairman of this Committee will be designated by the Chairman of the Regional Development Committee, while an officer from the Divisional Secretariat will serve as the Secretary.",
    "These councils are tasked with identifying development priorities and vulnerable groups requiring social protection. Membership will include representatives from all community segments academics, entrepreneurs, businesspersons, industrialists and public servants.",
    "Speaking at the workshop, Senior Additional Secretary to the President Kapila Janaka Bandara emphasized that, in line with the government’s policy vision of “A Thriving Nation – A Beautiful Life,” three key programmes are being prioritized. Among them, the “Praja Shakthi” programme aims to ensure that the short-term economic gains achieved through digital economy and other development initiatives are fairly distributed among all citizens.",
    "He further explained that a truly prosperous, safe and stable country cannot be built solely through policy and infrastructure it must also reflect in the social environment in which citizens live. Therefore, the government is prioritizing strategies that promote inclusive development and civic dignity.",
    "While the government is working to build a “Thriving Nation” by transforming the living environment, the responsibility of creating a “beautiful life” lies with the citizens, said Senior Additional Secretary to the President. He explained that this involves elevating one’s life and surroundings to a higher level socially, ethically and environmentally. To support this goal, the government has launched the “Clean Sri Lanka” programme, which he noted will pave the way for citizens to lead complete, dignified, modern and proud lives.",
    "Senior Media Advisor to the President Chandana Sooriyabandara, also addressed the gathering and underscored the role of media professionals and institutions in supporting this mission. He highlighted the potential for media creativity to build a bridge between government initiatives and the public.",
    "The workshop was attended by Director General of the Government Information, Harsha Bandara, along with heads and representatives of both state and private media organizations.",
    ""
  ]
}