{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-20-08-2025-20-08-114766",
  "num": "2025-20-08-114766",
  "date_str": "2025-20-08",
  "description": "Students from Deltota Karagaskada Central College and Katugastota…",
  "url_metadata": "https://pmd.gov.lk/news/students-from-deltota-karagaskada-central-college-and-katugastota-uduwawala-junior-school-visit-the-presidential-secretariat/",
  "lang": "en",
  "article_title": "Students from Deltota Karagaskada Central College and Katugastota Uduwawala Junior School Visit the Presidential Secretariat",
  "article_body_paragraphs": [
    "Students from Deltota Karagaskada Central College and Katugastota Uduwawala Junior School in Kandy were given the opportunity to participate in the ‘Vision’ programme, organised by the Presidential Secretariat, yesterday (19).",
    "This programme is a joint initiative by the Presidential Secretariat, the Ministry of Education, and Department of Communication of the Parliament, aimed at schoolchildren.",
    "Mr. Roshan Gamage, the Senior Additional Secretary to the President, provided an overview of the services offered to the public by the President’s Fund, as well as the scholarships and benefits available to students.",
    "Mr. Gamage highlighted that the President’s Fund is prepared to help schoolchildren facing economic hardships build a brighter future without giving up their education. He added that the fund is working to operate at a regional level to expedite these efforts.\nAs part of the programme, valuable saplings were presented to the schools as a gift, symbolising the importance of environmental conservation.",
    "Mr. Dharmasiri Gamage, Director General of Public Relations at the Presidential Secretariat, Air Commodore Asiri Gallage, the Director of the Tri-Forces Coordination Unit at the Presidential Secretariat and Major Nadeeka Dangolla, the Assistant Director, also attended the event. The principals, teachers and parents from the schools were also in attendance."
  ]
}