{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-05-2d6490",
  "num": "2d6490",
  "date_str": "2025-04-05",
  "description": "Tri-Forces Special Team Departs for Myanmar to Provide…",
  "url_metadata": "https://pmd.gov.lk/news/tri-forces-special-team-departs-for-myanmar-to-provide-disaster-relief/",
  "lang": "en",
  "article_title": "Tri-Forces Special Team Departs for Myanmar to Provide Disaster Relief",
  "article_body_paragraphs": [
    "A specialized medical and disaster relief team, consisting of 26 members from the Sri Lanka tri-services led by Brigadier Punya Karunathilake, has departed for Myanmar on a special flight today, (April 5), to assist those affected by the recent earthquake.",
    "These disaster relief operations are being conducted under the supervision of Secretary to the Ministry of Defence, Air Vice Marshal Sampath Thuyacontha (Retd), following directives from President Anura Kumara Disanayake. It is noteworthy that the tri-service Commanders promptly mobilized these special relief teams within a very short timeframe.",
    "Myanmar, a Buddhist nation that has significantly contributed to the re-establishment of Theravada Buddhism in Sri Lanka, is receiving not only disaster and humanitarian aid but also essential supplies, including medical assistance. These supplies were donated and collected by the people of Sri Lanka nationwide, under the guidance of the Venerable Maha Sangha, led by the Chief Prelates of the three Buddhist chapters, and are being sent to the Myanmar government.",
    "The Ministry of Foreign Affairs, under the leadership of the Minister of Foreign Affairs and the Secretary to the Ministry, played a crucial role in coordinating the diplomatic arrangements for this mission. Sri Lanka’s national carrier, SriLankan Airlines, has also supported this humanitarian effort.",
    "These operations reflect Sri Lanka’s commitment, alongside the Ministry of Defence and the tri-forces, to enhancing regional cooperation and providing essential support to friendly nations in times of crisis."
  ]
}