{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-07-09-c0da7f",
  "num": "c0da7f",
  "date_str": "2025-07-09",
  "description": "New Committee Formed to Identify National Research Priorities",
  "url_metadata": "https://pmd.gov.lk/news/new-committee-formed-to-identify-national-research-priorities/",
  "lang": "en",
  "article_title": "New Committee Formed to Identify National Research Priorities",
  "article_body_paragraphs": [
    "Marking a significant milestone in Sri Lanka’s research and development sector, an ad-hoc committee was established on the 7th of this month (July) for the first time in the country, to identify and prioritise national research needs. The primary objective of this committee is to classify various research initiatives being conducted nationwide according to their priority, based on national development goals and national requirements.",
    "The committee is co-chaired by Professor Gomika Udugamasooriya, Senior Advisor to the President on Science and Technology and Professor Rohan Fernando, Chairman of the National Science and Technology Commission (NASTEC) under the Ministry of Science and Technology. It comprises 20 leading experts from diverse fields.",
    "Other key functions of this committee include aligning research and development policies implemented in universities, research institutes, industries and government organisations with national development goals. It also aims to encourage the allocation of national budget funds for the research and development sector based on research priorities, to ensure efficient utilisation of these funds.",
    "For a long time, Sri Lanka’s research and development sector has operated as an isolated, fragmented and scattered system.",
    "Consequently, it often failed to make a significant impact on the country’s economic expansion or societal advancement. With the establishment of this committee, the government hopes to create a more efficient, strategic and socially responsive research and development sector. This will be achieved by gathering data from grassroots to ministerial levels through institutional reports from stakeholders and national-level surveys.",
    "Furthermore, another objective is to extend data-driven decision-making and financial accountability to the research and development sector."
  ]
}