{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-02-21-b731c3",
  "num": "b731c3",
  "date_str": "2025-02-21",
  "description": "“Let’s Be the First Link in Nation-Building,”",
  "url_metadata": "https://pmd.gov.lk/news/lets-be-the-first-link-in-nation-building/",
  "lang": "en",
  "article_title": "“Let’s Be the First Link in Nation-Building,”",
  "article_body_paragraphs": [
    "“Clean Sri Lanka School Program” Launched",
    "As part of a key government initiative, the “Clean Sri Lanka Programme” is being introduced into the school system. The first phase of this initiative, which aims to be implemented in 1,000 schools, was launched yesterday (20) in 200 selected schools across the country.",
    "This program, implemented under the theme “”Let’s Clean Our School –“Let’s Be the First Link in Nation-Building,” is led by the school community, including the principals of the respective schools.",
    "Members of the Tri-Forces provide the necessary labour support and technical expertise to facilitate the initiative.",
    "As part of the program, essential repairs are being carried out in schools, including fixing damaged desks and chairs, repairing equipment, and restoring electrical and water supply systems. Additionally, school premises are being cleaned and maintained. In the first phase, the program will be implemented in 100 schools with the support of the Army, while the Navy is assisting 50 schools and 50 schools will receive support from the Air Force.",
    "The program is set to cover 1,000 schools by the end of March.",
    "A key highlight of this initiative is the active participation of students, teachers, parents and alumni, and they will be provided with the necessary training to ensure the on-going maintenance and cleanliness of the school.",
    "Marking the official launch of the program, the Sri Lanka Air Force commenced activities at WP/CO/ Mahawatta St. Anthony’s Sinhala Vidyalaya yesterday (20). Simultaneously, the program was implemented in 199 other schools across the country under the leadership of zonal and provincial education directors, school principals, and representatives from security forces."
  ]
}