{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-12-5ebee8",
  "num": "5ebee8",
  "date_str": "2025-08-12",
  "description": "National Youth Conference proudly held after 32 years",
  "url_metadata": "https://pmd.gov.lk/news/national-youth-conference-proudly-held-after-32-years/",
  "lang": "en",
  "article_title": "National Youth Conference proudly held after 32 years",
  "article_body_paragraphs": [
    "– President",
    "President Anura Kumara Dissanayake stated that, with the beginning of the new political transformation, the youth movement in the country has transitioned from being a political pawn to a platform that cultivates competent leaders prepared to lead the nation’s future.",
    "The President stressed that the government’s goal is to establish a youth community empowered to shape its own future, ensuring that young people are given their rightful role, rather than merely serving as contributors to the maintenance of political power. He further stated that a programme will be launched through the youth movement to transform young men and women into leaders and stakeholders in the country’s development path.",
    "President Dissanayake made these remarks this morning (12) addressing the “Youth Club” National Youth Conference held at the Sugathadasa Indoor Stadium in Colombo.",
    "The President highlighted that the future generation should be one that represents Sri Lanka proudly on the global stage and is guided by empathy towards others. He stressed that the government is committed to creating such a qualified generation to take over the country’s future, while calling upon all youth across the nation to strive to become those capable leaders.",
    "This year’s National Youth Conference was notable for being held after a lapse of 32 years, with the participation of over 6,000 young men and women from across the island. In the lead-up to the conference, “Youth Clubs” were established at the regional level throughout the country and during today’s national gathering, the newly appointed officers were officially introduced.",
    "In conjunction with his participation in the National Youth Conference, President Anura Kumara Dissanayake was also presented with a commemorative gift.",
    "Addressing the Conference, President Dissanayake further stated:",
    "“I believe this is the most-discussed and most-anticipated youth conference in recent times. Generally, in our country, many sectors have been driven by the desire for political power. Within the youth movement, there has never truly been an opportunity for individuals to progress based on their own talents and aspirations.",
    "When you visited the districts, who were given precedence in taking on political leadership or leading other institutions in your district? Priority was given to the daughters, sons or relatives of the old political leadership. As a result, the youth movement was largely aligned with the political ambitions of those in power. For a long time, this youth movement was developed as a tool to protect their own political influence, maintain family power and keep leadership within their kinship networks.",
    "However, with the new political transformation in the country, this youth movement has evolved beyond being merely a pawn of political ambitions. It has transformed into a movement that nurtures leaders who will take responsibility for the country’s future. This transformation has been clearly reflected throughout our journey up to this National Youth Conference.",
    "It’s no surprise that some feel uneasy. Today, what we are truly doing is empowering our youth by giving them their rightful place and helping build a responsible young leadership that understands how their future should be shaped and what duties they must bear. This is not about creating mere tools to maintain family dynasties or political power for extended periods. There’s talk that the future of the country lies in the hands of its youth. But our true ambition is to make you the real custodians of that future, those who genuinely hold the responsibility for our nation’s path forward.",
    "Specifically, there is one point we want to make clear to you here. Today, we hold positions such as the Presidency, Ministerial offices and Parliamentary seats. However, even as we occupy these roles, we do so with the firm understanding that there will come a day when we will step aside. We have no intention of clinging to these positions indefinitely. We have a very clear and sincere intention. This country was once under the control of a highly destructive group. We have taken over political power from that group. The power we now hold, we do so with the expectation that, in due course, we will pass the baton to you, the next generation. We do not wish to stay in these roles for an extended duration.",
    "Therefore, we must nurture a new generation of young leaders who possess the ability, competence, integrity and conscience to take responsibility for the country. We need to prepare a generation ready to inherit this nation after us. What kind of generation do we need? In today’s fast-paced world, knowledge is rapidly produced, developed and disseminated. Looking back at history, great leaps in knowledge were achieved over long periods of time. However, today, the knowledge we already possess is rapidly generating new knowledge at an unprecedented pace. Moreover, this new knowledge is growing and spreading quickly. The future of the country must not be entrusted to a generation of youth who are unprepared to grasp and harness these vast and rapidly expanding realms of knowledge.",
    "Therefore, our aspiration is to create a new generation for the youth movement, one that rapidly adjusts the fast-growing knowledge of the modern world and quickly adapts to it. We stand firm in the belief that the future of our country must be entrusted to this new generation. Furthermore, compassion and empathy must be inherent within us.",
    "Currently, our education system and way of life have confined our youth within a self-centred shell. Within such a group, genuine empathy towards society is lacking. This is why we need a young generation that truly cares for the broader community. Self-centeredness has frozen and destroyed many valuable qualities in our society, extinguishing much of what is good.",
    "To lead our country forward and achieve meaningful social development, it is essential to build a society rooted in genuine empathy. In this endeavour, the youth movement has been entrusted with a significant role. I firmly believe that you must become citizens who embody empathy and compassion.",
    "Similarly, the innate desire for justice and fairness among the youth must be rejuvenated. Wherever injustice exists, there should be a courageous voice to speak up for justice. For such a voice to be genuine and not merely superficial, one must first become a person who truly values justice and acts with fairness. Unfortunately, a significant portion of our society today is driven by deception, many speak about justice and strive to appear as champions of fairness, but we must honestly reflect on how deeply justice and fairness are actually embraced in their actions.",
    "Raising a voice for justice alone does not transform someone into a just and principled individual. The primary measure of becoming a just citizen lies in how sincerely one upholds justice and acts fairly. Therefore, before you raise your voice for justice and stand for fairness, become a young person with a genuine conscience who truly embodies justice and fairness. We are not entrusting this country to a mere crowd, rather, we are handing over the future of the nation to a new generation that is closely connected to the world and possesses empathy for society. Hence, our mission is to build a youth movement qualified to take responsibility for this country’s future. I urge you to become that qualified young generation.",
    "Today, an issue regarding employment has arisen. Recently, I visited the Maldives, where nearly 30,000 of our young men and women are engaged in jobs. However, these are not government positions. The government there has developed a distinct economy externally. Yet, we have long failed to build an economy that generates employment for skilled and capable people in the informal sector. As a result of this failure, the state itself has become an institution that merely provides jobs. It must not be forgotten that a government should be an institution that creates employment, not just one that supplies jobs.",
    "We all know that the 20th century witnessed major transformations worldwide. Before that century, scientists predicted that states equipped with advanced technology would emerge. Politicians and scholars envisioned the creation of a political world quite different from before, one governed not by monarchies or ruling elites but by governments elected by the people. Similarly, economic experts foresaw the development of new global economic conditions. In this way, what we mostly encountered during the 17th and 18th centuries were only speculative ideas about the future world. These speculations became a reality only in the 20th century.",
    "Due to transformations in technology, science, the marketplace and people’s lifestyles, a vast global market has emerged. However, we have become a nation that has failed to fully grasp and benefit from this market. As a result, an informal economy has not been developed and the government has become the sole institution providing employment.",
    "We need to modernize a government that has become largely stagnant. To this end, Cabinet approval has been granted to recruit nearly 62,000 people into the public service. However, the employment issue cannot be solved merely by this. We must create an open economy through government processes that generates employment opportunities. Plans have already been prepared toward this goal.",
    "We expect that 2.5 million tourists will visit our country this year, and by 2030, this number is anticipated to grow to 4 million. Along with this growth, an economy based on the tourism industry will be established in the open market, and this economy will generate employment opportunities.",
    "We also anticipate that by 2030, the digital economy will grow to reach US $ 15 billion. Our goal is for the digital economy to contribute 12% of the country’s national output. Additionally, we expect a significant transformation through the digitization of agriculture, fisheries and small and medium-scale industries. To achieve this, we need a young generation equipped with knowledge and skills in information technology. This will also create new employment opportunities. Furthermore, we have planned a large-scale economy based on various sectors, including a port-centric economy.",
    "Accordingly, our strategy involves government intervention to build a nation that generates employment.",
    "We aim to create within the country job opportunities that allow our youth to engage in professions they desire, based on their abilities and lifestyles. Moreover, we have successfully established a trusted and stable economy today. Building on this stability, we are ready to embark on the journey of transforming the country into a prosperous state. In this process, the youth bear a great responsibility.",
    "You possess knowledge and enthusiasm. Through this youth movement, we are prepared to launch a programme aimed at empowering you to become the leaders and pillars of this development. You are not excluded from progress, nor are you obstacles to it. Our goal is to establish you as key stakeholders in the development pathway we have designed.",
    "After overcoming a significant and challenging background, you have formed a leadership team. I believe this will enable these young men and women to provide excellent leadership to the country’s youth movement. I wish you success in overcoming the challenges ahead.",
    "This occasion was also graced by the presence of Minister of Youth Affairs and Sports, Sunil Kumara Gamage, Deputy Minister of Youth Affairs, Eranga Gunasekara, Deputy Minister of Sports, Sugath Thilakaratne, Members of Parliament, foreign Ambassadors, government officials and invited guests, including Chairman/Director General of the National Youth Services Council Attorney-at-Law Supun Wijerathna."
  ]
}