{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-01-28-202899",
  "num": "202899",
  "date_str": "2025-01-28",
  "description": "Govt. to make all necessary decisions to secure…",
  "url_metadata": "https://pmd.gov.lk/news/govt-to-make-all-necessary-decisions-to-secure-the-future-of-the-country-and-improve-citizens-living-standards/",
  "lang": "en",
  "article_title": "Govt. to make all necessary decisions to secure the future of the country and improve Citizens’ Living Standards",
  "article_body_paragraphs": [
    "– President at the International Customs Day Celebration",
    "President Anura Kumara Disanayake stated that the current government is determined to make all necessary decisions for the country’s advancement and to improve the quality of life for its citizens.",
    "The president expressed these views during an event held yesterday (27) at the Customs Department Auditorium to mark International Customs Day under the theme, ‘Customs Delivering on its Commitment to Efficiency, Security and Prosperity.’",
    "The Customs Co-operation Council (CCC), established in 1952 with the participation of 17 European countries is independent intergovernmental body whose mission is to enhance the effectiveness and efficiency of Customs administrations. This council quickly became globally recognized, and Sri Lanka became a member in 1967. In 1994, the Customs Cooperation Council was renamed the World Customs Organization (WCO).",
    "The first session of the Customs Cooperation Council was held on January 26, 1953, in Brussels, Belgium, marking the establishment of International Customs Day. As a result, every year on January 26, customs administration institutions across the world celebrate International Customs Day.",
    "The President also mentioned that necessary actions are being taken to create a modern organizational structure, with structural reforms being implemented within Sri Lanka Customs, the Department of Excise, and the Department of Inland Revenue.",
    "The President stated that laws and institutions must evolve to meet the challenges of the times and cannot remain static or permanent indefinitely.",
    "Elaborating further, President Disanayake shared the following insights:\nCustoms successfully fulfilled its responsibilities over the past year, and its efforts in stabilizing the economy are highly commendable. The achievements in meeting last year’s targets are being appropriately recognized.",
    "However, simply achieving revenue targets is not enough to rebuild a collapsed economy. Addressing the economic crisis requires increasing the revenue-to-GDP ratio. The economic collapse has significantly disrupted the import-export market.",
    "All of our actions are currently being carried out within the parameters set by the International Monetary Fund (IMF). While surface-level indicators may suggest economic recovery, the overall economy remains deeply damaged. Therefore, it is essential to approach the recovery process cautiously and with balance. Even a small mistake can cause significant disruptions to the economy. Therefore, the Customs Department must work collectively to achieve its targeted revenue of Rs. 2,550 billion.",
    "A proposal has been submitted to improve facilities for Customs and establish a new salary structure. Discussions are underway with the Ministry of Finance and the Treasury to provide solutions.",
    "This year’s budget has already addressed the increase in the basic salaries of public sector employees. Additionally, plans are in place to enhance the efficiency of the public service by integrating digitalization and technology. Efforts are also being made to implement legal reforms to build strong institutional frameworks.",
    "There were conflicts between previous political administrations and the state service mechanism. Due to these disagreements, the political leadership failed to implement the necessary reforms to strengthen institutional frameworks at the right time. It was a challenging period to establish robust institutional structures.",
    "The failure to introduce timely institutional changes resulted in the expected outcomes not being achieved. Consequently, before we could secure many opportunities for ourselves, external parties took advantage of our resources. As a result, Sri Lanka missed several opportunities to leverage its natural strategic position as a nation.",
    "In the future, necessary measures must be taken to facilitate operations at the Sri Lanka Port, targeting a capacity of 11.3 million containers. Achieving this will require collective effort from all employees. Without such unity, the country cannot move forward. This year, the Customs Department has been assigned a revenue target of LKR 2,550 billion.",
    "President Anura Kumara Disanayake presented merit certificates issued by the World Customs Organization to 20 Customs officers in recognition of their outstanding contributions to special operations. Additionally, two officers were honoured with skills awards during the event.",
    "The Director General of Customs also presented a commemorative plaque to President Anura Kumara Disanayake to mark the occasion.",
    "The event was attended by key dignitaries, including Minister of Labour and Deputy Minister of Economic Development Dr. Anil Jayantha Fernando, Governor of the Central Bank Dr. Nandalal Weerasinghe, Deputy Minister of Finance and Planning Harshana Suriyapperuma, Attorney General Parinda Ranasinghe, Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Finance Mahinda Siriwardena, Director General of Customs Sarath Nonis, and other officials from the Customs Department."
  ]
}