{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-10-14-en-582cf5",
  "num": "en-582cf5",
  "date_str": "2024-10-14",
  "description": "UNDP Pledges Support for Governance and Economic Reforms…",
  "url_metadata": "https://pmd.gov.lk/news/undp-pledges-support-for-governance-and-economic-reforms-during-meeting-with-president-anura-kumara-dissanayake/",
  "lang": "en",
  "article_title": "UNDP Pledges Support for Governance and Economic Reforms During Meeting with President Anura Kumara Dissanayake",
  "article_body_paragraphs": [
    "Kanni Wignaraja, the Assistant Secretary General of the United Nations (UN), met with President Anura Kumara Dissanayake this morning (14) at the Presidential Secretariat. The discussion primarily focused on governance, constitutional reforms, and the country’s electoral system.",
    "Ms. Wignaraja presented the report on “Understanding Multidimensional Vulnerabilities: Impact on the People of Sri Lanka” to President Dissanayake. Based on the findings of this report, the United Nations Development Programme (UNDP) assured its support for Sri Lanka’s development efforts.",
    "A key point of discussion was the low level of women’s participation in the economy. The UNDP noted that rural women face significant challenges in financial literacy, limiting their involvement in economic activities. The farming sector, in particular, suffers from poor economic literacy, resulting in underrepresentation in the national economy. The UNDP expressed willingness to assist with digitalization programs, highlighting it as a critical tool to minimize corruption.",
    "Discussing Sri Lanka’s low agricultural productivity compared to other Asian nations, President Dissanayake explained that many farmers have small plots of land and do not view farming as their primary source of income. To address this, the government plans to strengthen farmers’ associations, which would help improve bargaining power and agricultural activities.",
    "Discussing reforms to the electoral system, President Dissanayake pointed out such reforms should ensure inclusive representation of ethnic and religious communities.",
    "Addressing concerns over the microfinance sector, the President explained the interests are unfair and that the current administration plans to establish a new development bank to support the microfinance sector, with a focus on greater involvement of women. The government also plans to provide Treasury guarantees for the best proposals submitted by women entrepreneurs to help them secure capital.",
    "The UNDP reaffirmed its commitment to supporting the government’s reforms, anti-corruption efforts, and increasing women’s participation in both the economy and Parliament.",
    "Azusa Kubota, Resident Representative of the UNDP in Sri Lanka, along with Fadhil Bakeer Markar, Team Leader for Strategic Engagement, Digital, and Innovation, also participated in the discussion."
  ]
}