{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-06-17-a532b3",
  "num": "a532b3",
  "date_str": "2025-06-17",
  "description": "Government Focuses on Developing a Unique Food Security…",
  "url_metadata": "https://pmd.gov.lk/news/government-focuses-on-developing-a-unique-food-security-index-for-sri-lanka/",
  "lang": "en",
  "article_title": "Government Focuses on Developing a Unique Food Security Index for Sri Lanka",
  "article_body_paragraphs": [
    "The government is currently prioritizing the development of a country-specific Food Security Index, with the goal of completing the initiative within the next three months.",
    "This tailored index is expected to better reflect Sri Lanka’s unique food security landscape, addressing the limitations of global indices such as the Global Food Security Index (GFSI), which have been criticized for failing to capture the nuances of the local context. Policymakers have also noted that existing data is often insufficient or imprecise, making it challenging to develop effective strategies.",
    "The proposed index aims to identify key national priorities and guide food security policy over the next five years.",
    "As a first step in this effort, a workshop titled “Identifying a Suitable Food Security Index for Sri Lanka and Formulating a Strategic Plan” was held today (17) at the Colombo City Center. Organized by the Food Security Expert Committee in collaboration with the Food and Agriculture Organization (FAO) and the World Food Programme (WFP), the event brought together experts and stakeholders from across the sector.",
    "Delivering the opening remarks, Senior Additional Secretary to the President Kapila Gunaratne emphasized the importance of the initiative, stating that the development of a precise, country-specific index is a vital step toward ensuring both economic stability and national food security. The workshop focused on the four key dimensions of food security; availability, accessibility, utilization and stability and explored how these can be incorporated into a comprehensive and practical national index.",
    "Participants included members of the Food Security Expert Committee, such as Senior Professors Buddhi Marambe and Jeevika Weerahewa, along with representatives from various government agencies, academic institutions, the FAO, the WFP and the private sector."
  ]
}