{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-01-26-en-35b1e1",
  "num": "en-35b1e1",
  "date_str": "2025-01-26",
  "description": "Enhancing Public Service as a Fundamental Citizen Right…",
  "url_metadata": "https://pmd.gov.lk/news/enhancing-public-service-as-a-fundamental-citizen-right-and-responsibility-of-public-officials/",
  "lang": "en",
  "article_title": "Enhancing Public Service as a Fundamental Citizen Right and Responsibility of Public Officials.",
  "article_body_paragraphs": [
    "– President Anura Kumara Disanayake",
    "President Anura Kumara Disanayake emphasized that the government is taking steps to strengthen the public service as a right of the citizen and a responsibility of public officials.",
    "Highlighting the dissatisfaction among citizens regarding the current public service, the President stated that the government aims to deliver efficient services to citizens through the digitization of government services.",
    "These remarks were made by President Anura Kumara Disanayake during the Anuradhapura District Coordination Committee meeting held today (26) at the Anuradhapura District Secretariat.",
    "The President revealed that efforts are underway to establish an accurate data system for the public service by June and pointed out the significant complexity in the current volume of data within the public service, which hampers the ability to make precise decisions.",
    "President Disanayake also disclosed that proposals to provide a fair basic salary increase for public officials and to resolve pension disparities within three years will be included in this year’s budget.",
    "The meeting also focused on strengthening the public service while managing its costs effectively.",
    "Attention was drawn to the urgent need to fill approximately 30,000 existing vacancies within the public service, with discussions on allocating necessary funds for this initiative in the upcoming budget. Delays in recruitment due to technical procedures, including interview processes, were also addressed, emphasizing the need for unified human resource management within the public service.",
    "The President directed attention to multiple sectors in the Anuradhapura District, including education, healthcare, irrigation, agriculture, and human-elephant conflict.",
    "Discussions were held on the potential to develop Anuradhapura as a tourism hub, with a focus on leveraging the “City Branding” approach to transform Anuradhapura into an attractive tourist destination.",
    "The city, which already attracts a significant number of local tourists, was identified as having excellent potential to appeal to foreign tourists as well. As the site of Sri Lanka’s first kingdom and the location of the first reservoir, the city’s historical and cultural significance could be further promoted globally.",
    "The President further emphasized the importance of implementing the “Clean Sri Lanka” program to foster positive societal attitudes and build a better society.",
    "The Chairman of the Anuradhapura District Secretariat Committee, Minister of Trade, Commerce, Food Security, and Cooperative Development, Mr. Wasantha Samarasinghe; Deputy Minister of Land and Irrigation, Dr. Susil Ranasinghe; Governor of the North Central Province, Mr. Wasantha Jinadasa; Members of Parliament, Mr. Susantha Kumara Nawarathna, Dr. Sena Nanayakkara Attorney-at-Law Mr. Bhagya Sri Herath, and Mr. Thilina Samarakoon;Mr. P.D.N.K. Palihena; Mr. Rohana Bandara; Chief Secretary of the North Central Province, Mr. R.M.W.S. Samaradiwakara; and Anuradhapura District Secretary, Mr. K.G.R. Wimalasooriya, were also present at the meeting."
  ]
}