{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-22-08-2025-22-08-9edf31",
  "num": "2025-22-08-9edf31",
  "date_str": "2025-22-08",
  "description": "Discussion with World Bank Representatives on Sri Lanka…",
  "url_metadata": "https://pmd.gov.lk/news/discussion-with-world-bank-representatives-on-sri-lanka-customs-modernisation-programme/",
  "lang": "en",
  "article_title": "Discussion with World Bank Representatives on Sri Lanka Customs Modernisation Programme",
  "article_body_paragraphs": [
    "An initial discussion on the Sri Lanka Customs Modernisation Programme was held recently (15) at the Presidential Secretariat under the chairmanship of Secretary to the President, Dr Nandika Sanath Kumanayake, with the participation of representatives from the World Bank and the Revenue Administration Reform and Modernization Bureau.",
    "The Revenue Administration Reform and Modernization Bureau was established on the instructions of President Anura Kumara Dissanayake with the aim of ensuring the successful implementation of the Customs modernisation initiative. The World Bank delegation commended this step.",
    "The World Bank representatives also expressed their willingness to provide the necessary international institutional support and expert guidance to ensure the success of the programme. In addition, views were exchanged on the revision of the Customs Ordinance.",
    "The Inland Revenue Department, Sri Lanka Customs and the Excise Department play a leading role in revenue collection. While operating under state authority, these institutions are also tasked with strengthening the domestic economy. The Revenue Administration Reform and Modernization Bureau has therefore been established to identify the policy and strategic changes required within these institutions and to present reports to the Government accordingly.",
    "Among those present were Secretary to the Ministry of Finance, Dr Harshana Suriyapperuma; World Bank Programme Leader, Mr Shabih A. Mohib; Director of the Revenue Administration Reform and Modernization Bureau, Mr W.L.C. Thilakasiri; as well as Customs officials and other representatives."
  ]
}