{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-12-28-d79bba",
  "num": "d79bba",
  "date_str": "2024-12-28",
  "description": "President Directs Officials on Preventing Illegal Entry of…",
  "url_metadata": "https://pmd.gov.lk/news/president-directs-officials-on-preventing-illegal-entry-of-narcotics-and-other-prohibited-items-curb-corruption-and-irregularities-at-airports-customs-and-prevent-unauthorized-exits-from-the-country/",
  "lang": "en",
  "article_title": "President Directs Officials on Preventing Illegal Entry of Narcotics and Other Prohibited Items, Curb Corruption and Irregularities at Airports, Customs and Prevent Unauthorized Exits from the Country",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake held a discussion today (28) at the Presidential Secretariat with the heads of the Department of Immigration and Emigration, Sri Lanka Customs, and the Airport and Aviation Services.",
    "The discussion extensively focused on preventing the entry of narcotics and other prohibited substances into the country, curbing corruption, fraud, and irregularities at airports, customs, and halting the unauthorized departure of individuals from the country.",
    "During the meeting, President Dissanayake instructed the establishment of an integrated camera system and a unified observation room to be shared among the Department of Immigration and Emigration, Sri Lanka Customs, and the Airport and Aviation Services.",
    "The President also emphasized the need for a practical and modernized process to prevent smuggling, calling for the replacement of the current scanning equipment with advanced, modern scanners.",
    "Highlighting the need to eliminate the negative perceptions surrounding Sri Lanka Customs, the President underscored the urgency of implementing strict disciplinary and legal action to restore public confidence.",
    "The discussion was attended by prominent officials, including Minister of Foreign Affairs, Foreign Employment, and Tourism Vijitha Herath; Minister of Public Security and Parliamentary Affairs Ananda Wijepala; Secretary to the President Dr. Nandika Sanath Kumanayake; Director General of Customs Sarath Nonis; Acting Controller General of Immigration and Emigration BMD Nilusha Balasuriya; and Chairman of Airport & Aviation Services Sri Lanka (Private) Ltd, Air Chief Marshal Harsha Abeywickrama."
  ]
}