{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-12-13-en-2e7b0f",
  "num": "en-2e7b0f",
  "date_str": "2024-12-13",
  "description": "“Offenders will face consequences, regardless of rank or…",
  "url_metadata": "https://pmd.gov.lk/news/offenders-will-face-consequences-regardless-of-rank-or-status-president-anura-kumara-dissanayake/",
  "lang": "en",
  "article_title": "“Offenders will face consequences, regardless of rank or status.” – President Anura Kumara Dissanayake",
  "article_body_paragraphs": [
    "“We will not allow the trust the people have placed in us to be undermined in any way,” stated President Anura Kumara Dissanayake during a meeting with the heads of state media today (13).\nHe further emphasised, “Regardless of their status in government, if mistakes are made, we will not hesitate to take appropriate action.”\nThe President further explained:\n“For more than seven decades, the people of this nation have built and dismantled various governments. For the first time, we stand with a profound understanding of the historic mandate entrusted to us and the National People’s Power on two occasions.\nThe people placed their faith in the National People’s Power (NPP) government, hoping for a standardised and stable country. We will not tarnish that extraordinary trust, even by the slightest misconduct.\nSimply put, our government is not here to shield anyone who errs, for any reason. Be it within the broader framework of the country or within our administration, anyone found guilty of wrongdoing will face consequences. We will not hesitate to act decisively and at the right time.\nIn essence, our government will not shield anyone who makes a mistake, regardless of the reason. Whether the mistake occurs within the country or at any level within our government, we will not hesitate to take decisive action. Every necessary step will be taken at the appropriate time without delay.”\nPresident Anura Kumara Dissanayake also reaffirmed his government’s unwavering commitment to upholding the trust placed in them by the people, who have endured decades of deception. He pledged to work tirelessly to build a better nation.\nThe Minister of Health and Mass Media, Dr Nalinda Jayatissa, Director-General of Government Information, Harsha Bandara, and the heads of state media were present at the meeting."
  ]
}