{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-29-2025-08-29-fc37e9",
  "num": "2025-08-29-fc37e9",
  "date_str": "2025-08-29",
  "description": "Pre-Budget Discussion of the Ministry of Education, Higher…",
  "url_metadata": "https://pmd.gov.lk/news/pre-budget-discussion-of-the-ministry-of-education-higher-education-and-vocational-education-for-2026-chaired-by-the-president/",
  "lang": "en",
  "article_title": "Pre-Budget Discussion of the Ministry of Education, Higher Education and Vocational Education for 2026, Chaired by the President",
  "article_body_paragraphs": [
    "Focus on Strengthening the School System and Curriculum Reforms",
    "– President",
    "President Anura Kumara Dissanayake instructed officials of the Ministry of Education to focus on strengthening the school system and reforming curricula to ensure that every child receives a quality education. He also emphasized the need to allocate the necessary resources to meet the objectives of the government’s education reforms.",
    "The President has also directed that a comprehensive National Vocational Education Plan be developed with the assistance of the Vocational Education Division of the Ministry of Education, rather than relying on the various vocational education programmes currently spread across the country.",
    "These instructions were given during the 2026 pre-budget discussion of the Ministry of Education, Higher Education and Vocational Education, held today (29) at the Presidential Secretariat.",
    "The advancements of the projects carried out in the three areas of General Education, Higher Education and Vocational Education, along with the issues and challenges that have emerged, were scrutinized separately, in light of the budget allocations designated for the Ministry of Education, Higher Education, and Vocational Education for the year 2025.",
    "Officials also presented the Ministry’s future plans under the vision of “Reaching excellence in the global society through skilled citizens who uphold the Sri Lankan identity.”",
    "Key points of discussion included, progress of foreign-assisted school projects such as the General Education Modernization Project (GEMP) and the Secondary Education Sector Improvement Programme (SESIP).",
    "The President outlined the need to update long-running school projects and strengthen primary education and school development programmes.",
    "Welfare programmes including the school nutrition programme, student allowances, provision of textbooks and uniforms, the “SURAKSHA” insurance scheme, supply of shoes for underprivileged school and Pirivena students, provision of sanitary pads for schoolgirls and the progress of various welfare programmes, including the Technology Stream Scholarship Programme, ‘Sujatha Diyani ‘Scholarships Programme and ‘Subhaga’ Scholarships Scheme, was also reviewed.",
    "Education Ministry officials stated that preparations have been made to conduct the G.C.E. Ordinary Level and Advanced Level examinations from next year on time as previously scheduled.",
    "They also noted that arrangements are underway to distribute school textbooks and uniforms before the start of the new school term on January 5, 2026.",
    "Programmes under the Higher Education sector were also discussed in detail, including a separate review of new construction projects currently underway at universities across the country.",
    "The Officials explained that next year, efforts will focus on expanding student hostel facilities, improving university infrastructure to create a comfortable learning environment and promoting research and innovation. These initiatives aim to enhance the international rankings of universities while also reviewing degree programmes and curricula to align with new educational reforms and develop updated academic programmes.",
    "The discussion also covered plans to strengthen the vocational education sector, including the modernization of 50 vocational training institutes and the development of nine excellence centres during the 2026–2030 period.",
    "The meeting was attended by Prime Minister and Minister of Education, Higher Education and Vocational Education, Dr. Harini Amarasuriya, Minister of Labour and Deputy Minister of Economic Development Anil Jayantha Fernando, Deputy Minister of Education and Higher Education Madhura Senewiratne, Deputy Minister of Vocational Education Nalin Hewage, Secretary to the President, Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Finance, Dr. Harshana Suriyapperuma, Secretary of the Ministry of Education, Higher Education and Vocational Education, Nalaka Kaluwewa, Senior Additional Secretary to the President, Russell Aponso, senior officials from institutions under the Ministry of Education, Higher Education and Vocational Education and a group of officials from the Ministry of Finance also participated in this event."
  ]
}