{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-26-en-a8f43c",
  "num": "en-a8f43c",
  "date_str": "2025-06-26",
  "description": "Full Support for Sri Lanka’s Initiatives to Promote…",
  "url_metadata": "https://pmd.gov.lk/news/full-support-for-sri-lankas-initiatives-to-promote-national-unity-reconciliation-and-human-rights/",
  "lang": "en",
  "article_title": "Full Support for Sri Lanka’s Initiatives to Promote National Unity, Reconciliation and Human Rights",
  "article_body_paragraphs": [
    "– UN High Commissioner for Human Rights Volker Türk",
    "The United Nations High Commissioner for Human Rights, Volker Türk, has expressed his complete support for the direction Sri Lanka is pursuing under the leadership of President Anura Kumara Disanayake to strengthen national unity, promote reconciliation and safeguard Human Rights.",
    "He made this statement during a meeting with President Disanayake at the Presidential Secretariat this afternoon (26), as part of his visit to Sri Lanka.",
    "The High Commissioner commended the current political and social transformation taking place in the country and noted that people in both the North and the South have placed strong confidence in the President and the Government. Mr. Volker Türk stated that during his visit to Sri Lanka, he was able to gain a clear understanding of the on-going transformation taking place in the country. He expressed his belief that the people of Sri Lanka are now placing a renewed optimism for a brighter future.",
    "The issue of missing persons was also discussed in detail. The High Commissioner observed that families of the missing whether in the North or the South share the same pain and emphasized the expectation of the UN Human Rights Office that the Sri Lankan Government will honour the trust these families have placed in it.",
    "The discussion further stressed the importance of strengthening and restructuring the institutional framework responsible for addressing the issue of missing persons. It was noted that past political cultures had hindered these institutions from effectively delivering on public expectations and protecting the rights of citizens.",
    "In his remarks, President Anura Kumara Disanayake stated that, as a political movement that has directly faced the experience of the missing persons his administration has a deep understanding of their pain.",
    "The President emphasized that his government is fully committed to implementing the necessary reforms to ensure national unity, foster reconciliation and safeguard human rights across the country.",
    "The President also emphasized that restoring economic stability remains a top priority of his administration. While recognizing the scale of the current challenges, the President reiterated his Government’s strong determination to address them and called for the continued support of the international community.",
    "President Disanayake further said that international cooperation, including the support of the UN Human Rights Office and other global institutions, is essential for accurately conveying Sri Lanka’s actual circumstances to the global community and improving the nation’s international reputation.",
    "Also present at the meeting were several senior officials from the United Nations, including UN Resident Coordinator in Sri Lanka Marc-André Franche, Chief of the Asia-Pacific Section of Global Operations Division Office of the High Commission for Human Rights (OHCHR) Rory Mungoven, Desk Officer of OHCHR Elaine Chan, Senior Human Rights Adviser at the Office of the United Nations Resident Coordinator Laila Nazarali, Development Coordination Officer, Office of the United Nations Resident Coordinator Azam Bakeer Markar and Public Information Officer of the OHCHR Anthony Headley.",
    "Representing the Government of Sri Lanka were Minister of Justice and National Integration Harshana Nanayakkara, Minister of Public Security and Parliamentary Affairs Ananda Wijepala and Senior Additional Secretary to the President Roshan Gamage, among other officials."
  ]
}