{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-10-05-en-b7e06e",
  "num": "en-b7e06e",
  "date_str": "2024-10-05",
  "description": "President Receives Blessings from the Chief Prelate of…",
  "url_metadata": "https://pmd.gov.lk/news/president-receives-blessings-from-the-chief-prelate-of-the-ramanna-maha-nikaya/",
  "lang": "en",
  "article_title": "President Receives Blessings from the Chief Prelate of the Ramanna Maha Nikaya",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake visited the headquarters of the Sri Lanka Ramanna Maha Nikaya in Narahenpita this morning (05), where he met with the Chief Prelate, Most Venerable Makulewe Wimala Nayaka Thero, Aggamaha Panditha of the Sri Lanka Ramanna Maha Nikaya, and received his blessings.",
    "The Anunayaka Theros, Lekhadhikari Theros, and other senior Theros of the Nikaya were also present at the occasion. The Maha Sangha chanted Seth Pirith to invoke blessings upon the President.",
    "The Deputy Chief Prelates, Secretarial Theros, and other senior monks of the Nikaya were also present at the occasion. They invoked Seth Pirith and bestowed blessings upon the President.",
    "Following this, the President engaged in a brief discussion with the Chief Prelate and the Maha Sangha regarding the current economic, social and political situation in the country.",
    "During the discussion, the monks requested that when appointing Ambassadors and High Commissioners, the President should ensure that qualified, intelligent individuals who can properly represent the country abroad are selected. Similarly, they urged the appointment of responsible individuals, free from political considerations, for the positions of Governors.",
    "The Maha Sangha also emphasized that when appointing Secretaries to Ministries, the President should choose suitable individuals for the respective roles.",
    "President Anura Kumara Dissanayake stated that his goal is to make all decisions in line with the policies outlined in his manifesto. He further mentioned that he plans to introduce relevant reforms after the upcoming General Election.",
    "Most Venerable Makulewe Wimala Nayaka Thero also expressed confidence that the trust placed in the President and his team by the people during the last Presidential Election will be fulfilled, and that the blessings of the Sangha are with him to help realize the expectations of the public."
  ]
}