{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-12-15-en-81de5d",
  "num": "en-81de5d",
  "date_str": "2024-12-15",
  "description": "President Commences Diplomatic Discussions in India",
  "url_metadata": "https://pmd.gov.lk/news/president-commences-diplomatic-discussions-in-india/",
  "lang": "en",
  "article_title": "President Commences Diplomatic Discussions in India",
  "article_body_paragraphs": [
    "Focus on Leveraging India’s Vast Market for Sri Lanka’s Economic Revival",
    "During his three-day official visit to India, President Anura Kumara Dissanayake met with prominent Indian officials at the ITC Maurya Hotel in New Delhi today (15). These included Indian Finance and Corporate Affairs Minister Nirmala Sitharaman, External Affairs Minister Dr. S. Jaishankar, and National Security Advisor Shri Ajit Doval.",
    "Extensive discussions were held between President Dissanayake and Minister Sitharaman on enhancing Indo-Sri Lankan economic cooperation and expanding investment opportunities between the two countries.",
    "The talks also covered bringing more Indian tourists to Sri Lanka, modernizing Sri Lanka’s agriculture sector, and developing digital infrastructure.",
    "President Dissanayake’s meeting with Dr. Jaishankar was marked by a cordial atmosphere, where attention was focused on exploring the potential for utilizing India’s vast market to aid Sri Lanka’s economic recovery. Dr. Jaishankar affirmed India’s commitment to supporting Sri Lanka in the tourism, investment, and energy sectors.",
    "The discussions also addressed areas of mutual interest, such as advancing the fisheries industry and fostering national unity in Sri Lanka.",
    "Later, President Dissanayake met with Shri Ajit Doval, India’s National Security Advisor, to discuss regional security matters.",
    "Sri Lankan officials accompanying the President included Minister of Foreign Affairs, Foreign Employment, and Tourism Vijitha Herath, and Deputy Minister of Economic Development and Labour, Prof. Anil Jayantha Perera."
  ]
}