{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-07-26-2025-07-26-29d39c",
  "num": "2025-07-26-29d39c",
  "date_str": "2025-07-26",
  "description": "Eastern Provincial Subject Officers Briefed on President’s Fund",
  "url_metadata": "https://pmd.gov.lk/news/eastern-provincial-subject-officers-briefed-on-presidents-fund/",
  "lang": "en",
  "article_title": "Eastern Provincial Subject Officers Briefed on President’s Fund",
  "article_body_paragraphs": [
    "The Eastern Provincial Workshop, part of a series of specialized training programs aimed at decentralizing the functions of the President’s Fund, was held today (26) at the Batticaloa District Secretariat.",
    "With the full decentralization of the President’s Fund operations to Divisional Secretariats, there has been a notable increase in the number of applications received. As a result, training and awareness on the newly introduced computer-based online system have become essential for the relevant Divisional Secretariat staff.",
    "Accordingly, the Eastern Province workshop of the series of training programs conducted at the provincial level was held, with the participation of over 100 subject officers handling matters related to the President’s Fund from the districts of Ampara, Batticaloa and Trincomalee.",
    "This program aims to enhance the knowledge and skills of officers in order to increase the number of beneficiaries of the President’s Fund in the Eastern Province, deliver higher quality services, introduce the updated online system and ensure more efficient and timely service delivery.",
    "Previously limited to a select group in Colombo, the President’s Fund is now being transformed under the leadership of the current President and the governing Board into a fund that serves all citizens across the country. In line with this objective, similar training programs have already been conducted in the Western, Northern and Southern Provinces, with plans to implement them in other provinces in the near future.",
    "Senior Additional Secretary to the President and Secretary to the President’s Fund, Mr. Roshan Gamage, delivered a detailed briefing on the Fund’s role and functions. Senior officials also explained the online system’s features, including its security, application handling process, approval mechanisms and disbursement procedures.",
    "The workshop included a discussion on challenges faced by subject officers and potential solutions. Certificates were awarded to all participants in recognition of their engagement.",
    "The event was attended by relevant District Secretaries, Divisional Secretaries, subject officers and officials from the President’s Fund."
  ]
}