{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-07-22-3cd517",
  "num": "3cd517",
  "date_str": "2025-07-22",
  "description": "Students from Mahanama College, Colombo and Damminna Maha…",
  "url_metadata": "https://pmd.gov.lk/news/students-from-mahanama-college-colombo-and-damminna-maha-vidyalaya-polonnaruwa-visit-presidents-house/",
  "lang": "en",
  "article_title": "Students from Mahanama College, Colombo and Damminna Maha Vidyalaya, Polonnaruwa Visit President’s House",
  "article_body_paragraphs": [
    "Students of Mahanama College, Colombo and Damminna Maha Vidyalaya, Polonnaruwa had the opportunity today (22) to participate in the ‘Vision’ programme organized by the Presidential Secretariat as part of their educational tour.",
    "This initiative is jointly implemented by the Presidential Secretariat, the Ministry of Education and Department of Communication of the Parliament of Sri Lanka, aiming to enrich the educational experience of school students.",
    "During the visit, students were also introduced to the “Clean Sri Lanka” initiative, with an emphasis on its conceptual and practical relevance.",
    "Delivering a special lecture, President’s Media Advisor and senior journalist Mr. Chandana Sooriyabandara highlighted that the government’s initiative for national transformation necessitates a shared sense of accountability from all citizens.",
    "He stated that the time has come to nurture a generation capable of viewing the evolving society with a broad perspective and driving the change needed for the modern world. He further emphasized that instilling a positive and progressive mind-set in children from an early age is one of the key challenges facing the country today.",
    "Mr. Sooriyabandara pointed out that students are not merely defined by their exam marks. He further stated that the country cannot progress under the out-dated education system and emphasized the need to reform it by moving away from a marks-based evaluation method through comprehensive educational reforms.",
    "As a symbolic gesture supporting environmental conservation, valuable saplings were presented to the participating schools. Students also received copies of the ‘Vision’ magazine.",
    "The event was attended by Director General of Public Relations at the Presidential Secretariat Dharmasiri Gamage, Assistant Director of the Tri-Forces Coordination Unit of the Presidential Secretariat Major Nadika Dangolla, as well as teachers and students from the two schools."
  ]
}