{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-04-en-a484da",
  "num": "en-a484da",
  "date_str": "2025-04-04",
  "description": "Indian Prime Minister Shri Narendra Modi Arrives in…",
  "url_metadata": "https://pmd.gov.lk/news/indian-prime-minister-shri-narendra-modi-arrives-in-sri-lanka/",
  "lang": "en",
  "article_title": "Indian Prime Minister Shri Narendra Modi Arrives in Sri Lanka",
  "article_body_paragraphs": [
    "Indian Prime Minister Shri Narendra Modi arrived in Sri Lanka tonight (04) at the Bandaranaike International Airport in Katunayake for a State visit, following an invitation extended by President Anura Kumara Disanayake.",
    "Minister of Foreign Affairs, Foreign Employment and Tourism, Vijitha Herath, along with Minister of Health and Mass Media Nalinda Jayatissa, Minister of Fisheries, Aquatic and Ocean Resources Ramalingam Chandrasekar, Minister of Women and Child Affairs Saroja Savithri Paulraj, Minister of Science and Technology Chrishantha Abeysena and Deputy Minister of Economic Development Anil Jayantha extended a warm and distinguished welcome to Indian Prime Minister Shri Narendra Modi and his diplomatic delegation.",
    "Prime Minister Shri Narendra Modi’s visit to Sri Lanka is being conducted under the theme “Friendship of Centuries – Commitment to a Prosperous Future,” reaffirming the enduring bond between Sri Lanka and India and their shared commitment to a thriving future.",
    "This marks Indian Prime Minister’s fourth visit to Sri Lanka, highlighting the longstanding economic, cultural and historical ties between the two nations. The primary objectives of this State visit are to further strengthen bilateral ties and to enhance multifaceted cooperation between India and Sri Lanka.",
    "During this visit, Prime Minister Modi is expected to hold bilateral talks with President Anura Kumara Disanayake.",
    "While in Sri Lanka, the Indian Prime Minister Shri Narendra Modi is scheduled to pay homage to the sacred Jaya Sri Maha Bodhi and will inaugurate several projects implemented in Sri Lanka with the assistance of the Government of India.",
    "Accompanying the Indian Prime Minister on this visit are India’s Minister of External Affairs, Dr. S. Jaishankar, National Security Advisor Ajit Doval, Foreign Secretary Vikram Misri and other senior officials of the Government of India."
  ]
}