{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-20-08-2025-20-08-805d61",
  "num": "2025-20-08-805d61",
  "date_str": "2025-20-08",
  "description": "Coastal Leisure Park Development in the North under…",
  "url_metadata": "https://pmd.gov.lk/news/coastal-leisure-park-development-in-the-north-under-clean-sri-lanka/",
  "lang": "en",
  "article_title": "Coastal Leisure Park Development in the North under “Clean Sri Lanka”",
  "article_body_paragraphs": [
    "The Northern Province programme of the Clean Sri Lanka Coastal Leisure Park Development Project was launched yesterday (19).",
    "With the aim of creating a beautiful and clean coastline, enhancing local and foreign tourist attractions and improving recreational facilities, around 43 coastal locations across 14 coastal districts will be developed into small coastal leisure parks under the Clean Sri Lanka initiative. These developments will include small parks, scenic viewing decks and walking paths.",
    "Accordingly, under an allocation of Rs. 2.6 million, development work commenced yesterday on the Pungudutivu Velanai coastal park in the Jaffna District, in parallel with the “To Jaffna with Love” programme.",
    "A 100-meter-long and 20-meter-wide walking path, will be constructed under this project. In addition, a vehicle park and 26 comfortable benches will be installed. The park’s development commenced yesterday.",
    "Simultaneously, the programme will be implemented in 05 more coastal areas in the Northern Province. The project is being implemented by the Coast Conservation and Coastal Resource Management Department, with the Ministry of Environment, the Urban Development Authority, local government institutions, universities and other organisations providing technical support.",
    "Once development work is complete, the maintenance of the improved sites will either be entrusted to relevant local authorities or carried out with the participation of small-scale entrepreneurs, related tourism establishments, community-based organisations and interested private organisations.",
    "From the outset, a comprehensive media campaign will be launched to enhance public awareness regarding the Clean Sri Lanka programme, emphasising the significance of the project and the necessity for sustainable natural resource utilisation, to improve the quality of public engagement.",
    "This programme aims to foster environmentally friendly attitudes among coastal communities and the broader public, elevate the living standards of coastal communities and resource users, and promote economic growth rooted in coastal resources."
  ]
}