{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-12-18-en-fad68b",
  "num": "en-fad68b",
  "date_str": "2024-12-18",
  "description": "President Expresses Gratitude to China for Debt Restructuring…",
  "url_metadata": "https://pmd.gov.lk/news/president-expresses-gratitude-to-china-for-debt-restructuring-support-and-economic-assistance/",
  "lang": "en",
  "article_title": "President Expresses Gratitude to China for Debt Restructuring Support and Economic Assistance",
  "article_body_paragraphs": [
    "President Anura Kumara Dissanayake expressed his gratitude to the Chinese government for its support during debt restructuring as well as in the face of the economic crisis. He stated that his appreciation extends to China’s assistance in the debt restructuring program and its provision of loans to Sri Lanka during the economic challenges.",
    "President Dissanayake made these remarks during a meeting with Ms. Qin Boyong, Vice Chairperson of the National Committee of the Chinese People’s Political Consultative Conference (CPPCC), held today (18) at the Parliamentary Complex.",
    "Ms. Qin Boyong noted that China looks forward to continuing its work with the new government of Sri Lanka, further strengthening the longstanding relationship between the two countries.",
    "The President also expressed his gratitude for China’s assistance during Sri Lanka’s disaster situations and the provision of school uniforms for children. He emphasized the continued need for China’s support in the future.",
    "President Dissanayake highlighted the importance of completing the unfinished sections of the Central Expressway under Chinese management and expressed hopes to expedite the commencement of supply hubs and institutional projects cantered around the Colombo Port City and Hambantota District.",
    "Ms. Qin Boyong stated that there are plans to restart maritime research activities, which were temporarily halted for various reasons, along with initiating relevant projects.",
    "Furthermore, she mentioned that Chinese companies intend to establish themselves in the Hambantota investment zone, aiming to provide Sri Lanka with better global access. She also revealed that preparations are underway to warmly welcome President Anura Kumara Dissanayake during his future visit to China.",
    "Foreign Affairs, Foreign Employment, and Tourism Minister Vijitha Herath, Deputy Speaker Dr. Rizvie Salih and committee member of the Chinese People’s Political Consultative Conference, Mr. Ma Youxiang, among others, were present at this event."
  ]
}