{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-12-25-en-2a802d",
  "num": "en-2a802d",
  "date_str": "2024-12-25",
  "description": "Christmas Message",
  "url_metadata": "https://pmd.gov.lk/news/christmas-message/",
  "lang": "en",
  "article_title": "Christmas Message",
  "article_body_paragraphs": [
    "Christmas, the day that marks the birth of Jesus Christ, is celebrated with great reverence by Christians worldwide. Jesus Christ, who came into this world to bring salvation to all, saw no divisions among people, be they rich or poor. His birth among humble shepherds, and the divine message delivered to them by angels, underscores the profound truth that Christmas calls us to transcend divisions and act with unity, peace, and humanity.",
    "Today, as a nation, we stand at a pivotal moment, united in our shared commitment to the future. We are witnessing the dawn of a new era for our country, one illuminated by the message of love and unity brought by Jesus Christ. Transforming our nation into a land where peace reigns and divisions are replaced by mutual understanding is a journey we are on together. Jesus Christ’s life, rooted in the pursuit of human freedom and justice, serves as an enduring inspiration for our work today.",
    "Today, Sri Lanka stands at a crossroads, requiring a transformative social revival. This is a call for a collective national renewal, a shift towards a just, compassionate, and equitable society. It is a moment for us to unite, acting with determination, resilience, and courage, to achieve the shared vision of a prosperous nation and fulfilling lives for all.",
    "Although society often compels us towards selfish competition, let us embrace the virtues of humanity this Christmas with empathy, respect for equality, fraternity, and coexistence. By fostering these values, we can work towards a society that thrives on mutual care and collective joy.",
    "This Christmas, let us pledge to build a strong, stable economy, ensure social justice, and uphold a political culture rooted in democracy and integrity. Together, with firm resolve, we can create a beautiful nation filled with humanity and freedom.\nMay all Christians in Sri Lanka and across the world have a blessed and joyful Christmas!",
    "Anura Kumara Disanayake\nPresident\nDemocratic Socialist Republic of Sri Lanka"
  ]
}