{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-07-d777c1",
  "num": "d777c1",
  "date_str": "2025-04-07",
  "description": "A Progressive Transformation of the Sri Lanka Police…",
  "url_metadata": "https://pmd.gov.lk/news/a-progressive-transformation-of-the-sri-lanka-police-is-essential-to-uphold-the-rule-of-law/",
  "lang": "en",
  "article_title": "A Progressive Transformation of the Sri Lanka Police is Essential to Uphold the Rule of Law",
  "article_body_paragraphs": [
    "– President says participating in the 82nd STF Passing Out Parade",
    "Attending the passing out parade of the 82nd batch of the Special Task Force (STF) at the Katukurunda STF Training Camp in Kalutara today (07), President Anura Kumara Disanayake emphasized the need for a progressive transformation within the Sri Lanka Police to ensure the rule of law, order and authority.",
    "The President noted that the public places its trust in the Sri Lanka Police to uphold the supremacy of the law and maintaining that trust is a fundamental responsibility of the Police Department.",
    "Addressing the newly commissioned officers, President Disanayake stated that how one serves and respects their profession is reflected in their career and urged the officers to embrace their professional duty in a way that contributes meaningfully to the transformative change the country requires.",
    "Highlighting the current state of institutional breakdown in many sectors, the President pointed out that the people have already initiated change by altering the political authority, but reiterated that political transformation alone is insufficient. Instead, a comprehensive and positive transformation across all sectors is necessary for national progress.",
    "The President further emphasized that new police officers carry the responsibility of meeting public expectations. He called on them to ensure public safety and security and to prevent the nation from falling prey to organized crime and drug-related issues.",
    "He also stated that the younger generation must take responsibility for the motherland, bearing that duty on their shoulders and should strive to steer both their personal future and the future of the country in a positive direction.",
    "President Disanayake concluded by saying that joining the regular service of the Sri Lanka Police today should be remembered by all as a significant and powerful step forward.",
    "The President further noted that the service rendered by the Special Task Force (STF) on behalf of the public during times of emergency and disaster is highly commendable.",
    "A total of 118 newly recruited Sub-Inspectors and 231 Probationary Police Constables who successfully completed their basic training graduated during the ceremony.",
    "President Anura Kumara Disanayake awarded certificates and honours to officers who demonstrated exceptional performance during the training programme.",
    "A commemorative token was also presented to President Disanayake, who attended the ceremony as the Chief Guest.",
    "An operational demonstration by STF officers on a simulated battlefield was presented as part of the event.",
    "Established in 1983 under the theme “Victory is Certain”, the Sri Lanka Police Special Task Force is currently recognized as a prestigious unit deployed for VIP protection, crime and organized crime suppression and narcotics control efforts aimed at building a drug-free nation.",
    "The ceremony was attended by Minister of Public Security and Parliamentary Affairs Ananda Wijepala, Minister of Health and Mass Media Dr. Nalinda Jayatissa, Deputy Minister of Public Security Sunil Watagala, Secretary to the Ministry of Public Security Ravi Seneviratne, Acting Inspector General of Police Priyantha Weerasooriya, STF Commanding Officer Senior Deputy Inspector General of Police Samantha de Silva, along with other senior police officers, the parents of graduating officers and other invitees."
  ]
}