{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-19-en-a88626",
  "num": "en-a88626",
  "date_str": "2025-06-19",
  "description": "Government Focuses on Controlling Crop Damage by Wild…",
  "url_metadata": "https://pmd.gov.lk/news/government-focuses-on-controlling-crop-damage-by-wild-animals/",
  "lang": "en",
  "article_title": "Government Focuses on Controlling Crop Damage by Wild Animals",
  "article_body_paragraphs": [
    "A Committee comprising government officials and experts has been appointed under the leadership of Secretary to the President, Dr. Nandika Sanath Kumanayake to seek and implement sustainable solutions for managing and controlling the damages caused by wild animals to food production (Agriculture and Plantation sectors) through a scientific approach. The Committee held its first meeting today (19) at the Presidential Secretariat.",
    "The main objective of the Committee is to conduct a scientific study on the agricultural damage caused by wild animals and to implement short, medium and long-term action plans. In addition to drafting national policies and legislation, the Committee will also coordinate the provision of necessary human, physical and financial resources.",
    "It was emphasised during the meeting that decisions should be made by recognizing wildlife as a part of the natural ecosystem. It was also noted that any solution must acknowledge the right of wild animals to their natural habitats. The need to implement a rapid action programme for high-risk districts was also discussed.",
    "Prof. Ashoka Dangolla from the Faculty of Veterinary Medicine at the University of Peradeniya shared his views, highlighting that based on research conducted over more than 15 years on Toque macaque; it is possible to arrive at successful solutions through a scientific approach. He also pointed out that various methods can be used to control animal populations.",
    "Director General of Wildlife Conservation, Mr M.S.L.R.C. Marasinghe, stated that a multi-pronged approach is necessary to address this issue. He emphasised the importance of animal censuses to obtain standard data on animal densities and underscored that the matter must be approached scientifically, beyond social perceptions.",
    "It was also decided that gathering inputs from all stakeholders including academics, environmentalists, wildlife specialists, officials and members of the public affected by wildlife conflict is essential.",
    "Among those present were Senior Additional Secretary to the President Mr. Kapila Janaka Bandara, Ministry Secretaries including Secretary to the Ministry of Public Security, Ravi Seneviratne, Secretary to the Ministry of Public Administration Mr. S. Aloka Bandara, Secretary to the Ministry of Agriculture, Livestock, Lands and Irrigation Mr D.P. Wickramasinghe, Secretary to the Ministry of Plantation and Community Infrastructure Mr. Prabath Chandrakeerthi, Secretary to the Ministry of Justice and National Integration Ms. Ayesha Jinasena, public officials including Director General of Department of Wildlife Conservation, defence sector officers, university professors and the members of the Committee."
  ]
}