{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-12-17-1228ed",
  "num": "1228ed",
  "date_str": "2024-12-17",
  "description": "Speech by President Anura Kumara Dissanayake at the…",
  "url_metadata": "https://pmd.gov.lk/news/speech-by-president-anura-kumara-dissanayake-at-the-state-banquet-hosted-by-her-excellency-droupadi-murmu-president-of-india/",
  "lang": "en",
  "article_title": "Speech by President Anura Kumara Dissanayake at the State Banquet hosted by Her Excellency Droupadi Murmu, President of India",
  "article_body_paragraphs": [
    "Your Excellency Droupadi Murmu, President of the Republic of India,\nYour Excellency Narendra Modi, Prime Minister of the Republic of India,\nHonourable Ministers, Distinguished Guests, Ladies, and Gentlemen,\nAyubowan, Vanakkam, Namaste, Good evening,",
    "I am deeply touched, Madam President, by your gracious sentiments.",
    "Permit me to express my sincere appreciation to you, the Government, and the people of India for the gracious hospitality accorded to my delegation and me in your country. I bring with me warm greetings from the people of Sri Lanka to our Indian friends.",
    "Excellency,",
    "The bonds between Sri Lanka and India transcend diplomacy and geographical proximity. Our relationship is civilisationally linked and defined by mutual respect, cooperation, and a shared destiny. From the shores of the Indian Ocean to the heart of the Subcontinent, we are bound by a common heritage of tradition, values, and even a vision for the future, inherent in our countries’ robust relations. Therefore, undertaking my first-ever State Visit to India is only natural.",
    "My administration remains committed to further strengthening this age-old relationship. India has been a trusted friend, steadfast partner, and our closest neighbour, whose unstinted support has been pivotal in my country’s journey towards economic recovery, growth, and stability. India’s assistance to Sri Lanka in times of need and its unwavering solidarity are deeply cherished.",
    "As Sri Lanka stands on the threshold of a new era, it is important to further strengthen its economic ties, enhance people-to-people connections, and advance regional and global cooperation. The future holds immense potential. The role of our two countries in ensuring peace, stability, security, and sustainable development in the Indian Ocean region is of paramount importance.",
    "The strength of our partnership lies in collective action. It is through collaborative efforts that we can address the new and evolving challenges that transcend borders, whether they be in addressing environmental concerns, combating terrorism, or ensuring economic growth that benefits all citizens globally. Sri Lanka remains committed to fostering deeper cooperation with India, as a leader of the global South, to harness the opportunities of the 21st century for future generations to thrive in an interconnected and interdependent world.",
    "Excellency,",
    "Let this evening be a celebration of the enduring friendship between our two nations—a bond that has withstood the test of time and continues to flourish, bringing us closer together in the pursuit of peace and progress.\nTo the Government and people of India, I extend my deepest appreciation for the unwavering support and friendship. May our cooperation continue to grow stronger, and our shared journey brings prosperity to our nations and the entire region."
  ]
}