{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-03-19-597e49",
  "num": "597e49",
  "date_str": "2025-03-19",
  "description": "‘Urban Green Zones’ project under the ‘Clean Sri…",
  "url_metadata": "https://pmd.gov.lk/news/urban-green-zones-project-under-the-clean-sri-lanka-programme/",
  "lang": "en",
  "article_title": "‘Urban Green Zones’ project under the ‘Clean Sri Lanka’ Programme",
  "article_body_paragraphs": [
    "As part of the “Clean Sri Lanka” Programme, which aims to foster a cultural, ethical, social and environmental revival, while uplifting society to a more advanced level, the “Model Urban Green Zones” project has been launched.",
    "In the first phase, two Model Urban Green Zones are planned for implementation in the Peliyagoda and Orugodawatta areas.",
    "This project aligns with the Green City concept and will be executed as an urban planning initiative with the participation of both the public and private sectors. The work is scheduled to commence before the end of March.",
    "Following the Public-Private-People Partnership (4P) model, the initiative will integrate the government, private sector and the public to ensure its successful implementation.",
    "With the rising urban population, cities face significant environmental challenges such as air, soil, and water pollution. In response, global attention has increasingly shifted towards sustainable green cities.",
    "Urban greening not only helps reduce environmental issues but also enhances the visual appeal of cityscapes. By replacing concrete-dominated areas with lush green environments, this project aims to provide residents with a healthier and more nature-friendly urban lifestyle, fostering both physical and mental well-being.",
    "The project is a collaborative effort between several government institutions and private companies, including the Urban Development Authority, Road Development Authority, Colombo Municipal Council, Sri Lanka Railways Department and the Coast Conservation and Coastal Resource Management Department. The Capital Maharaja Organization is providing financial support for the initiative."
  ]
}