{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-02-07-en-612551",
  "num": "en-612551",
  "date_str": "2025-02-07",
  "description": "President Holds Meeting with Chairman of the Nippon…",
  "url_metadata": "https://pmd.gov.lk/breaking-news/president-holds-meeting-with-chairman-of-the-nippon-foundation/",
  "lang": "en",
  "article_title": "President Holds Meeting with Chairman of the Nippon Foundation",
  "article_body_paragraphs": [
    "A meeting between President Anura Kumara Disanayake and the Chairman of the Nippon Foundation in Japan Mr. Yōhei Sasakawa was held today (07) at the Presidential Secretariat.",
    "The President emphasized that the most prominent task of the government is to eradicate rural poverty in Sri Lanka, and he expressed hope that this initiative would also lead to improvements in education concurrently.",
    "During the meeting, Mr. Yōhei Sasakawa, Chairman of the Nippon Foundation, stated that his foundation is committed to contributing to the improvement of public health, education, and the welfare of the differently abled community in Sri Lanka.",
    "Mr. Sasakawa specifically highlighted that his organization is particularly focused on supporting the educational development of students in the Jaffna.",
    "Furthermore, the President noted that the government plans to initiate special projects aimed at addressing rural poverty, which is a priority in the country’s development agenda.",
    "The meeting also underscored the importance of further strengthening the friendship between the two nations.",
    "Minister of Labour and Deputy Minister of Economic Development, Anil Jayantha Fernando, Secretary to the President, Dr. Nandika Sanath Kumanayake, Senior Additional Secretary to the President, Roshan Gamage, Japanese Ambassador to Sri Lanka, Akio Isomata, Chairman of the Sasakawa Health Foundation, Dr. Takahiro Nanri, Executive Director of The Nippon Foundation, Ichiro Kabasawa, and a group of representatives attended the meeting."
  ]
}