{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-06-13-a13554",
  "num": "a13554",
  "date_str": "2025-06-13",
  "description": "President Engages with German Tourism Sector Representatives",
  "url_metadata": "https://pmd.gov.lk/news/president-engages-with-german-tourism-sector-representatives/",
  "lang": "en",
  "article_title": "President Engages with German Tourism Sector Representatives",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake, who is currently on an official visit to the Federal Republic of Germany, met with representatives of the Tourism and Travel Industry Associations, along with Outbound Travel/Tour Operators, this morning (13) at the Waldorf Astoria Hotel in Berlin.",
    "During the meeting, the President outlined the progressive measures undertaken by the Sri Lankan government to promote sustainable tourism. The President emphasized improvements in tourism infrastructure, on-going promotional campaigns and enhanced safety protocols aimed at positioning Sri Lanka as a leading travel destination through sustainable tourism practices.",
    "President Disanayake also drew attention to key focus areas such as human resource development within the tourism sector, the promotion of cultural and eco-tourism and environmental protection initiatives. He noted that these efforts are part of a comprehensive strategy to strengthen the tourism industry while preserving the island’s natural and cultural heritage.",
    "Highlighting the new investment opportunities available in Sri Lanka’s tourism sector, the President extended an open invitation to German investors to explore and engage in tourism-related ventures in the country.",
    "Germany currently ranks as the fourth-largest source market for tourism to Sri Lanka. In 2024 alone, the country welcomed approximately 136,000 German tourists, with over 69,000 arrivals recorded by the end of May this year.",
    "Minister of Foreign Affairs, Foreign Employment and Tourism Vjitha Herath, along with Sri Lanka’s Ambassador to Germany, Ms. Varuni Muthukumarana and other officials, participated in the meeting."
  ]
}