{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-24-en-52d8db",
  "num": "en-52d8db",
  "date_str": "2025-04-24",
  "description": "Students from Three Provinces Participate in Educational Visit…",
  "url_metadata": "https://pmd.gov.lk/news/students-from-three-provinces-participate-in-educational-visit-to-presidents-house/",
  "lang": "en",
  "article_title": "Students from Three Provinces Participate in Educational Visit to President’s House",
  "article_body_paragraphs": [
    "Students representing Kavantissa Central College (Ampara), Udagama Maha Vidyalaya (Balangoda) and St. Joseph’s Girls’ School (Gampola) engaged in an educational visit to the President’s House today (24).",
    "This initiative was executed through a collaborative programme involving the Presidential Secretariat, the Ministry of Education and the Parliament Communications Department. The programme aims to provide schoolchildren with firsthand exposure to key institutions relevant to their academic curriculum, encompassing the Presidential Secretariat, the President’s House, Colombo Port City and Parliament.",
    "Concurrent with the visit, an educational session was conducted for both educators and students, focusing on the historical context of Parliament, the functions of the Executive branch and the principle of the rule of law.\nFurthermore, aligning with the national “Clean Sri Lanka” programme, the participating schools received donations of valuable plants and educational books for their libraries.",
    "Addressing the students, Presidential Media Advisor and veteran journalist Chandana Sooriyabandara underscored the fundamental role of national unity in the development of a country and its society.",
    "Mr. Sooriyabandara acknowledged the rapid global transformations driven by artificial intelligence but emphasized the enduring responsibility of teachers in cultivating morally grounded citizens.",
    "He further asserted the absence of inherent disparities among villages or schools, highlighting that success is attainable through unwavering dedication. He cited the incumbent President’s journey from the rural locale of Thambuttegama to the highest office as a compelling illustration of the rewards of commitment and persistent pursuit of objectives.",
    "The event was also graced by the presence of senior officials and stakeholders, including K.M.N. Kumarasinghe, Senior Additional Secretary to the President; Attorney-at-Law J.M. Wijebandara, Presidential Advisor on Legal Affairs; Air Commodore Asiri Gallage, Director of Tri-Forces Coordination; and Major Nadika Dangolla, Assistant Director. Principals from the participating schools, accompanied by members of their academic staff and parent representatives, also attended, contributing to the successful execution of this educational endeavour."
  ]
}