{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-02-11-en-f4c493",
  "num": "en-f4c493",
  "date_str": "2025-02-11",
  "description": "Inaugural Session of Kolonnawa Balika Maha Vidyalaya Student…",
  "url_metadata": "https://pmd.gov.lk/news/inaugural-session-of-kolonnawa-balika-maha-vidyalaya-student-parliament-held-at-the-presidential-secretariat/",
  "lang": "en",
  "article_title": "Inaugural Session of Kolonnawa Balika Maha Vidyalaya Student Parliament Held at the Presidential Secretariat",
  "article_body_paragraphs": [
    "The inaugural session of the Kolonnawa Balika Maha Vidyalaya Student Parliament was held today (11) at the Old Parliament Chambers of the Presidential Secretariat, in conjunction with a series of programs for school children implemented by the Presidential Secretariat, Ministry of Education, and the Department of Communication of the Sri Lanka Parliament.",
    "Alongside this program, the students of the Kolonnawa Balika Maha Vidyalaya had the opportunity to gain an understanding of the history of parliamentary traditions, the functions and duties of Parliament, as well as the conceptual value and practical significance of the “Clean Sri Lanka” program.",
    "A notable highlight of the event was the appointment of a minister for the “Clean Sri Lanka” program from the Kolonnawa Balika Maha Vidyalaya Student Parliament. Certificates were also awarded to the members of the Student Parliament and the Cabinet of Ministers during this event.",
    "The event was attended by several distinguished individuals, including the Speaker of the Sri Lanka Parliament, Dr. Jagath Wickramaratne, the Deputy Speaker, Dr. Rizvie Salih, Secretary-General of the Sri Lanka Parliament Kushani Anusha Rohanadeera, the Assistant Secretary of the Sri Lanka Parliament Hansa Abeyrathne, the Director of Legislative Services and Communications of the Sri Lanka Parliament Jayalath Perera, along with the Principal of the Kolonnawa Balika Maha Vidyalaya and other members of the academic staff."
  ]
}