{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-03-27-en-d1706b",
  "num": "en-d1706b",
  "date_str": "2025-03-27",
  "description": "Programme to Establish New Restaurants for Affordable and…",
  "url_metadata": "https://pmd.gov.lk/news/programme-to-establish-new-restaurants-for-affordable-and-nutritious-meals/",
  "lang": "en",
  "article_title": "Programme to Establish New Restaurants for Affordable and Nutritious Meals",
  "article_body_paragraphs": [
    "The government to launch a nationwide initiative aimed at establishing new restaurants, guaranteeing food security and providing the public access to nutritious and sufficient meals at reasonable prices.",
    "This programme will be implemented with the collaboration of the National Food Promotion Board, the Ministry of Health and the Ministry of Agriculture. It will also involve current restaurant owners to secure their support. The first model restaurant under this initiative is scheduled to launch on April 01 in Narahenpita.",
    "In the second phase of this initiative, the government intends to introduce a programme aimed at improving the standards of existing restaurants.",
    "A preliminary discussion on this programme was held today (27) at the Presidential Secretariat, with the participation of officials from the National Food Promotion Board, the Ministry of Health and the Ministry of Agriculture.",
    "During the discussion, officials emphasized the importance of protecting the public’s right to safe and nutritious food. The dialogue addressed several key aspects, including creating an environment that allows consumers to access food that meets proper health standards, enhancing consumers trust and encouraging collaboration between the public and private sectors.",
    "Furthermore, discussions were held on the practical implementation of existing food policies and standards, ensuring that the business community embraces the importance of providing nutritious and safe meals. Officials also examined how the “Clean Sri Lanka” initiative contributes to this change in the food sector.",
    "The meeting was attended by Kapila Bandara, Senior Additional Secretary to the President, S.P.C. Sugeeshwara, Additional Secretary to the President and other senior officials representing the National Food Promotion Board, the Ministry of Health and the Ministry of Agriculture."
  ]
}