{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-06-22-55fbfc",
  "num": "55fbfc",
  "date_str": "2025-06-22",
  "description": "President’s Fund felicitates Top Achievers in A/L Examinations",
  "url_metadata": "https://pmd.gov.lk/news/presidents-fund-felicitates-top-achievers-in-a-l-examinations/",
  "lang": "en",
  "article_title": "President’s Fund felicitates Top Achievers in A/L Examinations",
  "article_body_paragraphs": [
    "Three hundred students from the Northern Province who excelled in all subject streams of the 2023 G.C.E. Advanced Level (A/L) Examination will each receive a grant of Rs. 100,000 from the President’s Fund.",
    "As part of a newly launched initiative to honour high-performing students at the district level for the 2023/2024 G.C.E. A/L Examination, the President’s Fund hosted an award ceremony this morning (22) at the Iranamadu Nelum Piyasa Auditorium in the Northern Province.",
    "During the event, 300 students from the districts of Jaffna, Kilinochchi, Mullaitivu, Mannar and Vavuniya, specifically 60 students per district, with the top 10 students from each subject stream, were recognised and presented with financial awards for their outstanding academic performance. The President’s Fund has allocated a total of Rs. 30 million for this initiative, which is expected to be extended to all districts in the future.",
    "Dr. Nandika Sanath Kumanayake, Secretary to the President, addressed the gathering and noted that following the formation of the new government, the President’s Fund has been restructured and expanded under the leadership of President Anura Kumara Disanayaka. He emphasised that the Fund now operates with increased transparency, correcting past irregularities to ensure benefits are directed to the truly deserving. Dr. Kumanayake also mentioned ongoing efforts to digitise the Fund and decentralise its services to improve accessibility and efficiency.",
    "He further highlighted that education is the key to a successful life and urged the students to take full advantage of the support provided, pursue academic excellence, become responsible citizens and contribute positively to the country’s development.\nAlso addressing the event were Speaker (Dr.) Jagath Wickramaratne and Minister of Fisheries, Aquatic and Ocean Resources, Ramalingam Chandrasekar.",
    "A vote of thanks was delivered by Abhishek, a student from Jaffna Hindu College, who expressed heartfelt appreciation to the President and the President’s Fund. He described the programme as a valuable opportunity for students from economically disadvantaged backgrounds to pursue higher education and achieve their goals.",
    "In attendance at the ceremony were Northern Province Governor Nagalingam Vethanayahan, Deputy Minister of Cooperative Development Upali Samarasinghe, Members of Parliament K. Ilankumaran, Rajeevan Jeyachandramoorthy and M. Jagadeeswaran, along with other public representatives. Also present were Mr. Roshan Gamage, Senior Additional Secretary to the President and Secretary of the President’s Fund, senior officials from the Fund, government officers, heads of security forces, parents and students."
  ]
}