{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-04-en-61762c",
  "num": "en-61762c",
  "date_str": "2025-07-04",
  "description": "National Research and Development Policy Draft Stakeholder Awareness…",
  "url_metadata": "https://pmd.gov.lk/news/national-research-and-development-policy-draft-stakeholder-awareness-programme-successfully-concludes/",
  "lang": "en",
  "article_title": "National Research and Development Policy Draft Stakeholder Awareness Programme Successfully Concludes",
  "article_body_paragraphs": [
    "The three-day stakeholder awareness programme on the Draft National Research and Development Policy, jointly organised by the Presidential Secretariat and the Ministry of Science and Technology, successfully concluded yesterday (03) at Temple Trees.",
    "Dr. Nandika Sanath Kumanayake, Secretary to the President; G.P. Saputhanthri, Secretary to the Prime Minister; Dr. Harshana Suriyapperuma, Secretary to the Ministry of Finance; Y.L. Mohamed Nawawi, Secretary to the Ministry of Science and Technology; and Senior Advocate J.M. Wijebandara, Director General of Legal Affairs at the Presidential Secretariat, participated as invitees in this three-day programme.",
    "This Draft National Research and Development Policy has been prepared under the guidance of Professor Gomika Udugamasooriya, Senior Presidential Advisor on Science and Technology, and Professor G.W.A. Rohan Fernando, Chairman of the National Science and Technology Commission, with the facilitation of the National Science and Technology Commission. It has received contributions from numerous local and international experts.",
    "During this programme, Professor Gomika Udugamasooriya, Senior Presidential Advisor on Science and Technology, briefed the participants on the Draft National Research and Development Policy.",
    "In line with the government’s policy of “A Thriving Nation – A Beautiful Life,” the objective of this programme is to secure stakeholder participation in formulating the necessary National Research and Development Policy framework to guide Sri Lanka towards a prosperous knowledge-based economy.",
    "During the programme, ideas and suggestions from experts in the research and development field were gathered to ensure that the National Research and Development Policy, when practically implemented, aligns with national needs. Accordingly, this aims to formulate a futuristic policy to establish a centralised mechanism essential for successfully addressing current challenges in that field.",
    "Delivering the keynote address, Professor Gomika Udugamasooriya pointed out that there is currently a visionary leadership that prioritises and values the research and development sector. He stated that economic progress, social well-being and environmental sustainability are the main objectives of formulating this national policy. He further added that according to United Nations reports, only about 60% of Sri Lanka’s human capital is utilised, and since the country has a highly intelligent population, this policy approach is crucial for properly leveraging their potential.",
    "Professor Udugamasooriya stated that developed countries allocate between 3% and 5% of their GDP to the research and development sector, while countries like Sri Lanka have so far allocated a very small percentage to this sector. He expressed satisfaction that this situation is changing under the current government and further mentioned that investment in the research and development sector is essential for the advancement of innovation and for achieving high economic growth.",
    "Professor G.W.A. Rohan Fernando, Chairman of the National Science and Technology Commission, in his inaugural address, stated that this Draft National Research and Development Policy proposes both a legal framework for research and an ethical framework of international standards. He further added that this is expected to strengthen Sri Lanka’s research and development sector, bringing it on par with those in countries such as India, China, Malaysia and Korea.",
    "Accordingly, this Draft National Research and Development Policy has been prepared based on 10 objectives, including creating a conducive environment for research and innovation within the country, encouraging researchers and innovators, identifying national development priorities and establishing a broad platform for inventions and research focused on these, allocating adequate financial provisions for these research and development activities, and ensuring proper commercialisation.",
    "This programme will be implemented with seven principles: promoting equity, effective governance, ensuring trustworthiness and transparency, embracing diversity, and inclusivity. Notably, gender considerations have also been taken into account during the drafting of this policy. The programme will be implemented as a joint initiative involving four sectors: the government, the private sector, the general public and international stakeholders.",
    "Furthermore, the research and development sector has been categorised under 7 main themes: Agriculture and Food Security, Health, Science and Education, Technology Sector, Natural Resources, Economy and National Security and Arts and Human Development.\nThe concluding address of the programme was delivered by Mr. Y.L. Mohamed Nawawi, Secretary to the Ministry of Science and Technology, who stated that this programme should be implemented not individually but collectively, as a team, with collaboration and he invited all stakeholders to participate.",
    "At the end of the awareness session, which was held from 2:00 PM to 4:00 PM on all three days, stakeholders were given the opportunity to present their ideas and suggestions. Professor Gomika Udugamasooriya and the panel of experts provided answers and clarifications for these.",
    "Over 650 individuals participated in this three-day programme, including Ministry Secretaries, Heads of Departments, and other senior government officials; Vice-Chancellors, Deans, and Heads of Departments from government and private universities; representatives from public and private sector research institutions; and independent researchers.",
    ""
  ]
}