{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-02-12-6bc640",
  "num": "6bc640",
  "date_str": "2025-02-12",
  "description": "Speech Delivered by Hon. President Anura Kumara Disanayake…",
  "url_metadata": "https://pmd.gov.lk/news/speech-delivered-by-hon-president-anura-kumara-disanayake-at-the-world-governments-summit-2025-in-uae-on-12th-february-2025/",
  "lang": "en",
  "article_title": "Speech Delivered by Hon. President Anura Kumara Disanayake at the World Governments Summit 2025 in UAE on 12th February 2025",
  "article_body_paragraphs": [
    "Esteemed state leaders, distinguished delegates representing various organisations, honoured guests, members of the media and all those present, I seek your permission to address this extraordinary summit.",
    "It is a great privilege to speak at this significant gathering, held at a crucial juncture in human history, at a time when the world calls for unprecedented global cooperation.",
    "My country is a beautiful island nation with a unique history, a present filled with optimistic dreams for the future and a citizenry that possesses broad political and social awareness. The people of my country have a deep sense of empathy for events occurring anywhere in the world. While they cherish their traditions, they also demonstrate the wisdom and openness necessary to embrace change when required.",
    "Moreover, if you were to search the internet at this very moment with your mobile phone and ask, “Which country has the highest number of eye donations in the world?” the answer would be the nation I represent, located at the edge of the Indian subcontinent: ‘Sri Lanka’.",
    "It is a great honour and privilege for me to represent a nation of such altruistic and warm-hearted citizens, I take immense pride in addressing you on their behalf.",
    "I believe that this summit, which focuses on developing future strategies and policies concerning critical aspects of human progress, will contribute positively to global well-being at some point.",
    "Today, the challenges we face at national, regional and global levels are vast and complex.",
    "Some choose to ignore these issues, embarking on self-cantered journeys. However, isolated problems of today soon evolve into global concerns of tomorrow, knocking on everyone’s doors ultimately bringing an end to solitary pursuits.",
    "Therefore, I reiterate the importance of uniting as global citizens to confront cross-border challenges together. Addressing these crises requires collective global action and a unified front.",
    "Effective Governance and Accountability\nEnhancing governance accountability and efficiency is essential for the future world. Citizens must be encouraged to transition from individual efforts to collective initiatives.",
    "The structure of state institutions and bureaucratic systems must prioritize accountability and responsibility, as these are crucial for the future of governance.",
    "Social justice and the rule of law are not only vital for a regulated state but also for a well-functioning professional world. Proper implementation of agreements and laws, systematic support for low-income and vulnerable communities and ensuring accountability through an independent media and social activism are all of paramount importance.",
    "The emergence of digital access rights, environmental rights and other new rights—along with evolving political systems—highlights the need for an updated universal declaration on human rights, which was not envisioned in the 1948 declaration. This moment serves as a reminder of the importance of awareness and proactive engagement in addressing these pressing issues.",
    "As we strive to build a global community founded on sustainable values, it is crucial to uphold respect for the diverse cultural traditions across the world.",
    "Financing the Future and the Global Economy\nNearly 60% of the poorest countries are either in a debt crisis or at high risk of one, raising serious concerns about the future of the global economy. With tightening global financial conditions, the prospect of massive debt repayments and a poorly prepared international financial structure, the global economic outlook appears increasingly precarious. Transforming into a fair and equitable financial system is of critical importance.",
    "Climate, Crisis Mitigation and Resilient Cities\nThe world is heading toward the devastating consequences of uncontrolled industrial growth, including climate change, loss of biodiversity, and severe corruption. These issues are more frightening than a catastrophic celestial event that could impact Earth in a matter of years. While many developed countries have historically contributed to three-quarters of carbon dioxide emissions, their exposure to the impacts of climate change remains relatively low. Despite significant advancements in development, many naturally beautiful low-income countries are being ravaged by the harmful actions of others. These countries and islands, once known for their pristine coastlines, are now plagued by these disasters. If you ever visit our country, you will be astonished by the breath-taking coastal areas surrounding\nus. We are committed to making enormous efforts to protect our coastlines and preserve their beauty.",
    "Human-Cantered Future and Sustainable Growth\nThe digital revolution has already transformed the way people live, work, and communicates. While these technologies have the potential to help billions of people lead happier, healthier, and more productive lives, they also create new challenges for citizens and governments around the world. It is important not to forget that the very technologies that empower individuals can also present significant risks. Take a computer virus, for example—though it doesn’t attack with a bullet or a nuclear bomb, it can wreak havoc in ways that are far more dangerous than traditional warfare, as evidenced by the increasing threat of cyber-attacks in recent years.",
    "Global Health Transformation\nOver the next two decades, population growth, urbanization, and the rise of antimicrobial resistance will likely contribute to the continuation and expansion of several health challenges.",
    "As humans, we are inevitably interconnected. For over a year, a virus caused much of the global population to conceal their faces behind masks, creating significant pressure in both wealthy and impoverished nations.",
    "In 2024, the world saw an increase or resurgence of several infectious diseases. Among non-communicable diseases, cancer has had an extraordinary impact on people’s lives. At this moment, millions of cancer patients are fighting for survival. Heart disease, regardless of national borders, continues to devastate lives, and it has become a major global crisis. Health experts predict that by 2030, the economic cost of mental health disorders worldwide could exceed $16 trillion.",
    "The climate crisis is expected to result in an additional 14.5 million deaths by 2050, according to predictions.",
    "In this context, it is crucial to focus on digital health, new technologies, and modern health tools, as well as the relationship between environmental health, sustainability, and health financial cooperation for economically vulnerable countries.",
    "At times, you may represent the Middle East, Africa, Asia, Europe, or the West. However, the problems we all face and the call for unity, as expressed through the “lub dub” sound in our hearts, urge us to build the world together.",
    "As Martin Luther King Jr. once said, “We must learn to live together as brothers.” If we don’t, he also foresaw the consequences.",
    "We have united with a purpose to provide our people with “a thriving nation, a beautiful life,” a goal that has been historically endorsed.",
    "At this historic summit, I urge you to join us in building a beautiful life and a beautiful world.",
    "Thank you."
  ]
}