{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-01-28-en-b670e4",
  "num": "en-b670e4",
  "date_str": "2025-01-28",
  "description": "Board of Governors Meeting of the President’s Fund…",
  "url_metadata": "https://pmd.gov.lk/news/board-of-governors-meeting-of-the-presidents-fund-for-2025/",
  "lang": "en",
  "article_title": "Board of Governors Meeting of the President’s Fund for 2025",
  "article_body_paragraphs": [
    "The Board of Governors of the President’s Fund convened today (28) at the Presidential Secretariat under the leadership of President Anura Kumara Disanayake to outline plans and initiatives for the year 2025. During the meeting, approval was granted to extend the fund’s services to rural areas through a streamlined process coordinated via Divisional Secretariat offices. This decision aims to ensure that the fund’s benefits reach the grassroots level, providing greater relief and support to underserved communities.",
    "One of the key topics discussed was the issue of surgical delays in government hospitals. To address this, the council proposed facilitating surgeries outside regular working hours and offering incentives to medical staff involved in these after-hours procedures, with funding provided by the President’s Fund. Currently, this initiative is operational at the Karapitiya Teaching Hospital, and plans are underway to expand it to the National Hospital in Colombo, the Kandy General Hospital, and the Lady Ridgeway Children’s Hospital. These measures are designed to provide faster and more efficient healthcare services to patients.",
    "The council also explored the possibility of broadening educational support for students. It emphasized the need to launch new programs targeting children preparing for the G.C.E. Ordinary Level and Advanced Level examinations while continuing and expanding existing initiatives. The aim is to ensure that a larger number of students benefit from these educational programs funded by the President’s Fund.",
    "Discussions during the meeting also focused on identifying current challenges, developing new proposals, and enhancing the efficiency of the fund to deliver tangible benefits to the public.",
    "The meeting was attended by several prominent figures, including Prime Minister Dr. Harini Amarasuriya, Speaker Dr. Jagath Wickramaratne, Opposition Leader Sajith Premadasa, Secretary of the President’s Fund and the Senior Additional Secretary to the President, Roshan Gamage, Professor J R P Jayakody, former Auditor General and MP Sarath Chandrasiri Mayadunne, and other senior officials of the President’s Fund."
  ]
}