{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-09-e5d950",
  "num": "e5d950",
  "date_str": "2025-08-09",
  "description": "National Celebration of World’s Indigenous Peoples Day Held…",
  "url_metadata": "https://pmd.gov.lk/news/national-celebration-of-worlds-indigenous-peoples-day-held-in-dambana-under-the-patronage-of-the-president/",
  "lang": "en",
  "article_title": "National Celebration of World’s Indigenous Peoples Day Held in Dambana under the Patronage of the President",
  "article_body_paragraphs": [
    "The national celebration of the International Day of the World’s Indigenous Peoples, which falls today (09), was held this morning at Indigenous Museum premises, Dambana under the patronage of President Anura Kumara Dissanayake.",
    "Sri Lanka’s foremost indigenous leader, Vishwa Keerthi Vanaspathi Uruwarige Vannila Aththo, initiated the tradition of celebrating World’s Indigenous Peoples’ Day in Sri Lanka following his participation in the Indigenous Summit held in Geneva in 1996. Accordingly, the first national celebration of Indigenous Peoples’ Day in Sri Lanka was held in 1999 at Viharamahadevi Park in Colombo.",
    "This year’s celebration, jointly organised by various public and private institutions, was marked with vibrant cultural events unique to the indigenous community, including the traditional ‘kiri koraha’ ritual performed to invoke blessings for peace and prosperity.",
    "The event commenced with the President Anura Kumara Dissanayake paying floral tributes to the statue of the late indigenous community leader Uruwarige Tisahami Aththo, followed by the ceremonial planting of a white sandalwood sapling in the museum’s central courtyard.",
    "On this occasion, Sri Lanka’s current indigenous community leader, Vishwa Keerthi Sri Vanaspathi Uruwarige Vannila Aththo, presented the President with a message outlining the concerns of the indigenous community, along with a commemorative plaque.",
    "President Anura Kumara Dissanayake also presented a gift to the Indigenous Leader.",
    "The event also featured the commencement of stalls construction to display and sell products from the indigenous community, the launch of Sri Lanka’s first indigenous herbal soap “Kairie,” produced using traditional knowledge and locally sourced ingredients. During the event, certificates were awarded to indigenous women who successfully completed the Ayurvedic soap-manufacturing training programme.",
    "Attendees included the Minister of Buddhasasana, Religious and Cultural Affairs, Dr. Hiniduma Sunil Senevi, other Ministers, government officials, Canadian High Commissioner to Sri Lanka and the Maldives, Eric Walsh, officials from the Canadian High Commission and a number of invited guests."
  ]
}