{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-08-19-89edb4",
  "num": "89edb4",
  "date_str": "2025-08-19",
  "description": "Preliminary Discussions on 2026 Budget for Ministry of…",
  "url_metadata": "https://pmd.gov.lk/news/preliminary-discussions-on-2026-budget-for-ministry-of-rural-development-social-security-and-community-empowerment-held-under-presidents-patronage/",
  "lang": "en",
  "article_title": "Preliminary Discussions on 2026 Budget for Ministry of Rural Development, Social Security and Community Empowerment Held Under President’s Patronage",
  "article_body_paragraphs": [
    "Special Focus on Training Programmes for Social Service Officers in the Upcoming Budget",
    "A review meeting on the projects implemented under the 2025 budget allocations for the Ministry of Rural Development, Social Security and Community Empowerment, along with preliminary discussions on the 2026 budget proposals, was held this morning (19) at the Presidential Secretariat under the patronage of President Anura Kumara Dissanayake.",
    "The President instructed officials to ensure that the allocations provided for each group are effectively utilized to improve the living standards of rural populations, enabling them to directly contribute to the national economy. He emphasized that with funds flowing into villages, rural economies could be rapidly strengthened.",
    "Highlighting the responsibility of state officials, the President stressed the necessity for projects and programmes to be implemented systematically and properly, ensuring that the intended advantages are delivered to the people.",
    "The President also directed special attention towards persons with disabilities, calling for all necessary measures to prevent them from being marginalized as disadvantaged individuals in society. Further, he instructed that budget proposals be prepared to include training programmes for social service officers, ensuring they are well-equipped to deliver services effectively.",
    "Minister of Rural Development, Social Security and Community Empowerment Dr. Upali Pannilage, Deputy Minister of Rural Development, Social Security and Community Empowerment Wasantha Piyatissa, Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Finance Dr. Harshana Suriyapperuma, Senior Additional Secretaries to the President Russell Aponsu and Kapila Janaka Bandara, along with senior officials from the Ministry of Finance and the Ministry of Rural Development, Social Security and Community Empowerment, participated in the discussion."
  ]
}