{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-01-en-45c684",
  "num": "en-45c684",
  "date_str": "2025-07-01",
  "description": "Heads of Several Prominent Indian Companies Explore Investment…",
  "url_metadata": "https://pmd.gov.lk/news/heads-of-several-prominent-indian-companies-explore-investment-opportunities-in-sri-lanka/",
  "lang": "en",
  "article_title": "Heads of Several Prominent Indian Companies Explore Investment Opportunities in Sri Lanka",
  "article_body_paragraphs": [
    "No More Unpleasant Experiences of Corruption in Investments",
    "– President",
    "Indian entrepreneurs state that they are currently directing their attention towards new investment prospects in Sri Lanka, particularly in sectors like energy, infrastructure, the digital economy, tourism and agriculture, as well as on enhancing entrepreneurial capacity.",
    "A delegation of around 20 Indian entrepreneurs, comprising heads of several prominent Indian companies, is currently engaged in an active programme in Sri Lanka, coordinated by the Confederation of Indian Industry (CII), with the aim of further developing existing investment opportunities and exploring new prospects. These comments were expressed during the delegation’s meeting with President Anura Kumara Disanayake this afternoon (01) at the Presidential Secretariat.",
    "The delegation is visiting Sri Lanka following an invitation extended by President Anura Kumara Disanayake during his recent official visit to India. The Indian delegation held discussions with several Sri Lankan Ministers and with officials from key government institutions, including the Board of Investment of Sri Lanka.",
    "President Disanayake emphasized that the country has now established a more favourable environment for investors, owing to the current economic stability.",
    "The President briefed the Indian business representatives on the constructive measures implemented by the government to create a supportive economic climate and conditions conducive to investment. He further noted that the government has strengthened the legal framework and institutional system necessary to attract and sustain large-scale investments. He assured that under the present administration efforts have been made to eliminate the losses and corruption previously associated with investments.",
    "The President also emphasised that special attention has been given to attracting regional investors and providing them with the necessary facilities. He pointed out that numerous new business opportunities have opened up between India and Sri Lanka across various sectors.",
    "The Indian entrepreneurs stated that Sri Lanka’s strategic location is of great appeal to investors. They appreciated the President’s explanation regarding the current situation of the country, noting that it had inspired confidence and renewed hope in them.",
    "Minister of Labour and Deputy Minister of Economic Development Professor Anil Jayantha Fernando, Senior Additional Secretary to the President, Roshan Gamage, and Indian High Commissioner to Sri Lanka Santosh Jha, along with officials from the Indian High Commission, were present at the occasion. Also in attendance were former Chairman of CII and Chairman and Managing Director of ITC Limited, Sanjiv Puri, and heads of several other major Indian companies."
  ]
}