{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-04-en-df6ad7",
  "num": "en-df6ad7",
  "date_str": "2025-04-04",
  "description": "Measures to Address Issues Arising from the Nilwala…",
  "url_metadata": "https://pmd.gov.lk/news/measures-to-address-issues-arising-from-the-nilwala-salinity-barrier/",
  "lang": "en",
  "article_title": "Measures to Address Issues Arising from the Nilwala Salinity Barrier",
  "article_body_paragraphs": [
    "A series of short-term measures have been proposed to address the irrigation challenges caused by the Nilwala River Salinity Barrier until a long-term solution is implemented.",
    "During a recent discussion chaired by the Secretary to the Presidential Dr. Nandika Sanath Kumanayake, officials from all relevant ministries and institutions agreed to promptly implement these proposals.",
    "As part of these measures, the sand piled along the riverbanks, which was deposited during the construction of the salinity barrier, will be removed to ensure smooth water flow during floods. The height of the sheet pile barriers on both sides of the salinity barrier will be reduced to facilitate water drainage. Accumulated sand in the riverbed will be cleared, while alternative canal pathways will be cleaned and obstructions removed to improve water flow. Additionally, water pumping stations used to drain excess water from paddy fields will be properly maintained.",
    "To address the drainage issues affecting the homes, lands and access roads of residents of Circle Road, Hittatiya centre, Matara during heavy rains, a few short-term solutions have been proposed while awaiting a permanent resolution. A new drainage system will be developed along Dahanayake Road to divert water from Hittatiya First Milepost to Nupe Ela, replacing the current connection to the canal system along Circle Road. The existing drainage system will be upgraded to increase its capacity.",
    "The drainage capacity along Circle Road will be improved and telecommunication cables currently obstructing water flow in the drainage system will be relocated to a more suitable location. The drainage system from the central section of Circle Road through Handayawatta and along Padiliyawatta Road to Nupe Ela will be expanded, with blockages removed to enhance water flow. Upon obtaining the final land survey map from the local authorities, a decision will be made regarding the existence of a natural canal in the affected area.",
    "Meanwhile, the ongoing study by the University of Peradeniya to identify long-term solutions for the issues arising from the Nilwala Salinity Barrier will be reassessed and reviewed."
  ]
}