{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-01-17-887d83",
  "num": "887d83",
  "date_str": "2025-01-17",
  "description": "China to Support Sri Lanka’s Government in Achieving…",
  "url_metadata": "https://pmd.gov.lk/news/china-to-support-sri-lankas-government-in-achieving-its-vision-of-a-thriving-nation-a-beautiful-life/",
  "lang": "en",
  "article_title": "China to Support Sri Lanka’s Government in Achieving its Vision of “A Thriving Nation – A Beautiful Life”",
  "article_body_paragraphs": [
    "– Chinese Premier Li Qiang",
    "Chinese Premier Li Qiang expressed China’s fullest support for the efforts of the current government of Sri Lanka to achieve its vision of “A Thriving Nation – A Beautiful Life” for the people of Sri Lanka.",
    "Premier Li made this statement during a meeting with Sri Lankan President Anura Kumara Disanayake in Beijing, today (16).",
    "During the meeting, Premier Li warmly welcomed President Disanayake and reiterated China’s commitment to providing extensive support for Sri Lanka’s economic development.",
    "The Premier also affirmed China’s backing for the Sri Lankan government’s ongoing efforts to build a corruption-free nation.",
    "President Disanayake, in his remarks, highlighted the historic friendship between China and Sri Lanka, dating back to the time of the monk Faxian.",
    "He also sought Premier Li’s support for Sri Lanka’s initiatives to eradicate poverty and promote digitalization across the country.",
    "The President expressed deep gratitude to the Chinese government and people for their continued support to Sri Lanka, which has played a crucial role in the nation’s development.",
    "The meeting covered a wide range of topics, including strengthening the longstanding bilateral relationship, fostering investments, and expanding cooperation in cultural exchanges, trade, and political collaboration.",
    "The meeting was attended by Minister of Foreign Affairs, Foreign Employment, and Tourism Vijitha Herath, Minister of Transport, Highways, Ports, and Civil Aviation Bimal Ratnayake, Chinese Ambassador to Sri Lanka Qi Zhenhong, Sri Lanka’s Ambassador to China Majintha Jayasinghe, and other senior officials from both sides."
  ]
}