{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-01-29-023629",
  "num": "023629",
  "date_str": "2025-01-29",
  "description": "Government Allocates Record-High Budget for Capital Expenditure",
  "url_metadata": "https://pmd.gov.lk/news/government-allocates-record-high-budget-for-capital-expenditure/",
  "lang": "en",
  "article_title": "Government Allocates Record-High Budget for Capital Expenditure",
  "article_body_paragraphs": [
    "• Several decisions by the government to facilitate investors\n• A nation cannot progress without a transformative shift in public attitudes.\n• Economic resources and opportunities must be introduced at the village level.\n• Plans to prepare Sri Lanka for a transformation in Southeast Asia\n• Moving from an individual-targeted aid approach to a community empowerment model\n• Companies unable to provide a daily wage of Rs. 1700 to plantation workers should be evaluated for success.",
    "– President at the Economic Summit",
    "President Anura Kumara Disanayake stated that the upcoming budget is expected to allocate Rs. 1.35 trillion as government investment capital expenditure, marking the highest amount spent on capital expenditure by a government in recent times.",
    "",
    "The President made this statement while addressing the Economic Summit 2025 held yesterday (28) at Shangri-La Hotel, Colombo.",
    "",
    "The Sri Lanka Economic Summit 2025, organized by the Ceylon Chamber of Commerce, under the theme “Shaping Sri Lanka’s Future: Transformational Growth Rooted in Sound Economic Policies” aims to prepare Sri Lanka for a transformative shift in South Asia, built on political stability, debt restructuring, and improving sovereign credit ratings. Additionally, the summit envisions achieving overall economic growth in 2025, ensuring the nation’s readiness for a brighter and more stable future.",
    "",
    "During his address, President Disanayake further stated that the government anticipates an economic growth rate exceeding 4% this year. He also noted that achieving this target would require providing the necessary facilities to attract and sustain foreign direct investments.",
    "",
    "President Anura Kumara Disanayake elaborated on the importance of creating an environment conducive to investment and highlighted the critical role of stable economic policies in driving Sri Lanka’s progress.",
    "",
    "We represent a political movement that has not previously held power. If there were doubts about us among business groups, investors, and certain members of the international community, we have been able to dispel those concerns and build confidence in the government’s plans and future direction. This achievement over the past two months is a significant milestone for us.",
    "",
    "The government anticipates an economic growth rate exceeding 4% this year. While this is a challenging target in the face of recent economic downturns, we view it as an achievable challenge. We are prioritizing several key sectors to ensure success in this endeavour.",
    "",
    "Notably, the upcoming budget plans to allocate Rs. 1.35 trillion for capital expenditure in government investments. This will mark the largest allocation for capital expenditure by any government in recent times.",
    "",
    "In the past, due to inefficiencies, previous governments failed to fully utilize such allocations, with only 75% to 80% of the funds being spent. However, we are establishing the necessary mechanisms to ensure that the entire allocation is effectively utilized for its intended purposes.",
    "",
    "We recently held an in-depth discussion with Ministry Secretaries and government officials from institutions related to investments. During this meeting, it was revealed that securing approval for an investment in Sri Lanka requires clearance from 82 different institutions. According to the report, obtaining these approvals currently takes over two and a half years.",
    "",
    "For environmental approvals alone, there are 11 institutions involved, and the process takes approximately 269 days. In practical terms, this exceeds two years. The government plans to reduce this timeline to less than 82 days.",
    "",
    "Similarly, an investment project requires approvals from eight additional institutions, which currently takes around 184 weeks. We aim to reduce this to 102 days.",
    "",
    "For evaluating and making decisions on a project, the Board of Investment (BOI) currently takes around 80 days. Our goal is to streamline this process to less than two weeks.",
    "",
    "If we expect a higher rate of economic growth, we must ensure that all necessary facilities and processes for attracting foreign direct investment are efficient and investor-friendly.",
    "",
    "We also have a significant opportunity to achieve rapid growth in the tourism sector. This year, we aim to attract over 03 million tourists to Sri Lanka.",
    "",
    "In addition, there is potential for substantial growth in the information technology and maritime sectors. Operations at the Western Terminal are set to commence this March, and by July, operations at the Eastern Terminal are expected to begin. This will contribute to notable economic progress in the maritime sector. We have identified several key sectors that must be prioritized to achieve our desired economic growth, and we are confident in our ability to meet these goals.",
    "",
    "We have also reached an agreement regarding the Sampur Power Plant and are preparing to quickly initiate operations at the supply hub, which has been stalled for a long time at the port. Furthermore, several projects under the BOI have been delayed, and we are actively working to expedite approvals and permits needed to move these projects forward efficiently.",
    "",
    "Additionally, we are in discussions with India and China regarding major projects, which we believe will bring in a significant volume of foreign investment. With this confidence, we are moving forward to attract these investments to Sri Lanka.",
    "",
    "Previous governments have failed to attract investments effectively, and the Board of Investment (BOI) has not operated efficiently. To address these issues, a new structure has been proposed through the Economic Transformation Act. However, this Act currently lacks a comprehensive implementation mechanism. The present government intends to move forward with the Act, incorporating necessary amendments.",
    "",
    "In the past, decisions made by political authorities faced resistance when implementing those decisions by the state mechanism. The state mechanism always assumed that political authority was trying to enforce hidden agendas. However, we have now proven that there are no concealed motives within political authority. Therefore, we believe the state mechanism will cooperate with us. In this process, even the state mechanism’s attitudes must change. If decisions are not made within a specified timeframe, the expected outcomes cannot be achieved. Digital transformation is essential—not only to improve efficiency and convenience but also to elevate the country to a new level. Therefore, digitizing government services is a priority at this stage. The implementation of a Electronic National Identity Card, despite previous misconceptions, presents an opportunity to create a globally relevant identity system. The Indian government has already pledged Rs. 10 billion to support this initiative.",
    "",
    "It is clear that a new administrative framework is needed. The existing state administration has proven to be ineffective and corrupt. Additionally, accessing public services comes with a significant financial burden. Some institutions no longer serve a necessary function. While they may have been established to meet past needs, there is currently no proper plan to utilize them effectively. There are multiple state institutions operating within the same sector, which leads to inefficiency. Therefore, these institutions must be consolidated to ensure better management and resource allocation.",
    "",
    "Around 90% of Sri Lanka’s export revenue is generated by just a few organizations. Similarly, 69% of customs revenue comes from only 621 files. Furthermore, while the Western Province contributes 37% to the national economy, the Uva Province contributes only 5%. Concentrating the economy in the hands of small groups will not allow for sustainable economic expansion.",
    "",
    "The “Aswesuma” program benefits 1.8 million individuals, but there are still more groups that require support. To eliminate rural poverty, it is essential to create new economic opportunities. The current government aims to introduce new sources of economic growth at the village level. When this happens, economic benefits will flow to rural areas, and by increasing the productivity and capacity of the people, rural poverty can be alleviated.",
    "",
    "Until now, Sri Lanka’s approach has largely been focused on providing aid to individuals. For example, targeting a single person by giving them a cow or a few chickens as assistance. If such methods had been effective, Sri Lanka would now have numerous large-scale farms. Recognizing this limitation, the government is now planning to empower communities by creating new economic opportunities that focus on sustainable growth.",
    "",
    "Within the framework of the International Monetary Fund’s (IMF) criteria, the government is strengthening support programs for those in genuine need. A targeted plan is also in place to stimulate financial growth. Previously, welfare mechanisms in Sri Lanka were heavily politicized. The current administration has ended this practice and established a system to ensure that aid reaches only those who genuinely need it.",
    "",
    "Although the term “free market” is often used, the global market is not entirely free. It is divided into different segments, and the government is working to secure a share for our country in this fragmented global market. One of the key strategies being studied is expanding into the global market by leveraging our proximity to India, which is one of our closest markets. The government is reviewing the previous trade agreement with India, considering its advantages and disadvantages, and aims to establish a new trade agreement to better position Sri Lanka in the global market.",
    "",
    "The world doesn’t stop based on statements. Currently, declarations made by the United States may lead to conflicting or alarming situations, but the world continues to move forward despite such statements.",
    "",
    "To build the country, we must all unite. Providing government services comes at a significant cost. The government workforce stands at 1.3 million, and while there is an excess of lower-level employees, there is a substantial shortage of mid-level staff. If exams were conducted, even individuals employed in the private sector would be interested in government positions. Therefore, a dialogue is needed to transform the private sector into an attractive place of employment as well.",
    "",
    "In 1991, the government provided companies with certain benefits, but even after 32 years, a plantation worker still doesn’t earn more than Rs.1,700 daily. This raises questions about the success of those companies. Recently, customs officials opened containers that had been brought in illegally. However, there was no one present to claim responsibility for them. Upon inspection, the containers were found to have labels from a well-known company. This highlights the need for a shift in public perception. While we have introduced good governance practices, the country cannot move forward without a fundamental transformation in mind-set.",
    "",
    "Key figures like Minister of Labour and Deputy Minister Economic Development Dr. Anil Jayanth Fernando, Central Bank Governor Dr. Nandalal Weerasinghe, Deputy Minister of Industries and Entrepreneurship Development Chathuranga Abeysinghe, and Senior Presidential Advisor on Economic Affairs Duminda Hulangamuwa, along with officials from Ceylon Chamber of Commerce, participated in this event."
  ]
}