{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-29-en-2429ad",
  "num": "en-2429ad",
  "date_str": "2025-05-29",
  "description": "Polish Foreign Minister Radosław Sikorski Meets President",
  "url_metadata": "https://pmd.gov.lk/news/polish-foreign-minister-radoslaw-sikorski-meets-president/",
  "lang": "en",
  "article_title": "Polish Foreign Minister Radosław Sikorski Meets President",
  "article_body_paragraphs": [
    "• Sri Lanka holds significant importance for both the European Union and Poland\n— Polish Foreign Minister Radosław Sikorski",
    "Minister of Foreign Affairs of the Republic of Poland, in the context of Poland’s Presidency of the Council of the European Union Radosław Sikorski, currently on an official visit to Sri Lanka, met with President Anura Kumara Disanayake this afternoon (29) at the Presidential Secretariat for discussions.",
    "The discussions focused extensively on strengthening cooperation between Sri Lanka and the European Union. President Disanayake emphasized the importance of continued EU support in overcoming future global economic challenges facing Sri Lanka.",
    "President Disanayake stated that, in the face of challenges arising from the newly introduced tariff regime by the United States and the fiscal constraints imposed by the International Monetary Fund, Sri Lanka hopes to engage in broader cooperation with the European Union to address emerging economic pressures.",
    "The President expressed his appreciation for the positive response demonstrated by the European Union regarding the continued maintenance of the GSP+ concession granted to Sri Lanka.",
    "Meanwhile Polish Foreign Minister Radosław Sikorski stated that his visit reflects the special attention both the European Union and Poland place on Sri Lanka.",
    "The discussion also focused on further strengthening the historic ties between Sri Lanka and Poland, with both sides expressing interest in enhancing bilateral collaboration.",
    "Polish Foreign Minister Radosław Sikorski recalled the 50 years of economic and trade and 30 years of development cooperation between Sri Lanka and Poland. He expressed his government’s intention to work closely with the new administration in Sri Lanka to further advance these relations.",
    "The delegation including Ambassador of the European Union to Sri Lanka Carmen Moreno, Secretary to the President Dr. Nandika Sanath Kumanayake, Senior Additional Secretary to the President Roshan Gamage were among the other officials."
  ]
}