{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-12-10-458108",
  "num": "458108",
  "date_str": "2024-12-10",
  "description": "Cabinet Approves President’s Food Security Committee Proposal to…",
  "url_metadata": "https://pmd.gov.lk/news/cabinet-approves-presidents-food-security-committee-proposal-to-ensure-affordable-quality-nutrition-for-all-citizens/",
  "lang": "en",
  "article_title": "Cabinet Approves President’s Food Security Committee Proposal to Ensure Affordable, Quality Nutrition for All Citizens",
  "article_body_paragraphs": [
    "Attention will be given to maintaining a data system to monitor the existing food stocks in the country",
    "Ensuring national food and nutrition security and providing safe access to food are among the government’s top priorities. In line with this, the Cabinet has approved a proposal by President Anura Kumara Dissanayake to establish a Food Policy and Security Committee under the Presidential Secretariat. The committee aims to provide every citizen with their minimum food requirements in sufficient quantity and quality at an affordable price.",
    "According to the new government policy statement, the Food Policy and Security Committee will focus on the following key objectives:",
    "• Promoting domestic production of all food items that can be produced locally.\n• Maintaining a reserve stock of essential food sufficient for at least three months.\n• Establishing and maintaining a comprehensive data system on existing food stocks in the country.\n• Developing and implementing effective programs to enhance food security by ensuring efficient production, storage, distribution, wholesale, and retail marketing processes, with active participation from the private sector.",
    "These priorities define the committee’s primary tasks to ensure food security and sustainability in the country.",
    "Accordingly, to ensure food security and nutrition, a committee will be established under the co-chairmanship of the Minister of Agriculture, Livestock, Lands, and Irrigation, and the Minister of Trade, Commerce, Food Security, and Cooperative Development.",
    "This committee will comprise the Secretary to the Prime Minister and relevant ministry secretaries. Its primary function will be to provide policy guidance based on scientific analysis, leveraging data and information with the active participation of all related institutions."
  ]
}