{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-06-05-c2738b",
  "num": "c2738b",
  "date_str": "2025-06-05",
  "description": "Marine Drive Tree Planting and Conservation Project in…",
  "url_metadata": "https://pmd.gov.lk/news/marine-drive-tree-planting-and-conservation-project-in-conjunction-with-world-environment-day-and-clean-sri-lanka-programme/",
  "lang": "en",
  "article_title": "Marine Drive Tree Planting and Conservation Project in Conjunction with World Environment Day and “Clean Sri Lanka” Programme",
  "article_body_paragraphs": [
    "In line with World Environment Day, a tree planting and conservation project was launched this morning (5) along the coastal stretch of Colombo’s Marine Drive, from the Kollupitiya Railway Station towards Wellawatte. The initiative is being implemented by the Clean Sri Lanka Secretariat Office.",
    "Marking the commencement of the project, 1,600 Takkada (Scaevola taccada) saplings were planted today, with plans to expand the number to 6,000 in the near future. The project is being carried out with participation from state institutions, private organisations and the general public.",
    "The Takkada plant, which includes two species highly resistant to saline environments, is listed as a threatened species on the Red Data List. The Scaevola taccada species planted today typically grows as a shrub reaching heights of 5 to 6 feet. Its dense green foliage and compact height make it ideal for urban settings, enhancing cityscapes with both environmental and aesthetic value.",
    "This initiative is being carried out with the collaboration of the Sri Lanka Army, Sri Lanka Police (Environmental and Traffic Divisions), Sri Lanka Railways, Road Development Authority, Urban Development Authority and the Colombo Municipal Council. It is sponsored by LB Finance PLC and Hemsandu Marketing Company.",
    "The event was attended by Colombo Municipal Councillor Vraie Cally Balthazaar, Senior Additional Secretary to the President (Finance and Economic Affairs) G.M.R.D. Appuhamy, along with representatives from the sponsoring organisations and other distinguished guests."
  ]
}