{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-25-en-c33390",
  "num": "en-c33390",
  "date_str": "2025-07-25",
  "description": "President Inaugurates Hotel Show Colombo – 2025",
  "url_metadata": "https://pmd.gov.lk/news/president-inaugurates-hotel-show-colombo-2025/",
  "lang": "en",
  "article_title": "President Inaugurates Hotel Show Colombo – 2025",
  "article_body_paragraphs": [
    "The ‘Hotel Show Colombo – 2025’ was officially inaugurated this morning (25) by President Anura Kumara Dissanayake at the Sirimavo Bandaranaike Memorial Exhibition Centre (BMICH), Colombo.",
    "This exhibition, which is jointly organized annually by the Sri Lanka Hospitality Graduates Association (SLHGA) in collaboration with the public and private sectors, is being held for the 17th time this year.",
    "The Colombo Hotel Show, which began in 1998, is the largest hospitality trade exhibition in Sri Lanka and serves as a valuable opportunity to promote the country’s tourism industry on an international level.",
    "President Anura Kumara Dissanayake, who inaugurated the Hotel Show Colombo – 2025 exhibition, also visited the exhibition stalls and engaged in friendly conversation with the attendees.",
    "Addressing the ceremonial event, Minister of Foreign Affairs, Foreign Employment and Tourism, Mr. Vijitha Herath stated that Sri Lanka’s tourism industry is steadily progressing day by day. Expressing optimism for its future, the Minister noted that the tourism sector is expected to become a key contributor to strengthening the national economy in the coming years.",
    "A large number of people representing the hotel industry, including those involved in hotel supplies and services, as well as the tourism sector, participated in the event. Among those in attendance were Chairman of the Organizing Committee of the ‘Hotel Show Colombo 2025’, Mr. Trevin Gomez and Mr. Patrick Pereira, President of Sri Lanka Hospitality Graduates Association."
  ]
}