{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-03-17-b0a693",
  "num": "b0a693",
  "date_str": "2025-03-17",
  "description": "The President Meets with officials from the Ministry…",
  "url_metadata": "https://pmd.gov.lk/news/the-president-meets-with-officials-from-the-ministry-of-tourism/",
  "lang": "en",
  "article_title": "The President Meets with officials from the Ministry of Tourism",
  "article_body_paragraphs": [
    "“Improve the quality of infrastructure and services provided to tourists visiting the country.”\n– President",
    "President Anura Kumara Disanayake emphasized the necessity of providing high-quality infrastructure and services for tourists visiting Sri Lanka, as the country has gained significant international recognition as an attractive tourist destination.",
    "Accordingly, the President instructed officials to pay special attention to this matter and take necessary actions.",
    "President Disanayake issued these instructions during a discussion held today (17) at the Presidential Secretariat with officials from the Ministry of Tourism.",
    "During the discussion, officials briefed the President on the budgetary allocations designated for the Ministry of Tourism and the projects being implemented under those funds.",
    "With the tourism sector taking a new step forward, Sri Lanka aims to attract three million tourists this year. The discussion also extensively covered the utilization of these budgetary allocations for the development of essential infrastructure to support this goal.",
    "Minister of Foreign Affairs, Tourism and Foreign Employment Vijitha Herath, Deputy Minister of Tourism Dr. Ruwan Ranasinghe, Secretary to the President Dr. Nandika Sanath Kumanayake, Senior Additional Secretary to the President Roshan Gamage, Secretary to the Ministry of Foreign Affairs, Foreign Employment and Tourism Aruni Ranaraja, along with a group of senior officials from the Ministry of Tourism, attended this discussion."
  ]
}