{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-10-07-2f128d",
  "num": "2f128d",
  "date_str": "2024-10-07",
  "description": "Sri Lanka Secures USD 200 Million from World…",
  "url_metadata": "https://pmd.gov.lk/news/sri-lanka-secures-usd-200-million-from-world-banks-ida-for-second-phase-of-reset-program/",
  "lang": "en",
  "article_title": "Sri Lanka Secures USD 200 Million from World Bank’s IDA for Second Phase of RESET Program",
  "article_body_paragraphs": [
    "The International Development Association (IDA) of the World Bank Group (WBG) has approved a USD 200 million financing package to support the second phase of Sri Lanka’s Resilience, Stability, and Economic Turnaround (RESET) Development Policy Financing (DPF) program.",
    "The agreement was signed today (07) by K.M. Mahinda Siriwardana, Secretary to the Ministry of Finance, Economic Development, Policy Formulation, Planning, and Tourism, and David N. Sislen, World Bank Country Director for Sri Lanka in the presence of President Anura Kumara Dissanayake.",
    "This financing is part of the World Bank’s continued commitment to assist Sri Lanka in its comprehensive reform agenda. The RESET DPF program, which operates in tandem with the IMF’s Extended Fund Facility (EFF), is aimed at addressing the root causes of the island nation’s ongoing economic crisis. The two-year program (2023–2024) is designed to restore stability through macroeconomic adjustments while protecting the poor and vulnerable. The first phase of the program, implemented in 2023, successfully secured USD 500 million after meeting seven key prior actions under three pillars.",
    "The three key pillars of the RESET DPF program are:",
    "1. Improving Economic Governance: Strengthening fiscal discipline, transparency, and accountability in public resource management while safeguarding financial stability.",
    "2. Enhancing Growth and Competitiveness: Unlocking Sri Lanka’s growth potential through a more competitive private sector.",
    "3. Protecting the Poor and Vulnerable: Shielding the most affected segments of society from the economic fallout of the crisis.",
    "In 2024, the Government of Sri Lanka plans to access the USD 200 million loan from the IDA to support the second phase of the RESET program. To qualify, the government must fulfill nine prior actions under the three key pillars and maintain a sound macroeconomic policy framework. The World Bank Board granted approval for the financing facility, which will take effect upon the signing of the Financing Agreement.",
    "This financial assistance from the World Bank is expected to play a crucial role in stabilizing Sri Lanka’s economy and preventing a recurrence of similar crises in the future, while fostering a more inclusive and competitive economic environment."
  ]
}