{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-08-05-en-bc09a3",
  "num": "en-bc09a3",
  "date_str": "2025-08-05",
  "description": "President Attends “Sith Roo – 2025” Concert",
  "url_metadata": "https://pmd.gov.lk/news/president-attends-sith-roo-2025-concert/",
  "lang": "en",
  "article_title": "President Attends “Sith Roo – 2025” Concert",
  "article_body_paragraphs": [
    "The “Sith Roo – 2025” concert, organised by the Department of Social Services with the aim of elevating the aesthetic talents of differently abled persons to a national platform, was held this afternoon (05 August) at the Nelum Pokuna (Lotus Pond ) Theatre in Colombo, under the patronage of President Anura Kumara Dissanayake.",
    "The event is conducted as part of the Department of Social Services’ efforts to implement the government’s national policy “Leaving No One Behind,” concerning persons with disabilities across Sri Lanka. It seeks to ensure their rights, promote social integration, empowerment as well as rehabilitation and affirm their right to live as dignified citizens and active contributors to the national economy. Notably, this year’s event marks the revival of the programme after a six-year break.",
    "An allocation of Rs. 632 million has been made in this year’s budget to the Department of Social Services for the rehabilitation, empowerment and care of persons with disabilities.",
    "During the event, President Dissanayake presented gifts and awards to children from child guidance centres, child care centres and vocational training institutes, who emerged victorious in the provincial-level competition of “Sith Roo -2025”.",
    "The President also engaged in friendly conversation with the children and joined them for group photographs.",
    "Furthermore, a portrait of the President, drawn by a schoolgirl, was presented to President Anura Kumara Dissanayake during the ceremony.",
    "The occasion was graced by Minister of Rural Development, Social Security and Community Empowerment, Upali Pannilage, Deputy Minister Wasantha Piyathiss, Secretary to the Ministry, Sampath Mantrinayake, Director of the Department of Social Services, Darshani Karunaratne and senior officers of the Department."
  ]
}