{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-04-01-e6d4c5",
  "num": "e6d4c5",
  "date_str": "2025-04-01",
  "description": "Government Launches New Programme to Provide Affordable and…",
  "url_metadata": "https://pmd.gov.lk/news/government-launches-new-programme-to-provide-affordable-and-nutritious-meals/",
  "lang": "en",
  "article_title": "Government Launches New Programme to Provide Affordable and Nutritious Meals",
  "article_body_paragraphs": [
    "A new government initiative aimed at ensuring food security and making nutritious meals affordable for the public was officially launched today (01) at the “Palessa” restaurant of the National Food Promotion Board in Narahenpita.",
    "This project is being implemented in collaboration with the National Food Promotion Board, the Ministry of Health, and the Ministry of Agriculture. It also involves the support of existing restaurant businesses and is integrated with the “Clean Sri Lanka” programme.",
    "Through this initiative, people can now enjoy specially prepared nutritious meals for as low as Rs. 200. The government also plans to introduce this balanced meal package to both public and private restaurants in the near future.",
    "In addition to cooked meals, a variety of packaged local food products and nutritious snacks will also be made available to the public at affordable prices.",
    "The event’s special guest, Minister of Agriculture, Livestock, Lands and Irrigation, K.D. Lalkantha, emphasized the importance of providing the public with high-quality, healthy, and sufficient meals. He stated that the project was launched in collaboration with the “Clean Sri Lanka” programme to guide the public and promote a positive shift in the commercial food sector.",
    "The event was attended by Senior Additional Secretary to the President S.P.C. Sugeeshwara, Director Nutrition Division of the Ministry of Health Dr. Monika Wijeratne, senior officials from the Ministry of Health, Ministry of Agriculture, and the National Food Promotion Board, as well as business representatives from the private sector."
  ]
}