{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-18-en-5eb9e4",
  "num": "en-5eb9e4",
  "date_str": "2025-04-18",
  "description": "Foreign Diplomats head to Kandy by Train for…",
  "url_metadata": "https://pmd.gov.lk/news/foreign-diplomats-head-to-kandy-by-train-for-siri-dalada-vandanawa-inauguration-ceremony/",
  "lang": "en",
  "article_title": "Foreign Diplomats head to Kandy by Train for “Siri Dalada Vandanawa” inauguration Ceremony",
  "article_body_paragraphs": [
    "The ‘Siri Dalada Vandanawa’, a special veneration of the Sacred Tooth Relic, will commence today (18) after 16 years. President Anura Kumara Disanayake, along with Ambassadors, High Commissioners and other diplomats representing several countries, is expected to participate in the inaugural event.",
    "Diplomats from Vietnam, Bangladesh, Indonesia, Nepal, the Netherlands, India, Myanmar, Palestine, France, New Zealand, Cuba, Egypt, Japan, the United Kingdom, Thailand, Canada and South Korea are among those taking part. The group traveled to Kandy this morning in a special observation saloon of a train that departed from Colombo Fort Railway Station at around 7:00 a.m.",
    "This initiative aims to convey a message to Sri Lanka’s friendly nations that the country is recovering economically, overcoming previous challenges, and fostering national harmony. The event also seeks to strengthen international support for Sri Lanka.",
    "Upon arrival in Kandy, the delegation first visited the Mahaweli Reach Hotel, where a special Sinhala and Tamil New Year celebration was organized in accordance with local customs to welcome them.",
    "Additional diplomats are expected to join the group in Kandy, bringing the total number of participants to 44. Together, they will proceed to the Temple of the Sacred Tooth Relic to take part in the inauguration ceremony of the “Siri Dalada Vandanawa.” Afterward, the group will return to Colombo by train.",
    "At the request of the President, the Siri Dalada Vandanawa will be held under the guidance of the Chief Prelates of the Malwathu and Asgiri Chapters, and under the direction of the Diyawadana Nilame of the historic Temple of the Sacred Tooth Relic in Kandy. The event will continue for 10 days, from today until April 27.",
    "Today (18), on the opening day, the public will have the opportunity to pay homage to the Sacred Tooth Relic from 3:00 p.m. to 5:00 p.m. From tomorrow (19) onwards, veneration will be open daily from 12:00 p.m. to 5:00 p.m."
  ]
}