{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2024-12-05-995a5c",
  "num": "995a5c",
  "date_str": "2024-12-05",
  "description": "A proper mechanism must be followed when issuing…",
  "url_metadata": "https://pmd.gov.lk/news/a-proper-mechanism-must-be-followed-when-issuing-excise-licenses/",
  "lang": "en",
  "article_title": "A proper mechanism must be followed when issuing excise licenses.",
  "article_body_paragraphs": [
    "-President",
    "President Anura Kumara Dissanayake has directed officials to follow a proper mechanism when issuing excise licenses.",
    "These instructions were given during a meeting with senior Excise Department officials at the Presidential Secretariat today (05).",
    "The President stressed the importance of not abusing power to act unlawfully and emphasized the need to consistently uphold the law. He also urged officials to ensure timely tax collection.",
    "The discussion highlighted challenges in collecting excise taxes and the irregularities that arise in the process. New strategies were explored, including collecting overdue taxes, revoking licenses of blacklisted institutions, and addressing entities that fail to collect taxes properly.",
    "The discussion also covered the shortcomings of the existing rules and regulations regarding tax collection. The President was made aware of the issues arising in the tax collection process, as well as the weaknesses in the recruitment system for excise officers.",
    "President Anura Kumara Dissanayake noted the public’s negative perception of the Excise Department and stressed the importance of managing these institutions in a way that supports the country’s economy.",
    "Officials also briefed the President on challenges in the production and packaging processes, highlighting the negative impact of artificial toddy on the public.",
    "Commissioner of Excise Rohana Senarathna, Deputy Commissioner R.V.S. Tissa Kumara, Assistant Commissioner M. J. De Silva, Chief Financial Officer G. A. Chandani, Chief Accountant W. R. Paranagama, and other senior officials of the Excise Department participated in the discussion."
  ]
}