{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-06-08-2025-06-08-3de0fb",
  "num": "2025-06-08-3de0fb",
  "date_str": "2025-06-08",
  "description": "Students from Matara Mirissa Central College and Kuliyapitiya…",
  "url_metadata": "https://pmd.gov.lk/news/students-from-matara-mirissa-central-college-and-kuliyapitiya-gunananda-central-college-visit-the-presidential-secretariat/",
  "lang": "en",
  "article_title": "Students from Matara Mirissa Central College and Kuliyapitiya Gunananda Central College visit the Presidential Secretariat",
  "article_body_paragraphs": [
    "Students from Matara Mirissa Central College and Kuliyapitiya Gunananda Central College had the opportunity to participate in the ‘Vision’ programme organised by the Presidential Secretariat today (06).",
    "This initiative is a collaborative effort by the Presidential Secretariat, the Ministry of Education and the Department of Communication of the Parliament, aimed at supporting school students.",
    "During the programme, students were informed about the ‘Clean Sri Lanka’ campaign and its underlying principles.\nSenior Additional Secretary to the President, Mr. Roshan Gamage, explained that the President’s Fund has now been extended to rural areas, enabling children who face financial difficulties in continuing their education to seek assistance.",
    "He further emphasised that students, whose education is funded by public tax revenue, have a responsibility to serve the public as contributing citizens in the future.",
    "As part of the event, the participating schools were presented with valuable saplings as a symbolic gesture to promote environmental conservation. In addition, students received copies of the ‘Vision’ magazine.",
    "The event was also attended by Air Commodore Asiri Gallage, Director of Tri-Forces Coordination at the Presidential Secretariat; Major Nadeeka Dangolla, Assistant Director; as well as principals, teachers, parents and other guests."
  ]
}