{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-01-en-561177",
  "num": "en-561177",
  "date_str": "2025-05-01",
  "description": "International Workers’ Day Message",
  "url_metadata": "https://pmd.gov.lk/news/international-workers-day-message/",
  "lang": "en",
  "article_title": "International Workers’ Day Message",
  "article_body_paragraphs": [
    "On May 1st, 1886, during a protest in Haymarket Square, Chicago, workers who demanded an eight-hour workday, was violently confronted with gunfire. To pay tribute to those who sacrificed their lives in that fight, the Second International, convened in 1889, proclaimed May 1st as International Workers’ Day, which has been observed annually ever since.",
    "This year, the working people of Sri Lanka, together with the general public, commemorate International Workers’ Day at a time when our nation and society are undergoing a profound and progressive transformation under a people-oriented governance bringing an end to a corrupt and elitist political system that has existed for 76 years, upheld by a rotating power structure dominated by a select few influential families across generations. At the recent presidential and parliamentary elections, people from all corners of Sri Lanka, regardless of ethnicity or religion, united to bring about a turning point in our nation’s politics. Responding to the people’s aspirations, we of the National People’s Power currently focused on developing a nation that is experiencing extensive economic, social and political transformation.",
    "We have already succeeded in initiating a stable recovery of an economy that was dragged to the depths by corrupt and elitist system. The evident signs of advancement are now apparent to everyone. In our very first national budget, we made historic moves significantly increasing the minimum basic salary of public servants and extensive benefits for various segments of society, including farmers, fishing community, youth, women, students, producers, small-scale entrepreneurs and professionals alike. We are diligently addressing the persistent issues encountered by plantation workers and striving to guarantee their civil rights.",
    "We recognize the necessity for a new phase in the rights we possess, aligned with the continuously evolving productive forces. Contemporary society demands a new era in human rights that encompasses digital access, environmental rights and other emerging rights that were not anticipated in the 1948 Universal Declaration of Human Rights. These changes, along with evolving political frameworks and the worldwide call for peace, require a revised and comprehensive global declaration of human rights. As we commemorate this International Workers’ Day, we must remain sensitive to these needs and dedicated to addressing them.",
    "In the face of global geopolitical shifts and growing challenges, it is the working people of Sri Lanka who continue to shoulder the burden of rebuilding our economy. As we restore and reform an economy devastated by decades of corrupt politics, I warmly invite our beloved working people to join hands in solidarity, to rise with determination and to strive towards building “a beautiful life and a thriving nation” for everyone. On this occasion, I offer my heartfelt best wishes for a meaningful International Workers’ Day one that reaffirms the rights and dignity of all working people."
  ]
}