{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-05-10-en-f9fde1",
  "num": "en-f9fde1",
  "date_str": "2025-05-10",
  "description": "State Vesak Festival 2025 Begins Under the Patronage…",
  "url_metadata": "https://pmd.gov.lk/news/state-vesak-festival-2025-begins-under-the-patronage-of-the-president/",
  "lang": "en",
  "article_title": "State Vesak Festival 2025 Begins Under the Patronage of the President",
  "article_body_paragraphs": [
    "The State Vesak Festival for the Buddhist Year 2569 commenced today (10) at the International Buddhist Centre Temple in Nuwara Eliya, under the patronage of the Most Venerable Maha Nayaka Theros of the Three Nikayas and with the participation of President Anura Kumara Disanayake.",
    "This year’s State Vesak Festival is held under the theme “Bhajetha Miththe Kalyane–Bhajetha Purisuththame” (Associate with noble friends of virtue) and will be conducted from May 10 to 16, cantered around the Nuwara Eliya District.",
    "Organized in line with the guidance of the Most Venerable Mahanayaka Theros and the directives of the All Island Shasanarakshaka Mandalaya, the festival is coordinated by the by the Presidential Secretariat, the Prime Minister’s Office, the Ministry of Buddhasasana, Religious and Cultural Affairs, the Department of Buddhist Affairs, the Central Provincial Council and the District Secretariat of Nuwara Eliya.",
    "In conjunction with the declaration of the ‘Vesak Week’ from May 10 to 16, a series of Buddhist religious programmes have been organized in accordance with government policy to promote the spiritual development of the people. Additionally, on-going development work at several temples in the Nuwara Eliya District will be completed during this period with the support of the tri-forces.",
    "Further, a number of special programmes are being implemented under the “Clean Sri Lanka” initiative to foster spiritual growth and Buddhist awareness among the public in parallel with the State Vesak Festival.",
    "Hosting this year’s State Vesak Festival in the multi-religious and multi-cultural Nuwara Eliya District is of special significance. It aims to foster Buddhist enlightenment across the country and further strengthen ties with Buddhist nations around the world.",
    "To mark the occasion of 2569th State Vesak Festival, a commemorative stamp was issued, with the first stamp being officially presented to the President.",
    "The event also included the presentation of ‘Sri Sannas Patra’ (official declarations) designating the historic Maliyadeva Purana Raja Maha Viharaya in Kotmale and the Sri Vishnu Devalaya in Kurunegala as sites of religious worship, both formally handed over by the President.",
    "The event was graced by prominent members of the Maha Sangha, including Chief Registrar of the Malwathu Chapter of the Siam Maha Nikaya and Chief Incumbent of the Somawathi Raja Maha Viharaya Most Venerable Dr. Pahamune Sri Sumangala Nayaka Thero, Anunayake of the Asgiri Chapter of the Siam Maha Nikaya Anamaduwe Most Venerable Sri Dammadassi Nayaka Thero together with the Maha Sangha representing the three Nikayas, The Chairman of the All Island Shasanarakshaka Mandalaya, Most Venerable Professor Thubulle Seelakkhanda Nayaka Thera, the Chief Registrar of Samastha Lanka Shasanarakshaka Balamandala, Venerable Muganuwala Anuruddha Nayaka Thera, along with the Maha Sangha of the Samastha Lanka Shasanarakshaka Balamandalaya.",
    "Also in attendance were multi-religious clergy, Speaker of Parliament Jagath Wickramaratne, Minister of Buddhasasana, Religious, and Cultural Affairs Dr. Hiniduma Sunil Senevi, other Ministers and MPs, Secretary to the President Dr. Nandika Sanath Kumanayake, senior government officials, foreign Ambassadors, High Commissioners, and a distinguished gathering of local and international guests.",
    ""
  ]
}