{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-14-08-2025-14-08-26f2cc",
  "num": "2025-14-08-26f2cc",
  "date_str": "2025-14-08",
  "description": "Awareness Initiative to Engage All Stakeholders in Strengthening…",
  "url_metadata": "https://pmd.gov.lk/news/awareness-initiative-to-engage-all-stakeholders-in-strengthening-sri-lankas-position-in-the-global-innovation-index/",
  "lang": "en",
  "article_title": "Awareness Initiative to Engage All Stakeholders in Strengthening Sri Lanka’s Position in the Global Innovation Index",
  "article_body_paragraphs": [
    "Under the guidance of the National Innovation Agency (NIA), which functions under the Ministry of Science and Technology, an advisory meeting on data requirements for the Global Innovation Index (GII) was held today (14) at the Bandaranaike Memorial International Conference Hall in Colombo. The meeting brought together senior officials from both the public and private sectors, representing fields such as science, technology, education and industry.",
    "The purpose of the meeting was to engage all stakeholders in elevating Sri Lanka’s position in the internationally recognised Global Innovation Index, which measures countries’ innovation performance using 80 indicators under seven key pillars. Focus areas included enhancing the nation’s global competitiveness, attracting investment and positioning Sri Lanka as a hub for knowledge, technology and entrepreneurship.",
    "The discussions reflected the Government’s commitment to fostering a culture of research and development, strengthening public–private partnerships and building a robust innovation ecosystem aligned with national priorities, all with the aim of steering the country towards a research, technology, creativity and innovation-driven economy.",
    "The meeting was attended by a large number of key representatives from major ministries, national institutions, universities and leading private sector entities, who serve as primary custodians of the required data. The programme emphasised the importance of closing data gaps, improving coordination and defining clear roles for all stakeholders to support the country’s innovation performance.",
    "Following the inaugural session, an interactive session was conducted to develop a sustainable national mechanism for data collection and reporting, ensuring that Sri Lanka’s innovation potential is accurately represented on the global stage. This initiative reflects the Government’s determination to make innovation not only a policy priority but also a practical driver of national progress.",
    "Among those present were Minister of Science and Technology (Prof.) Chrishantha Abeysena, Chairman of the NIA Governing Board and Secretary to the President Dr. Nandika Sanath Kumanayake, Governor of the Central Bank Dr. Nandalal Weerasinghe, Secretary to the Ministry of Science and Technology Mr. Y.L. Mohamed Navavi and a number of distinguished invitees representing key national institutions."
  ]
}