{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-02-27-en-054369",
  "num": "en-054369",
  "date_str": "2025-02-27",
  "description": "Presidential Secretariat and CIABOC Conduct Workshop for Government…",
  "url_metadata": "https://pmd.gov.lk/news/presidential-secretariat-and-ciaboc-conduct-workshop-for-government-officials-to-build-a-nation-of-integrity/",
  "lang": "en",
  "article_title": "Presidential Secretariat and CIABOC Conduct Workshop for Government Officials to Build a Nation of Integrity",
  "article_body_paragraphs": [
    "A workshop on the Internal Affairs Unit (IAU) and Anti-Corruption Initiative Assessment (AIA), jointly organized by the Presidential Secretariat and the Commission to Investigate Allegations of Bribery or Corruption (CIABOC), was held today (27) at the Mandarina Hotel in Colombo as part of efforts to build a nation of integrity.",
    "Delivering the keynote address on the theme “Empowering Citizens Against Corruption,” Secretary to the President Dr. Nandika Sanath Kumanayake stated that the people have expressed a clear demand for change in both the political system and the public service. He emphasized that, in response, citizens have taken steps to establish an alternative force to drive political reform.",
    "Dr. Kumanayake further noted that fulfilling the aspirations of the people is a fundamental responsibility of a democratic government. He highlighted the importance of engaging in practical mechanisms to achieve this goal, which was a key focus of the workshop.\nAccordingly, he urged all government officials to come together in building a public service founded on integrity.",
    "Recognizing the crucial role of institutions that work directly with the public, the workshop brought together officials representing all 25 District Secretariats, 9 Provincial Secretariats, 24 Ministries, and 43 Departments.",
    "The workshop was attended by CIABOC Director General R.S.A. Dissanayake, Additional Secretary to the President Chandima Wickramasinghe, Additional Director General of Customs Seevali Arukgoda, as well as officials from the CIABOC, the Presidential Secretariat and various state institutions."
  ]
}