{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-27-08-2025-27-08-2e8ddf",
  "num": "2025-27-08-2e8ddf",
  "date_str": "2025-27-08",
  "description": "Pre-Budget Discussions for 2026 with Local Entrepreneurs in…",
  "url_metadata": "https://pmd.gov.lk/news/pre-budget-discussions-for-2026-with-local-entrepreneurs-in-the-ceramic-industry-under-presidents-patronage/",
  "lang": "en",
  "article_title": "Pre-Budget Discussions for 2026 with Local Entrepreneurs in the Ceramic Industry under President’s Patronage",
  "article_body_paragraphs": [
    "– The President",
    "A pre-budget discussion for the year 2026 was held today (27) at the Presidential Secretariat under the patronage of President Anura Kumara Dissanayake with local entrepreneurs in the ceramic industry , to review concerns and proposals related to challenges in the industry.",
    "At the discussion, we extensively reviewed the government’s plans to strengthen the domestic manufacturing industry, with the aim of expanding export revenue while safeguarding local entrepreneurs. In addition, the current issues and challenges related to the manufacturing sector were thoroughly examined.",
    "Specific attention was given to ceramic products, including tiles, bathroom fittings and sanitary ware, while discussions also focused on ensuring the quality and standards of these products currently available in the market.",
    "President Anura Kumara Dissanayake stated that the government will extend its fullest possible support to ensure that high-quality, standard ceramic products are made available to local consumers at fair and affordable prices.",
    "The discussions also focused on the challenges currently faced by the ceramic industry including issues related to sourcing raw materials as well as potential solutions to address them.",
    "Secretary to the Ministry of Finance, Dr. Harshana Suriyapperuma, Chairman of the Export Development Board, Mangala Wijesinghe, along with several entrepreneurs from the private sector engaged in the ceramic industry and representatives from the export sector, were also present at the discussion."
  ]
}