{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-05-25-0bcd2b",
  "num": "0bcd2b",
  "date_str": "2025-05-25",
  "description": "Meeting Between the President and the Joint Association…",
  "url_metadata": "https://pmd.gov.lk/news/meeting-between-the-president-and-the-joint-association-of-performing-artists-of-sri-lanka/",
  "lang": "en",
  "article_title": "Meeting Between the President and the Joint Association of Performing Artists of Sri Lanka",
  "article_body_paragraphs": [
    "– President Highlights Role of Cultural Activities in Building Disciplined Citizens",
    "– President commends outdoor performance artists for bridging cultural experiences with rural communities",
    "– Solutions pledged for challenges faced by outdoor performers",
    "A meeting between President Anura Kumara Disanayake and the Joint Association of Performing Artists of Sri Lanka was held at the Presidential Secretariat, today (25).",
    "President Disanayake praised the efforts of outdoor performance artists in reviving cultural engagement, particularly in rural areas where communities have been deprived of access to cultural life. He emphasised that alongside the government’s economic development programmes, enriching the cultural lives of rural citizens is vital to alleviating their hardships.",
    "The President stressed that cultural activities play a crucial role in fostering disciplined and socially responsible citizens. He also highlighted the professional and societal obligations of performing artists in this task.",
    "The President stated that artists have the ability to build a cultural bridge linking the North and the South. He assured that the current administration genuinely wishes to foster a cultural renaissance across the nation and will extend all necessary support to achieve this goal.",
    "The Joint Association comprises representatives from the Sri Lankan Performance and Festival Organisers’ Association, Music Bands Association, Singers Association, Announcers’ Association, Dance Troupes Association and Sound Engineers’ Union. The representatives participating in this meeting presented the problems they face in carrying out their activities in the field to the President and the President took steps to provide adequate solutions to those issues on the spot, which was appreciated by the participants. The President also instructed the officials to take further steps in those measures",
    "Renowned vocalist Roshan Fernando, representing the Association, noted that President Disanayake is fostering a new political culture in Sri Lanka and expressed artists’ eagerness to contribute to this transformation.",
    "Minister of Buddhasasana, Religious and Cultural Affairs, Dr. Hiniduma Sunil Senevi, Hanif Yusoof , Governor of the Western Province, Mr. Prince Senadeera, Secretary to the Ministry of Buddhasasana, Religious and Cultural Affairs, Acting Inspector General of Police Priyantha Weerasooriya and other officials participated at this meeting."
  ]
}