{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-18-en-33a7db",
  "num": "en-33a7db",
  "date_str": "2025-06-18",
  "description": "President Commends the Service of Outgoing Treasury Secretary…",
  "url_metadata": "https://pmd.gov.lk/news/president-commends-the-service-of-outgoing-treasury-secretary-mahinda-siriwardana/",
  "lang": "en",
  "article_title": "President Commends the Service of Outgoing Treasury Secretary Mahinda Siriwardana",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake today (18), lauded Mr Mahinda Siriwardana, the outgoing Secretary to the Treasury, for his exemplary service, stating that it is the responsibility of public officials to strive to prevent adverse outcomes and contribute to positive change.",
    "The President particularly commended Mr Siriwardana’s exceptional dedication and commitment in expertly navigating the nation’s economy through the transformative period following the recent economic crisis, ultimately achieving significant economic victories for the country. President Disanayake expressed his gratitude for Mr Siriwardana’s invaluable contributions.",
    "These remarks were made by President Disanayake at a farewell ceremony organised at the Presidential Secretariat this morning (18) to mark Mr Siriwardana’s retirement from his post as Secretary to the Treasury.\nThe President highlighted the need for a new value system focused on individual merit in an era where material possessions often overshadow genuine human values. He stressed that the country requires a public service driven by humanity and empathy towards others, fulfilling its duties rather than one marred by excessive consumerism and corruption.",
    "President Disanayake further emphasised that the public service should not be an inaccessible mechanism aloof from citizens. He underscored the importance of considering the impact of decisions on people’s lives when making policy choices. The President concluded by stating that young public officials have much to learn from the distinguished career of Mr Mahinda Siriwardana, a senior public servant with extensive experience and profound understanding.",
    "In his address, Mr Siriwardana described his three-year tenure as Secretary to the Treasury as the most significant period of his professional life. He thanked the President for maintaining confidence in him and allowing him to continue in the position despite a change in government leadership, noting that the President’s support was a great source of strength. Mr Siriwardana added that the country might not have overcome its economic crisis without President Anura Kumara Disanayake’s faith, resilience and boundless dedication.",
    "During the ceremony, the President also presented Mr Siriwardana with a commemorative token in appreciation of his outstanding service.",
    "The event was attended by Dr Anil Jayantha Fernando, Minister of Labour and Deputy Minister of Economic Development; Dr Harshana Suriyapperuma, Deputy Minister of Finance and Planning; Dr Nandika Sanath Kumanayake, Secretary to the President; Dr Hans Wijayasuriya, Chief Presidential Adviser on Digital Economy; Mr Duminda Hulangamuwa, Senior Presidential Adviser on Economic Affairs; other government officials; and family members of Mr Mahinda Siriwardana, amongst other invited guests."
  ]
}