{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2024-11-18-en-074df3",
  "num": "en-074df3",
  "date_str": "2024-11-18",
  "description": "Ministers Must Exercise Their Unlimited Power with Responsibility",
  "url_metadata": "https://pmd.gov.lk/news/ministers-must-exercise-their-unlimited-power-with-responsibility/",
  "lang": "en",
  "article_title": "Ministers Must Exercise Their Unlimited Power with Responsibility",
  "article_body_paragraphs": [
    "I would like to express my gratitude to everyone who supported and worked tirelessly to grant the National People’s Power (NPP) a strong mandate.",
    "There is no division between groups of people be it those who are happy and those who are shocked by the election results.",
    "The support and trust of all the people are essential to achieving the goals set by the National People’s Power.",
    "The election results represent a call for the freedom of the oppressed. The people longed for this freedom.",
    "As significant as our victory is, the responsibility we now bear is equally substantial.",
    "Let us unite and work together to fulfill this mission!",
    "– President Stated Following the Swearing-in of the New Cabinet",
    "President Anura Kumara Dissanayake emphasized that the immense power granted to the ministers must be wielded with responsibility. He acknowledged that while the victory is monumental, the weight of the responsibility that comes with it is equally important, and that collective effort is needed to carry it forward.\nThese remarks were made by President Dissanayake during the ceremony held this morning (18) at the Presidential Secretariat, where the new Cabinet Ministers of the National People’s Power Government were sworn in.",
    "In his address, President Dissanayake further elaborated on the critical importance of responsibility in leadership.\n“A decisive turning point in Sri Lankan politics occurred on September 21, marking a momentous shift in the country’s trajectory. On this day, the people made a bold choice to change the long-traveled path of our nation. Their decision was further reinforced by the parliamentary elections that followed, where the general public placed their trust in us with renewed confidence.",
    "This transformative journey saw the enthusiastic participation of citizens across the nation. Historically, Sri Lanka’s political landscape has often been defined by a divide; North against South, and vice versa, which was fueled by mistrust and division. However, this election has shattered those boundaries, demonstrating that the politics of division no longer holds sway. For the first time, the aspirations of the people in the North, South, East, and West have converged on a shared vision for our future.",
    "We extend our heartfelt gratitude to everyone who contributed to the strong mandate given to the National People’s Power. Even those who voted for other political movements are part of this shared journey, as the goals we pursue are aligned with the aspirations of all Sri Lankans. We firmly believe that no citizen supports the politics of corruption, nor does any politician seek to erode democracy. These values of integrity, fairness, and democracy, are deeply ingrained in our society. Through their votes, the people have reaffirmed their commitment to these principles, and we trust that those who did not vote share these same ideals.\nIn this context, there are no winners or losers in this election. There are no divisions between those celebrating the results and those disappointed by them. Instead, we all share a collective responsibility to achieve the goals that will uplift our nation. We need the trust and support of every citizen to realize these objectives.\nEven after our victory in the presidential election, we have consistently demonstrated our commitment to peacefully upholding democracy and respecting the political rights of all. This commitment remains at the heart of our efforts to build a united and prosperous Sri Lanka.\nI believe this is a new experience for the people of this country. However, we trust that this experience is one every citizen of our nation has long hoped for. Furthermore, during and after the general election, our administration provided the opportunity for one of the most peaceful elections in Sri Lanka’s history. This was their right.\nThis election is truly historic, marked by several unique characteristics. Quantitatively, it represents the most significant victory ever achieved in a general election in Sri Lanka. Politically, it is the first time in electoral history that a political movement has secured governance through such a victory. On the other hand, it is a victory that the people of this country can genuinely celebrate. Such a triumph has been possible for us and our citizens because these changes are essential for our nation.\nWe have often seen in our country’s history that whenever a victory is achieved, it tends to lead to resentment or suffering for the defeated or the opposing side. However, this election has allowed us to create a new political culture for our country. This culture ensures that, even after the general election, we have maintained stability and safeguarded the continuity of this progressive political approach.\nEvents may occur. At one moment, there may be peaceful democracy; at another, there may be instances of conflict. However, these situations only become recurring if we allow them to stabilize through repeated occurrences. That is why the windows we open for democracy and our commitment to protecting the democratic rights of citizens should not be reduced to mere isolated events or limited to a handful of occasions. If we continuously safeguard and uphold these principles, they will transcend mere occurrences and become enduring practices.\nTherefore, it is our responsibility to consistently protect and elevate the rights of citizens within this democratic framework, ensuring they reach higher qualitative standards. I believe this is a critical responsibility of the government.",
    "Notably, during this election campaign, Sri Lankans living abroad provided us with remarkable support, enthusiasm, and courage. In the history of our elections, there has rarely been such a level of interest demonstrated by the diaspora. I believe their involvement and contributions in this election surpassed all previous instances, reflecting their active participation and engagement.\nEven though they are outside Sri Lanka, we know they celebrated the results of this election with great joy and enthusiasm. We are profoundly grateful to them for their unwavering support.\nWe understand that, generally, the significance of politics during an election lies in bringing our ideas and perspectives to society. In doing so, our political movement played its part, but there was also a new generation that voluntarily took on this responsibility through social media. It is essential that we recognize the unique aspirations of this younger generation. What they showcased on social media was not merely a competition, a race, or a contest to distinguish winners from losers. Instead, it reflected their hopes and goals. Therefore, we must remain committed to these aspirations, as I believe they are vital. We take this opportunity to express our gratitude to everyone who contributed in various ways to achieving this victory.\nHowever, there is something we must understand. The secret behind this public uprising, filled with immense hope, lies in the long-standing struggles faced by our citizens. For years, people have endured various forms of oppression. Instances where citizens felt helpless and victimized before the law were all too common. Economically, there exists a marginalized group of people who have been ignored, reduced to mere “dust” within the system. These are individuals who lack access to proper meals, decent housing, and opportunities for a healthy, fulfilling life, burdened by economic hardships.\nMoreover, professionals have faced frustrations within their fields, unable to freely apply their knowledge and skills. This has created deep-seated grievances for those struggling to perform their duties effectively. Similarly, there are communities who, based on the language they speak, the religion they follow, or their cultural identity, have experienced discrimination and alienation.\nThese individuals have often felt isolated within Sri Lanka, considering themselves sidelined or excluded rather than being equally represented and entitled to their rights.\nThis sense of marginalization and oppression has been pervasive, shaping the deep challenges faced by many in our country.\nAcross every sector, people in this country have faced unique and deeply personal struggles. I know that even government officials, tasked with upholding the law, have been victims of this oppression. That is the reality. Therefore, the results of this election symbolize an invitation to freedom for those who have suffered. They longed for this freedom, driven by the need to escape the various forms of oppression they endured. These election results are an affirmation of their demand for that freedom.",
    "We have no right to limit or restrict this freedom for our citizens. Instead, we must ensure full freedom across all sectors. This includes granting professionals the liberty to carry out their responsibilities with their knowledge and expertise, enabling law enforcement officials to fulfill their duties in upholding law and peace, ensuring fair economic participation for all, and reaffirming every citizen’s right to live freely according to their religion, language, and cultural identity. It is for these reasons that we say Sri Lanka must move toward a period of renewal.\nWe must create a more liberated environment for the people of this country. We recognize that this victory was achieved through the immense involvement of ordinary people. Many who had no direct connection to our political mechanism, whom we had never met or spoken with, worked tirelessly on our behalf. Whether on buses, trains, workplaces, or during community events, countless individuals advocated for our victory.\nIt is also important to remember that this victory was the result of a long struggle, spanning decades. Many among us have been committed to this dream since their youth. In this struggle, people sacrificed not only their time and effort but, in some cases, their very lives. During the early and most challenging phases, we worked relentlessly to protect this movement. While some left midway, even those who departed provided critical support at various stages at the beginning, in the middle, and wherever needed. Their contributions, too, have been instrumental in achieving this victory.\nTherefore, we have two distinct responsibilities. The first is our obligation to fulfill the goals and aspirations of the people. The second is our duty toward the movement itself. We firmly believe that power is something very significant. Power generates more power, expands its influence, and continues to grow. However, history has shown, and some argue, that power is corrupt where unlimited power leads to unlimited corruption. This is true. Power can corrupt, and absolute power can corrupt absolutely, as has been proven repeatedly.\nIn our country, there have been instances where such concentrated power was created. But if we examine the outcomes of those powers, they rarely brought justice or fairness to the people.\nInstead, they were often wielded in ways that harmed the nation and its citizens. Some might believe that unlimited power has been granted, leading to concerns about where this unrestricted power might lead.\nTo anyone harbouring even a small doubt, I want to say this: Yes, it is true that we hold power. However, we also recognize the boundaries and limitations of this power. We understand the framework within which this power has been entrusted to us. It is important for all of us to acknowledge that power exists, but it comes with constraints and a purpose.\nThe purpose of this power lies in fulfilling the positive goals and expectations that we have promised to the people over a long period. It is a responsibility entrusted to us to use this power for the greater good and to achieve the aspirations of our citizens.",
    "The key point is that this power comes with responsibilities, on one side, a responsibility to the citizens, and on the other, a responsibility to the movement. I believe that no matter what form of power is created for us through constitutions, regulations, or other mechanisms, we must exercise it with accountability. We are accountable to the people and to the movement. This is why power cannot exist in isolation or function arbitrarily. It must be bound by responsibility and commitment.\nI believe that compared to an ordinary citizen, a Member of Parliament, and even more so, a Cabinet Minister, has a greater responsibility. This is something you all must understand; I don’t need to explain it anew. You are aware of the boundaries and limitations of your power. You know your responsibilities and commitments, and I trust that you will safeguard them.\nAdditionally, there’s another discussion to be had. Many of you are new to the Cabinet, and some are even new to Parliament. However, for a long time, we have all worked toward various goals on different platforms. Some of you have worked as professionals, others as political activists. While you may be new to these positions, you are not new to politics or to working for change.\nThis gives me confidence that this Cabinet can bring new and inspiring examples to the people and deliver the victories that the country expects. If we execute our responsibilities effectively, I am confident you have the ability, the commitment, and the integrity to fulfill these tasks. I personally know that you are unblemished, honest, and courageous, and I firmly believe you will approach your responsibilities with sincerity. It is with this confidence that we move forward.\nIn politics, there was a time when we worked solely to build the movement and rally people around political goals. Our slogans, campaigns, and actions were all geared toward winning power. We fought tirelessly to make our case to the citizens of this country, and the results of that effort are now evident. We have achieved political victory.\nHowever, moving forward, our work will not rely solely on political slogans. Before September 21 and November 14, our focus was on our principles and political ideologies. But from November 14 onward, the measure of our success will be the quality of governance we deliver. Previously, we were judged on the effectiveness of our political activism; now, we will be evaluated on whether our governance is good or bad. This is the new standard by which we will be measured.\nTherefore, in order to achieve the goals that the people expect, and to address the long-standing efforts we have made, good governance is essential. This is necessary to guide us towards our targets. We are not driven by slogans or ideologies; from today onwards, we are measured by how effectively we manage our efforts to achieve our goals.\nThe magnitude of our success is significant, and along with it comes the weight of the responsibility entrusted to us. At times, we have said that we will fight for victory, and after that, the relevant capable teams will take the next steps. However, whether for good or bad, we have had to fight for victory. After the victory, we have become the leaders responsible for ensuring the success of that mission.",
    "Thus, all of this lies with you. You are the centre. How capable are you of guiding your field to achieve productive results and fulfilling the responsibilities entrusted to you? How successful are you in meeting your personal commitments and duties? Our next success or failure will be determined by this.\nOn September 21 and November 14, we made progress in two stages. As we decide whether we will succeed or not in the next phase, your role is crucial. We can only conclude this successfully if you remain committed to good governance. For this, let us work together. Let us raise our voices together.”"
  ]
}