{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-07-08-en-27b9d0",
  "num": "en-27b9d0",
  "date_str": "2025-07-08",
  "description": "President Directs Inland Revenue Department Digitalisation to Achieve…",
  "url_metadata": "https://pmd.gov.lk/news/president-directs-inland-revenue-department-digitalisation-to-achieve-2030-digital-economy-targets/",
  "lang": "en",
  "article_title": "President Directs Inland Revenue Department Digitalisation to Achieve 2030 Digital Economy Targets",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake today (08) emphasised the critical need to strengthen and digitalise the Inland Revenue Department (IRD) to achieve Sri Lanka’s strategic digital economy objectives by 2030.",
    "The President made these remarks during a discussion held this afternoon at the Presidential Secretariat with representatives from the Inland Revenue Department, the Ministry of Digital Economy and the Ministry of Finance.",
    "During the meeting, particular attention was paid to the ongoing operation and local procurement process of the IRD’s existing Revenue Administration Management Information System (RAMIS). Discussions also focused on identifying current shortcomings within the RAMIS system and providing appropriate technological solutions. President Disanayake underscored that digitalisation is absolutely essential for efficient tax administration.",
    "The primary goals of this initiative were also discussed, including minimising tax irregularities, simplifying the tax system, enhancing tax transparency and introducing Point of Sale (POS) machines for transactions. These measures are expected to broaden the country’s tax base and make the tax payment process more convenient for the public.",
    "IRD officials stated that the current government’s intervention in establishing a Ministry of Digital Economy would facilitate the easy achievement of the Inland Revenue Department’s digitalisation goals.",
    "The digitalisation of the Inland Revenue Department is a crucial step in the government’s overall digitalisation programme and is expected to contribute significantly to Sri Lanka’s economic growth.",
    "Attendees at the discussion included the Secretary to the President Dr. Nandika Sanath Kumanayake, Secretary to the Ministry of Finance Dr. Harshana Suriyapperuma, Chief Advisor to the President on Digital Economy Dr Hans Wijesuriya, along with officials from the Ministry of Digital Economy, the Ministry of Finance and the Inland Revenue Department."
  ]
}