{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-11-en-80e984",
  "num": "en-80e984",
  "date_str": "2025-06-11",
  "description": "Representatives of the Tony Blair Institute meet Secretary…",
  "url_metadata": "https://pmd.gov.lk/news/representatives-of-the-tony-blair-institute-meet-secretary-to-the-president/",
  "lang": "en",
  "article_title": "Representatives of the Tony Blair Institute meet Secretary to the President",
  "article_body_paragraphs": [
    "A discussion between Dr Nandika Sanath Kumanayake, Secretary to the President and officials of the Tony Blair Institute for Global Change was held today (11) at the Presidential Secretariat.",
    "The purpose of the meeting was to identify the priorities of the new government’s agenda and to express support for its implementation.",
    "During the discussion, attention was focused on examining the programmes implemented by the Ministry of Digital Economy, the Ministry of Agriculture, the Export Development Board and the Board of Investment. The aim was to identify their respective priorities and explore the provision of financial and technical assistance to support these areas.",
    "As part of this field visit, officials from the Tony Blair Institute for Global Change have agreed to visit each ministry, observe the respective programmes closely and provide the necessary support.",
    "Among those present at the occasion were Senior Additional Secretary to the President Roshan Gamage, Senior Additional Secretary to the President Russel Aponso, Managing Director of the Asia Pacific Advisory Division of the Tony Blair Institute Jaleel Rashid, Head of Government Relations for the Asia Pacific team Anna Aden, Director of the Department of Agriculture, Livestock, Land and Irrigation (Agri Technology) B.M.V.S. Basnayake, Director (Development) of the Ministry of Digital Economy Janaka Geekiyanage, Director General of the Board of Investment of Sri Lanka Renuka M. Weerakone and Chairman/Chief Executive Officer of the Export Development Board Mangala Wijesinghe, among others."
  ]
}