{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-03-05-en-6cfd47",
  "num": "en-6cfd47",
  "date_str": "2025-03-05",
  "description": "Implementing Structural Reforms in Sri Lanka Customs to…",
  "url_metadata": "https://pmd.gov.lk/news/implementing-structural-reforms-in-sri-lanka-customs-to-align-with-the-modern-era/",
  "lang": "en",
  "article_title": "Implementing Structural Reforms in Sri Lanka Customs to Align with the Modern Era",
  "article_body_paragraphs": [
    "– The President stated during a discussion with senior officials of Sri Lanka Customs.",
    "President Anura Kumara Dissanayake stated that structural reforms will be implemented within Sri Lanka Customs to establish an institutional framework that aligns with contemporary needs.",
    "The President made these remarks during a discussion held with the senior officials of Sri Lanka Customs today (05) at the Presidential Secretariat concerning the Budget-2025 and the institutional restructuring.",
    "The discussion also addressed critical issues such as inefficiencies, fraud, corruption and public dissatisfaction with the current functioning of the Customs Department.",
    "In response to these challenges, President Dissanayake emphasized the adoption of new technologies aimed at accelerating departmental operations and enhancing service delivery efficiency.",
    "The new restructuring plans for the department were thoroughly discussed, during which President Anura Kumara Dissanayake directed the officials to enforce stringent laws aimed at eliminating inefficiencies within Sri Lanka Customs.",
    "Furthermore, the President emphasized the need for expediting human resource management, recruitment processes, and the acceleration of infrastructure development.",
    "The President also acknowledged the revenue targets successfully achieved by Customs in the previous year and highlighted the necessary measures that the Customs Department must adopt to achieve the revenue target for the current year.",
    "The Minister of Labour and Deputy Minister of Economic Development, Dr. Anil Jayantha Fernando; the Secretary to the President, Dr. Nandika Sanath Kumanayake; the Secretary to the Ministry of Finance, Mahinda Siriwardana; the Senior Additional Secretary to the President, Russel Aponsu; the Director General of Sri Lanka Customs, P.B.S.C. Nonis; along with a group of senior officials from Sri Lanka Customs, also participated in this discussion."
  ]
}