{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-03-25-c883b8",
  "num": "c883b8",
  "date_str": "2025-03-25",
  "description": "Students of Visakha Vidyalaya Engage in a Special…",
  "url_metadata": "https://pmd.gov.lk/news/students-of-visakha-vidyalaya-engage-in-a-special-student-parliament-session-at-the-old-parliament-building/",
  "lang": "en",
  "article_title": "Students of Visakha Vidyalaya Engage in a Special Student Parliament Session at the Old Parliament Building",
  "article_body_paragraphs": [
    "As part of the series of programmes conducted for schoolchildren by the Presidential Secretariat, the Ministry of Education and the Sri Lanka Parliament Department of Communication, a special Student Parliament session for Visakha Vidyalaya, Colombo, was held today (25) at the Old Parliament Chamber of the Presidential Secretariat. The event was conducted under the patronage of Prime Minister Dr. Harini Amarasuriya.",
    "During the session, the student parliament members of Visakha Vidyalaya had the opportunity to gain insights into the conceptual and practical significance of the “Clean Sri Lanka” initiative.",
    "A special commemorative edition of the ‘Vision’ magazine, which focuses on the student Parliament initiative, was presented to the Prime Minister by Nadeeka Dangolla, Assistant Director of Parliamentary Affairs and Executive Functions.",
    "Furthermore, the Principal of Visakha Vidyalaya, Mrs. Manomi Seneviratne, presented a special commemorative token to Prime Minister Dr. Harini Amarasuriya.",
    "Addressing the gathering, Prime Minister Dr. Harini Amarasuriya highlighted that the government’s commitment to implementing new educational reforms aimed at nurturing a generation capable of seizing economic opportunities.",
    "The Prime Minister further stated that the government aims to prepare Sri Lankan children to acquire global knowledge while fostering a self-reliant and empowered future generation.",
    "The Prime Minister stated that the objective of the new education reforms is not only to align education with job market demands but also to cultivate skilled youth who can contribute to the economy and provide leadership to society.",
    "Furthermore, she underscored the government’s commitment to addressing resource disparities among schools and emphasized the significance of civic responsibility in this endeavour.",
    "Speaker Dr. Jagath Wickramaratne\n‘Leadership must be devoid of selfishness. Selfless leaders guide both the nation and its people towards a better direction. To achieve this, skills must be enhanced. We can learn about talented leaders from both Sri Lankan history and global history. We should study as children how Chandashoka transformed into Dharmashoka and how Hitler’s regime brought devastation to the world. A nation achieves stability when leaders who prioritize minimal personal consumption and demonstrate a true dedication to their nation arise. Therefore, we must strive to cultivate leaders who can face challenges and prioritize national interests. By fostering selflessness, we can ensure a prosperous future for our people.’",
    "Senior Presidential Media Advisor Mr. Chandana Sooriyabandara\n‘The students gathered here today are not just future leaders; they are leaders already. Leadership knows no age. Anyone who stands for a group could be consider as a leader. Those who exercise the power of the group are considered leaders. Throughout Sri Lankan history, individuals who contributed to the country through their words and actions have played leadership roles. Therefore, logical reasoning should lead the process of making decisions. Both leaders and citizens share the duty to act rationally. You all have a duty to shape a prosperous nation through logical thinking, and this obligation lies with every young person.’",
    "The event was also attended by Deputy Speaker Dr. Rizvie Salih, Deputy Chairperson of Committees Hemali Weerasekara, Secretary-General of the Parliament Kushani Rohanadeera, Senior Additional Secretary to the President K.M.N. Kumarasinghe, Director-General of Legal Affairs to the President J.M. Wijebandara, Principal of Visakha Vidyalaya Manomi Seneviratne, along with members of the teaching staff and a group of students."
  ]
}