{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-06-21-en-f476fb",
  "num": "en-f476fb",
  "date_str": "2025-06-21",
  "description": "All Services of the President’s Fund Officially Launched…",
  "url_metadata": "https://pmd.gov.lk/news/all-services-of-the-presidents-fund-officially-launched-at-divisional-secretariat-level/",
  "lang": "en",
  "article_title": "All Services of the President’s Fund Officially Launched at Divisional Secretariat Level",
  "article_body_paragraphs": [
    "The official launch of providing all services of the President’s Fund through Divisional Secretariats across the island took place this morning (21) at the Kilinochchi District Secretariat.",
    "Coinciding with the launch, a special training workshop for officials in the Northern Province was held at the same venue, as part of a series of workshops aimed at decentralising the President’s Fund operations to grassroots level.",
    "Since 7 February this year, applications for medical assistance from the President’s Fund have been accepted through all Divisional Secretariats across the country. Following the successful implementation of this programme, steps have now been taken to extend digital access to all other services offered by the Fund.",
    "Accordingly, the public can now apply online for a range of services including poverty alleviation assistance, educational scholarships, recognition for academic excellence, support for individuals with special needs, aid for children affected by the human-elephant conflict, recognition for national and public service and emergency or disaster relief. This marks the first time in the Fund’s 47-year history that services, previously limited to Colombo, are accessible via any Divisional Secretariat nationwide.",
    "This advancement follows a decision made by the Board of Governors of the President’s Fund, chaired by the President. It is expected to improve efficiency, expand access to a wider population and minimise opportunities for misuse.",
    "Senior Additional Secretary to the President and Secretary of the President’s Fund, Mr Roshan Gamage, briefed attendees on the Fund’s responsibilities and range of services.",
    "As part of the government’s digitalisation drive, the official rollout of online services of the President’s Fund also took place during the event.",
    "Minister of fisheries, aquatic and ocean resources Mr Ramalingam Chandraseker, Northern Province Governor Mr Nagalingam Vethanayahan, the Kilinochchi and Jaffna District Secretaries, other senior government officials from the Northern Province, regional officers of the President’s Fund and its administrative staff were present at the occasion."
  ]
}