{
  "doc_type": "lk_pmd_press_releases",
  "doc_id": "2025-04-05-en-f2e2ba",
  "num": "en-f2e2ba",
  "date_str": "2025-04-05",
  "description": "President and Indian Prime Minister Jointly Launch and…",
  "url_metadata": "https://pmd.gov.lk/news/president-and-indian-prime-minister-jointly-launch-and-inaugurate-three-development-projects/",
  "lang": "en",
  "article_title": "President and Indian Prime Minister Jointly Launch and Inaugurate Three Development Projects",
  "article_body_paragraphs": [
    "The inauguration and commencement of three development projects implemented in the country with the assistance of the Indian Government took place today (05) in conjunction with the State visit of Indian Prime Minister Shri Narendra Modi, at the invitation of President Anura Kumara Disanayake.",
    "These projects include the commencement of construction of the Sampur Solar Power Plant, which will add 50 megawatts to the national grid, the inauguration of the Temperature and Humidity Controlled Agro Cold Storage complex in Dambulla and the installation of solar panels on 5,000 religious sites. President Anura Kumara Disanayake and Prime Minister Shri Narendra Modi jointly inaugurated and launched these projects via virtual technology following their official meeting at the Presidential Secretariat this morning.",
    "Prime Minister Modi’s visit to Sri Lanka reaffirms the concept of “Friendship of Centuries, Commitment to a Prosperous Future,” strengthening the deep-rooted ties between the two nations.\nThe Sampur Solar Power Plant is part of the Eastern Renewable Energy Zone, which is being established under Sri Lanka’s Long-Term Generation Expansion Plan (LTGEP). It is being developed by Trincomalee Power Company, a joint venture between India’s NTPC Limited and the Ceylon Electricity Board (CEB).",
    "The project is planned in two phases, with the second phase scheduled to commence in 2027. A 500-acre land area has been allocated for this initiative, under the first phase it will contribute 50 megawatts of electricity to the national grid. The project will incorporate state-of-the-art N-type TOPCon solar cell technology, enhancing energy security and promoting a shift from fossil fuel dependency to renewable energy sources. Consequently, the Sampur Solar Power Project is expected to reduce annual carbon dioxide emissions by approximately 2 lakh tonnes.",
    "",
    "The Dambulla Agricultural Storage Complex (Cold Storage Facility), with a capacity of 5,000 metric tons and equipped with temperature and humidity control, was inaugurated today with the objective of reducing post-harvest losses by approximately 40%, stabilizing fluctuations in agricultural product prices, ensuring the supply of high-quality food to consumers and enhancing agricultural sustainability.",
    "To facilitate research on advanced storage methods for different crops, the facility includes six storage chambers, each designed to simulate various climatic conditions. This is the first facility of its kind in Sri Lanka, built at a total cost of LKR 524 million, with LKR 300 million provided as a grant by the Government of India and LKR 224 million contributed by the Government of Sri Lanka.",
    "The project to install solar panels on 5,000 religious sites spans all 25 districts and includes places of worship representing all major religions. The Government of India has invested USD 17 million in this initiative, which is being implemented jointly by the Ceylon Electricity Board, the Sri Lanka Sustainable Energy Authority and Lanka Electricity Company (Pvt) Ltd.",
    "Under this project, 5,000 solar panel systems with a capacity of 5 kW each will be installed on the rooftops of Buddhist, Hindu, Muslim, Catholic and Christian places of worship. This is expected to add 25 megawatts of solar power capacity to the national electricity grid. The initiative underscores the government’s commitment to a cost-effective, sustainable and reliable energy system."
  ]
}