{
  "doc_type": "lk_pmd_press_release",
  "doc_id": "2025-02-10-1e10d7",
  "num": "1e10d7",
  "date_str": "2025-02-10",
  "description": "President Leaves for Dubai to Attend 2025 World…",
  "url_metadata": "https://pmd.gov.lk/news/president-leaves-for-dubai-to-attend-2025-world-government-summit/",
  "lang": "en",
  "article_title": "President Leaves for Dubai to Attend 2025 World Government Summit",
  "article_body_paragraphs": [
    "President Anura Kumara Disanayake departed from Sri Lanka today (10) for a three-day official visit to the United Arab Emirates at the invitation of UAE President Mohamed bin Zayed Al Nahyan.",
    "During this visit, President Disanayake is scheduled to address the 2025 World Government Summit in Dubai.",
    "The primary objective of the World Government Summit is to foster a global dialogue by bringing together world leaders in a single forum to discuss futuristic approaches, technological innovations, and other key topics. The summit serves as a platform for nations to exchange knowledge on current global challenges, emerging trends, and new opportunities.",
    "Representatives from over 150 countries and more than 4,000 participants are expected to attend the event.",
    "In addition to attending the summit, President Disanayake is set to hold bilateral discussions with heads of state and government leaders from several participating countries.",
    "A bilateral meeting between President Anura Kumara Disanayake and UAE President Mohamed bin Zayed Al Nahyan is also scheduled, with the Sri Lankan government anticipating enhanced cooperation between the two nations across multiple sectors.",
    "Furthermore, during his visit, President Disanayake is expected to meet with UAE Vice President and Prime Minister Sheikh Mohammed bin Rashid Al Maktoum.",
    "To attract investments to Sri Lanka, President Disanayake will engage in discussions with top executives from leading global corporations in sectors such as Information Technology (IT), Artificial Intelligence (AI), energy, tourism, finance and media.",
    "Minister of Foreign Affairs, Foreign Employment and Tourism Vijitha Herath accompanied the President."
  ]
}